{"text": "Bring a large pan of salted water to the boil and cook the pasta following pack instructions. Meanwhile, heat 1 tbsp oil in a large frying pan and add the breadcrumbs. Toast until they are golden and crispy, then tip out onto a plate and set aside. Wipe the pan clean with kitchen paper.\nHeat another 2 tbsp oil in the pan and add the chilli, garlic and anchovies. Sizzle for 1-2 mins but don’t let the garlic brown. Add a drizzle of the oil from the anchovies, stir and set the pan aside.\nWhen the pasta has 2 mins to go, add the cavolo nero. Remove a cup of cooking water before draining the pasta, then tip it into the frying pan and return to the heat. Add a splash of cooking water, the remaining 1 tbsp oil (along with another drizzle from the anchovies if the pasta looks dry) and the lemon zest and juice. Season well and cook for 1-2 mins, tossing everything together and adjusting the seasoning if necessary. Serve in bowls scattered with the pangrattato."}
{"text": "Heat the oil in a large shallow saucepan or flameproof casserole dish. When it’s shimmering, add the wings and the turkey pieces, and spend a good 20 mins browning them well in the oil – sticky bits of meat in the pan will add flavour.\nTip in the vegetables, herbs and porcini, scatter over the sugar and stir everything in. Turn down the heat and brown the vegetables for another 10 mins. Stir in the flour, then pour in the Prosecco and simmer down to a paste.\nStir in the stock and bring to the boil, scraping the bottom of the pan as you stir. Skim any scum off with a ladle and simmer steadily for 30 mins until thickened and reduced by about a third. Season to taste with salt and stir in a squeeze of lemon. Leave to cool slightly, then strain through a sieve into a container and chill. Can be made three days ahead, or frozen for up to three months.\nOn the day, simply reheat or pour into the turkey roasting tin and reheat with the roasting juices. If not serving to children, finish with a splash more Prosecco just before serving, if you like."}
{"text": "At least 2 hrs before baking, wrap the butter for the pastry in foil and freeze it.\nTip the flour into a big bowl with 1 /2 tsp salt. Hold the butter block in the foil (peeling back a little at a time as you need), then coarsely grate straight into the bowl of flour, dipping the end of the butter into the flour every so often – this helps to stop all the butter clumping together. Use a cutlery knife to lightly stir together. Stir in about 120ml cold water to bring the dough together, then wrap in cling film and chill for 30 mins.\nTo make the filling, mix the butter, brown sugar, currants, mixed peel, lemon zest, cloves and port in a saucepan over a medium heat. Cook until the butter has melted and the port has become thick and sticky, then leave to cool at room temperature for 1 hr.\nRemove the pastry from the fridge 10 mins before rolling. Roll out to the thickness of a £1 coin and stamp out into circles using a 10cm cutter. Bring the pastry trimmings together and re-roll to make a few more circles. Divide the filling between the pastry and brush the edges with a little water. Pull up the sides and pinch together to seal. Flip the cakes over and press each one down with the palm of your hand to make a puck. Arrange over two baking sheets.\nWhisk the egg white until a little foamy, then brush over the cakes and sprinkle over the granulated sugar. Slash the top of each one a few times with a sharp knife, then chill for at least 20 mins. You can also freeze the cakes for up to two months at this point.\nHeat oven to 200C/180C fan/ gas 6. Bake the Eccles cakes for 20-25 mins until golden and crisp. If baking from frozen, add another 5 mins. Cool for at least 10 mins before serving. Will keep in an airtight container for up to three days."}
{"text": "You’ll need 6-8 dariole moulds or small individual pudding basins. Tip 150g of the sugar into a shallow pan and place over a medium heat. Cook the sugar until dissolved and turning to a light amber caramel. While it is still hot, carefully pour the caramel over the base of the moulds, tipping them around so some caramel also sticks to the sides. Set aside.\nSoak the gelatine in very cold water for about 10 mins to soften. Tip the cream, remaining sugar and the vanilla pod and seeds into a saucepan. Place on the heat, stirring to combine and dissolve the sugar. Bring to a simmer, stirring occasionally, then remove from the heat. Add the drained, squeezed gelatine leaves and stir to dissolve, then leave to cool. When tepid, remove and squeeze out the vanilla pod, stir in the buttermilk, then strain everything into a jug. Share the mixture between the moulds, then place in the fridge for at least a couple of hours, or preferably overnight to set. \nTo serve, dip the bases of the moulds briefly into very hot water until the fillings just come away from the sides. When you are confident that it will turn out, place a serving plate over the mould and carefully turn, allowing the contents to drop out onto the plate, scooping out any caramel sauce left in the mould and drizzling over the puddings. Serve immediately."}
{"text": "Fill a highball glass with ice and pour in the rum and tequila. Stir then top with ginger beer. Slowly pour in the espresso."}
{"text": "Put the coffee grounds in a pan with 250ml water. Add the cardamom pods, lemon peel, cloves and cinnamon stick. Bring to the boil, then strain though a sieve lined with 2 pieces of kitchen paper. Leave to cool.\nPour 50ml of the coffee mixture into a cocktail shaker filled with ice then add the egg white, spiced rum and lemon juice. Shake hard for 1-2 mins then double strain into 2 coupe or martini glasses. Decorate with another cardamom pod and a few drops of Angostura bitters if you like."}
{"text": "Whisk the whisky and honey together and split between 2 heatproof glasses. Add half of the cinnamon stick to each, then top up with 200ml boiling water.\nAdd a splash of lemon juice to each, then taste and add more to your preference. Finish each with a slice of lemon, studded with a clove, and serve immediately."}
{"text": "Put the jasmine tea and frozen berries into a large teapot. Add the cinnamon stick, star anise, cloves,  ginger and orange. Fill the teapot with up to 1 litre water.\nLet it steep for 3-4 mins, then strain into teacups to serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. Rest each potato on a large serving spoon and cut widthways at 3mm intervals – cutting the potato on a spoon stops you slicing all the way through. Repeat with all the potatoes. Roughly grind the peppercorns with a \n.\nMelt the butter and oil in a large roasting tin. Once sizzling, add the potatoes and pared lemon zest. Toss well so that all the potatoes get coated in the fat, then season well with salt and three quarters of the freshly ground black pepper. Roast on the bottom shelf of the oven for 1 hr-1 hr 15 mins until golden and tender. Discard the lemon zest and scatter over the remaining pepper to serve."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line a baking tray with lightly oiled baking parchment. Mix the sugar and salt in a large bowl and set aside.\nMelt the honey in a frying pan over a low heat. Add the almonds and spices and stir to coat. Transfer the nuts to the baking tray and spread them out in a single layer. Bake for 10-15 mins until golden brown, scraping the nuts from the side to the centre from time to time so they cook and colour evenly.\nRemove from the oven and cool slightly for 5 mins until the nuts become sticky, then toss them in the sugar and salt mixture. Cool completely, then divide them between cellophane bags."}
{"text": "Lightly oil the ice lolly moulds. Melt the chocolate in a bowl set over a pan of just-simmering water, stirring occasionally – take care to not scald the chocolate, as this will make it waxy and granular. Alternatively melt the chocolate in short, sharp bursts in a microwave on a medium heat. Put the spoons or lolly sticks into the holes of the lolly mould.\nDivide the melted chocolate into four separate bowls. Now work quickly to add the different flavours. Stir the ground cardamom into one bowl and fill two lolly moulds to the top of the spoon, then sprinkle on the chopped pistachios. Mix the orange zest into the next bowl, then fill two moulds to the top of the spoon and top with candied peel. Mix the nutmeg into the next bowl, then fill two moulds as before and top with white chocolate. Add the star anise to the final bowl of chocolate, mix, then fill the remaining moulds and top with the freeze-dried raspberries.\nChill the moulds in the fridge for at least 2-3 hrs. When the chocolate has completely set, ease the stirrers out of the moulds, wrap each spoon in cellophane and secure with string. Add a label that reads ‘Stir me into hot milk’, if you like. Keep cool until you need them."}
{"text": "Heat oven to 180C/160C fan/gas 4. To make the stuffing, melt the butter in a shallow pan, then fry the onion, garlic, prunes and bacon until the onion is translucent and the bacon is slightly coloured. Add the brioche and cook until combined and broken down, then add the sage, season and remove from heat.\nPut a sheet of baking parchment on a sheet of foil (both should be larger than your venison). Arrange four pieces of string across the kitchen counter and put the foil and parchment on top – this will help the venison to keep its shape. Lay another four pieces of string across the parchment. Lay the pancetta on top of the paper and string, slightly overlapping the slices so that they cover an area roughly the size of your opened-out venison.\nLay the venison on top of the pancetta, skin-side down, then spoon the stuffing down the centre, patting it with your hands to make it into a sausage shape.\nFold in the sides of the venison, along with the pancetta, so they touch or slightly overlap – use the foil and baking parchment to help you. Tie the strings around the venison, making sure that the foil and parchment enclose the meat but stay outside it. Fold in the ends and tie the other pieces of string tightly around the outside of the parcel to hold it in shape.\nPut the venison on a baking sheet or in a roasting tin. Roast for 40-50 mins or until a meat thermometer pushed into the joint reaches 60C, for medium rare meat. Rest for 10 mins, then remove and discard the foil and parchment. Brush the venison all over with butter and return to the oven for a final 10 mins. Leave to rest for 10-15 mins before removing the string and slicing."}
{"text": "Cook the pearl barley with the stock cube according to pack instructions. Reserve 4 tbsp of the cooking stock, then drain the grains well. \nBring a large pan of salted water to the boil, then add the parsnips, and cook until really soft. Drain well, tip back into the pan to steam dry for a few minutes, then roughly mash. Mix the ground linseeds with the reserved stock water, and leave to go gluey.\nPut 2 tbsp of the oil in your largest frying pan with the onions and garlic. Fry gently until soft and golden, then stir in the mushrooms, rosemary and sage. Fry the mushrooms until they're golden too, and any liquid that comes out has evaporated. Scrape into a big mixing bowl and set aside to cool.\nGrease a 22-24cm savarin or ring tin generously with oil. If it's not a non-stick tin, line it with thin strips of overlapping baking parchment.\nAdd the mashed parsnip, cooked pearl barley, gluey seed mix, grated vegan hard cheese (if using), chopped parsley and whole hazelnuts to the fried mushroom mixture. Season generously with salt and nutmeg, then mix everything together really well. \nSpoon the filling into the tin, and press down firmly to fill the tin and flatten the top. Keep in the fridge for up to 24 hrs before baking.\nHeat the oven to 200C/180C fan/gas 6 and cover the tin with foil. Bake for 45 mins, until a skewer poked into the centre of the mixture comes out piping hot.\nUse a small palette knife or cutlery knife to release the filling all the way around, then sit a serving plate on top and flip over. Carefully lift off the tin, and top the wreath with some parsnip crisps if using and whole pumpkin seeds to serve – plus some extra rosemary sprigs if you like. Slice into wedges and enjoy."}
{"text": "Tip the milk into a saucepan with the mushrooms and bring to the boil. Simmer for 1 min, then remove from the heat and leave to cool completely. Strain the milk well, pressing down on the mushrooms to squeeze out any excess liquid, then set both the milk and the mushrooms aside.\nTo make the batter, tip the flour into a bowl and beat in the eggs until smooth. Gradually add the flavoured milk and carry on beating until the mixture is completely lump-free. Stir in the soaked mushrooms and season. \nHeat oven to 230C/210C fan/gas 8. Drizzle a little oil evenly into two four-hole Yorkshire pudding tins (or two 12-hole non-stick muffin tins to make 24 small puddings) and put in the oven for around 10 mins to heat through. Pour the batter into a jug and remove the hot, oiled tins from the oven. Carefully and evenly pour the batter into the holes. Put the tins back in the oven and leave for 20-25 mins until the puddings have puffed up and browned. Serve immediately. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Pile the sausages in groups of three and wrap a piece of bacon around each trio. Arrange on a baking tray and brush or drizzle with the oil. Roast in the oven for 30-35 mins until the chipolatas are golden and the bacon is crisp."}
{"text": "Place the potatoes in a large pan of cold, salted water with the herbs. Bring the water to the boil and simmer gently for 8-10 mins until the potatoes are cooked through but not about to collapse. Gently drain the potatoes in a \n, but don’t shake or ruffle up. Leave to drain and cool. If making ahead, place on a tray in a single layer and leave in the fridge, uncovered, until ready to roast. \nHeat oven to 200C/180C/gas 6. Pour the oil into a deep \n (the oil should be about 0.5cm deep) and put in the oven for 5 mins. Remove from the oven and gently tip the potatoes and herbs into the oil. Use a spoon or \n to turn the potatoes until they’re completely coated in oil, then return the tin to the oven and roast for 40 mins.\nRemove from the oven and turn the potatoes in the oil again. Return to the oven for 20 mins, then turn the potatoes in the oil once more. Turn the oven up to 220C/200C fan/gas 7 and cook for a final 20 mins, or until golden and crunchy. Sprinkle with a little sea salt to serve."}
{"text": "Heat the oven to 190C/170C fan/gas 5. Cream the butter and sugar until pale and fluffy, then beat in the egg and vanilla. Stir in the flour and mix to a fairly soft dough. Tip onto a lightly floured surface and knead gently. Put the dough on a plate, cover and chill for at least 2 hrs.\nOn a lightly floured surface, roll out the dough to a thickness of around 0.5cm. Use a cookie cutter or water glass to stamp out 7cm rounds. Re-roll the trimmings and repeat.\nTransfer the biscuits to two lined baking trays and bake for 8-14 mins until the edges turn lightly golden in colour. Leave to cool.\nTo decorate, roll out the white fondant icing on a surface lightly dusted with icing sugar. Stamp out 7cm circles using the same cookie cutter or glass as before, then use a dab of the white tube of icing to stick a fondant round on each biscuit.\nKnead together some of the yellow and blue icing to make green icing, then do the same with the red and yellow icing to make orange (alternatively, buy separate packs of each colour). Roll out one icing colour at a time. Stamp out a 7cm circle of icing, cut in half and stick on for a hat. Cut a strip of another colour and make some markings to make it look like the elasticated band of a hat, then trim to fit and stick on. Repeat with all the biscuits, mixing and matching colours.\nDecorate the hats with icing spots and stripes, if you like. Roll out balls of coloured icing, poke holes all over with a cocktail stick and stick on as pom poms. Mould lumpy balls of the orange icing for noses and roll out balls of the black icing for eyes. Press down to flatten, then stick on with white icing. Use the tube of black icing to pipe rows of dots for the smiles. Leave to set. "}
{"text": "Separate the egg whites and yolks into two large \n. \n the whites until stiff. Add the sugar to the yolks and whisk again (no need to clean first) until thick and foamy – this will take about 5 mins. Whisk the mascarpone and cream liqueur into the egg yolks until you can’t see any streaks of cheese. Carefully fold the whites into the mascarpone mixture with a large metal spoon to keep in as much air as possible.\nGet your serving dish ready (ours was 20 x 15 cm). Pour the coffee into a shallow dish and dip in a few sponge fingers at a time, turning them for a few seconds until they are nicely soaked, but not soggy. Layer these into the dish until you have used half the biscuits, then evenly spread over half of the creamy mixture. Using the coarse side of the grater, grate over most of the chocolate, then repeat the sponge and cream layers (you should use up all the coffee). If you want a pretty finish, you can pipe on the final cream layer.\nCover and chill for a few hours or overnight. \n To serve, dust with cocoa powder and grate over the remaining chocolate."}
{"text": "Mix together the crème fraîche, vanilla seeds, brandy and sugar. This can be chilled for up to 2 days – just give everything a good stir. sprinkle on a little extra sugar before serving."}
{"text": "Line a baking sheet with non-stick baking paper and heat oven to 160C/fan 140C/gas 3. Cut the orange into thin slices and space out in a single layer. Sift over a thin layer of icing sugar and bake for 40-45 mins until dry but not over-browned. Allow to cool completely.\nMeanwhile, make the frosted rosemary. Beat the egg white with a fork until lightly frothy, then spread the caster sugar over a large, flat plate. Dip the tips of the rosemary into the egg white, shake off the excess and roll in the caster sugar. Set aside to dry on a sheet of baking paper or a plate, for at least 30 mins.\nMeanwhile, make the royal icing. To decorate, spoon almost all of the royal icing onto the centre of the cake. Arrange the frosted rosemary, a couple of orange slices and the rest of the decorations on top, pressing them into the icing to secure. Position the candles last. Tie the ribbon around the base and fix with a dot of leftover icing."}
{"text": "Boil the shallots in their skins for 10-15 mins until they are soft but still hold their shape. Leave to cool then slip the skins from the shallots and halve them. Can be prepared a couple of days in advance, then chilled.\nHeat the oil in a large non-stick wok, and stir-fry the garlic, fennel seeds and shallots for a couple of mins until the shallots are golden. Remove from the pan.\nAdd the cabbage to the pan and stir-fry until it starts to wilt a little, then pour in the stock, cover the wok and cook for 3 mins until just tender. Test to see if the cabbage is done to your liking; if not, cook a little longer, then add the shallot mixture, heat through and serve."}
{"text": "Heat the butter in a small frying pan over a medium heat. Once foaming, add the apple. Fry for 2 mins until beginning to caramelise, then remove with a slotted spoon onto a plate. Add the black pudding to the butter and cook for a further 2 mins, turning halfway until crispy. Remove with a slotted spoon and set aside with the apple.\nWhisk the mustard, honey and vinegar into the butter and cook for 30 secs. Taste for seasoning and set aside on a very low heat to keep warm\nHeat the oil in a large, heavy-bottomed saucepan until it reads 190C on a thermometer, or a piece of bread browns in it within 15 secs. Carefully drop in the sprouts and cook for 3 mins until deep golden brown. Drain on kitchen paper, then scatter with flaky sea salt. Divide the sprouts between two plates, along with the watercress, apple and black pudding, then drizzle over the warm dressing."}
{"text": "Pour the vinegar into a pan, add the sugar, sea salt, the spices and bay leaf, and bring to a simmer. After 1 min, check that the sugar and salt have dissolved. Remove from the heat.\nBoil the kettle. Put the onion slices in a sieve or colander. Pour over the hot water from the kettle and drain well. When cool enough to handle, pack the onion rings into a 500g sterilised jar (see tip below). Pour over the warm vinegar and seal. Cool, then chill and leave to pickle for 2 hrs. Will keep for 6 months unopened, or 2 weeks in the fridge once opened."}
{"text": "Mix the flour, yeast, milk and a pinch of salt in a tabletop \n with a dough hook. Mix in two eggs and the vanilla, then knead until you have a smooth, springy dough. Cover and leave to rise for at least 2 hrs, or overnight in the fridge, until doubled in size. \nStart the mixer again and add the sugar, butter and yolk from the remaining egg. Keep mixing and kneading until the dough is smooth again. Tip in the fruit and knead again quickly. Cover and leave to rise somewhere cool or in the fridge (so the butter doesn’t melt out of the dough) for at least two hours, or overnight in the fridge, until doubled in size.\nLine a large six-hole muffin tin with paper cases. Divide the dough into six portions and roll into neat balls. Put a ball in each paper case, cover the tin with a tea towel and leave the dough to rise for 20 mins. Alternatively, chill in the fridge overnight, then leave the dough balls to warm up for 30 mins before baking.\nHeat the oven to 180C/160C fan/gas 4. Brush the tops of the muffins with the egg white and dust with caster sugar. Bake for 15-20 mins, or until the muffins have risen and are golden brown in colour. Leave to cool on a \n. "}
{"text": "Heat the butter and oil in a pan, then add the shallots, cloves, thyme and bay and cook very, very gently for 15 mins until soft, translucent and pale golden.\nRemove the cloves, add the milk and pepper, then bring to a gentle simmer for 10 mins. Stir in the breadcrumbs, give it another 5 mins or so over a very low heat until the bread has plumped up nicely, then stir in the cream and nutmeg. Fish out the stalks from the thyme – the leaves will have fallen off. Season to taste. To serve, grate over a little more nutmeg, drizzle with a little more cream and decorate with a bay leaf."}
{"text": "Reserve 1 bay leaf, then tip everything except the duck fat and serving suggestions into a bowl and season generously. If you have time, cover and leave the meat to marinate overnight in the fridge – however, this isn’t essential.\nHeat oven to 140C/120C fan/gas 1. Tip the meat and all the juices into a flameproof casserole dish with a lid. Pour over 250ml water, or enough to just cover the meat, and place the pan on a low heat. As soon as it starts to bubble, pop on the lid and put in the oven for 2½-3 hrs, removing it once to give it a good stir.\nThe meat should now be very tender. Leave it to cool slightly in the pan, then drain over a bowl to catch the fat and juices. Shred the pork by hand or put in a food processor and pulse a few times to shred, but don’t overwork it into a paste. Taste, add extra seasoning if needed, then press meat into 2 small or 1 large serving dish, or pack into individual ramekins. Pour the juices and fat back over the meat, and put in the fridge for at least 2 hrs for the fat to harden. (To keep the rillettes for a week or so, cover with a layer of duck fat, and lay a bay leaf and a couple of juniper berries on top for decoration.)\nServe with sourdough toast, cornichons and a few bitter leaves (such as curly endive, rocket and radicchio), in a sharp mustardy dressing."}
{"text": "Dry the prawns on kitchen paper and keep covered in the fridge. Lay out the poppadums on a serving platter.\nBefore serving, spoon a little tzatziki into each poppadum. Stand a prawn on top, then finish with a scattering of coriander and a light dusting of paprika."}
{"text": "Whisk the yolk and sugar until light and fluffy and doubled in size, about 3 mins. Beat in the Cointreau, lemon and the flesh of 2 passion fruits. Softly whip the cream until it just holds some shape (it stiffens quickly towards the end so whip slowly as it gets thicker). Chill 2 dessert glasses.\nTo assemble, gently fold the egg mix into the double cream, having first given the eggs another brisk whisk. Spoon the cream into little glasses and top them with the seeds from the remaining passion fruit and a drizzle of Cointreau."}
{"text": "Heat oven to 180C/160C fan/gas 4. Melt half the butter in a large saucepan, add the onion and cook until soft. Pour in the cream and milk, and add lots of seasoning. Add the sliced vegetables and gently simmer for 10 mins until the potatoes start to soften.\nMeanwhile, blend the herbs, garlic, most of the Parmesan and some seasoning in a food processor. Add the oil and blend again to form a paste.\nTip a third of the creamy veg into a buttered baking dish, dollop over half the herb mix and spread out a little. Top with another third of the veg, followed by the remaining herb mix, then the rest of the vegetables. Dot the surface with the remaining butter and scatter over the reserved Parmesan. Bake for 1-1½ hrs until bubbling and golden, covering with foil for the final 30 mins if it’s becoming too brown. Leave to rest for 10-15 mins before serving."}
{"text": "Heat oven to 140C/120C fan/gas 2 and cut a piece of baking parchment large enough to line your biggest baking sheet. Using a plate as a template, draw a circle roughly 28cm in diameter onto the parchment, then flip it over onto the baking sheet so the pencil marks don’t come into contact with the meringue.\nPut the egg whites in a large, clean bowl and beat with an electric whisk until doubled in volume and holding soft peaks. Add the sugar 1 or 2 tbsp at a time, whisking continuously, until the meringue is stiff and shiny, and the sugar has been used up.\nDab a blob of meringue on each corner of the parchment to stick it to the baking sheet. Using the circle as a guide, spoon 10 mounds of meringue onto the parchment in a wreath shape. Create a little divot in the centre of each one with the back of a teaspoon. Bake for 1 hr 30 mins, then leave in the oven to cool completely (overnight if you can).\nPut the cranberries and sugar in a saucepan and bring to a simmer. Turn up the heat and boil for 1-2 mins, until you have a sugary syrup, but the cranberries are still whole. Leave to cool completely.\nWhen you’re ready to serve, place the meringue wreath on a large board or plate. Pour the cream into a bowl, and add the zest and liqueur, if using. Whip until the cream just holds soft peaks. Fill each meringue crevice with a spoonful of cream, then top with 1-2 slices of clementine and some cranberries. Drizzle some cranberry syrup and sprinkle generously with pistachios, then let everyone dive in."}
{"text": "Place the sugar, soy, Shaohsing or sherry, star anise, cinnamon, chilli and 100ml water into a pan. Bring to the boil, then remove from the heat and cool. Slice the duck into thin strips, about 5mm wide, and place in the marinade. Leave in the fridge overnight.\nRemove the duck from the marinade. Pour 100ml of the marinade into a small pan along with the peanut butter. Finely chop half the marinated chilli, or pound to a paste using a pestle and mortar, and place in the pan. Cook over a low heat, letting it bubble for at least 5 mins. Add a little water if it starts to dry out. The sauce can be made up to 2 days ahead and kept in the fridge.\nTo cook the satay, thread the duck strips onto 20 wooden skewers that have been soaked in water for 1 hr. Mix 4 tbsp of the peanut sauce with the oil and brush all over the duck. Heat a griddle pan until really hot, then cook the duck for about 10 mins, turning until golden all over. You will have to do this in batches, so keep some warm in a low oven or make a day ahead and reheat in the oven. Serve with peanut dipping sauce."}
{"text": "Use a zester to zest the orange or use a peeler to peel off the zest, then finely shred it with a knife and set aside with the ginger. Halve and juice the orange.\nTip the orange juice and sugar into a shallow saucepan and boil gently until you get an amber-orange caramel. Scatter the zest and ginger into the caramel, cook for 1 min, then tip in the cranberries and Port, if using. Cook everything on a high heat for 5 mins until the cranberries are starting to split but still have texture. Leave to cool and serve with the turkey."}
{"text": "Heat oven to 220C/200C fan/gas 7. In a bowl, beat the flour and mustard powder with the eggs until you have a smooth, thick batter. Gradually beat in the milk until the batter is the same consistency as single cream, then stir in the herbs, and season.\nPour a drizzle of oil into each hole of a sturdy 12-hole muffin tin. Put the tin in the oven and heat for 5 mins. Working quickly, remove the tin and pour enough batter into each hole so that it comes two-thirds of the way up the sides. Carefully place the tin back in the oven and cook the puddings for about 20 mins until they are puffed up and brown."}
{"text": "Put the dried fruit and jam in a small pan, heat until melted together, then stir in the brandy and cool. Heat oven to 200C/180C fan/gas 6.\nFor the pastry, set aside 2 tbsp flour and put the rest plus the butter in a food processor. Whizz until there are no lumps of butter. Pulse in the egg yolk, followed by a tbsp of water at a time, until the dough comes together – you’ll probably need 2 tbsp. (If you don’t have a food processor, rub butter into the flour with your fingers, then stir in the yolk and water with a round-bladed knife.) Use the reserved flour to roll out the pastry to just over the thickness of a £1 coin. Stamp circles with an 8cm cutter and press into holes of a bun tin – you should get 15 from re-rolling the trimmings.\nDivide the fruit amongst the pies, then bake for 5 mins while you rub together all the crumble ingredients with your fingers. Top each pie with crumble, then return to the oven for 15 mins until pastry and crumble are golden. Eat warm or cold dusted with icing sugar."}
{"text": "Lay the salmon fillets, skin side down, on a board and brush your hand along it. If you feel any little pin bones pinch them out with your fingers or tweezers. In a bowl, mix all of the other ingredients for the salmon together to make the cure.\nStretch two large sheets of cling film over a work surface and spoon over some of the cure. Lay one of the fillets, skin side down, on the cure, then pack over most of the cure, and sandwich with the remaining fillet, skin side up. Top with the last of the cure and wrap both fillets together tightly with lots of cling film. Place in a container with sides, like a large roasting tray, put a smaller tray on top and weigh it down with a couple of tins. Leave in the fridge for at least three days or up to a week. Don’t be alarmed by the amount of liquid that leaks out, this is normal. Once a day, pour away the liquid, turn the salmon and re-apply the weights.\nTo serve, unwrap the salmon from the cling film and brush off the marinade. Slice the salmon into thin slivers. Make the dressing by mixing all the ingredients together with some salt and pepper. Toss all the salad ingredients together and serve each guest with a few slices of salmon, a handful of salad and drizzle with the dressing. Once made the salmon will sit happily in the fridge for up to a week and can be used just like smoked salmon."}
{"text": "Quarter the apples, cut out the cores and trim the ends. Heat the butter in a frying pan and toss in the apple wedges and sage. Cook for 2 mins, then sprinkle in the golden caster sugar and continue cooking for about 5 mins, stirring gently until golden and softened. Pour in the Calvados and cautiously flambé. Season lightly and keep warm until ready to serve."}
{"text": "To make the cookies, put the butter, sugars, treacle, egg and vanilla in a large bowl and mix together with an electric whisk until smooth and combined. In a separate bowl, mix together the remaining ingredients except the demerara. Add the dry ingredients to the egg mixture and mix until a very sticky dough is formed. Cover with cling film and chill for at least 4 hrs.\nHeat oven to 180C/160C fan/gas 4 and line two baking trays with baking parchment. Roll the cookie dough into balls, about a tablespoon in size, then roll in the demerara sugar. Place on the lined trays, leaving about 2.5cm space between cookies.\nBake for about 14 mins or until just lightly browned around the edges, swapping the trays over halfway through cooking. Allow to cool on the trays for 10 mins before transferring to a wire rack to cool completely.\nTo make the filling, beat together the mascarpone and lemon curd in a bowl until smooth and creamy. Transfer to a piping bag fitted with a plain round piping tip. Pipe a layer of the cream onto the base of half the cookies and sandwich together with the other half. Will keep for 3-4 days in a sealed container in the fridge – the texture will turn soft and cakey (this is no bad thing)."}
{"text": "Preheat the oven and cook the garlic bread according to packet instructions.\nWhile the bread is in the oven separate the chicory into leaves and toss in a large bowl with the celery, radishes, nuts and apples. Crumble the stilton in large chunks over the top.\nTo finish the salad, cut half the garlic bread into the marked slices. Cut the remainder into chunks and toss into the salad with as much dressing as you like. Serve with the remaining garlic bread on the side."}
{"text": "To make the pastry tip the flour into a large bowl and rub in the chilled butter using your fingertips until the mixture resembles coarse breadcrumbs. Stir in the sugar and the satsuma zest.\nSpoon out 4 tbsp of the pastry mixture and set aside. Add approximately 4 tbsp of the juice from the satsumas to the main pastry mix to make a fairly soft dough, kneading gently until smooth. Wrap in cling film and chill for 30 mins.\nLightly flour a surface and roll out the pastry to a £1 coin thickness. Using a 9cm fluted cutter, stamp out 12 circles of pastry. Gently press these into individual tartlet tins, the pastry should just protrude above the tins to allow for shrinkage when cooked. Spoon the mincemeat into the pastry cases being careful not to overfill.\nSprinkle the pastry crumble mix over the mincemeat to cover lightly, top with the flaked almonds and drizzle over the stem ginger syrup. At this stage you can cover them with cling film and freeze the whole tray ready for baking.\nWhen you're ready to bake the mince pies, heat the over to 200C/fan 180C/gas 6. Remove the cling film from the tray and bake the mince pies straight from the freezer for 25 mins until golden and cooked through. Cool on a wire rack and serve dusted with icing sugar. Bake unfrozen pies for 18-20 mins."}
{"text": "In a blender, purée the pears until smooth. Pour into a jug, then add a small splash of cranberry juice to stop the pear discolouring.\nWhen your guests arrive, put a few tsps purée in the bottom of each flute or glass, then add a splash more juice. Add a pinch of cinnamon, then top up with chilled Cava. Serve immediately, before making another batch with the leftover purée."}
{"text": "To make the sauce, mix all ingredients in a bowl, season well and set to one side. If you’re making this the day before, cover and place in the fridge until needed. Peel, then chop the avocados into small chunks, tossing in lemon juice as you go, so they don’t discolour.\nMix the prawns with half the sauce, add the avocados and stir gently to coat everything. Heat a griddle pan. To make the crostini, rub a little olive oil onto each slice of ciabatta and grill on each side for 2 mins until toasted.\nTo serve, spread a little cocktail sauce on each crostini, top with a lettuce leaf and add a spoonful of the prawn cocktail mix. Sprinkle with a little cayenne pepper and serve with lemon wedges."}
{"text": "Soak the potatoes in cold water for 1 hr, drain, then cut into quarters. Cook in boiling salted water for 5 mins, drain and set aside until cool enough to handle. Coarsely grate and transfer to a bowl.\nStir in the onion, garlic, flour, egg and plenty of seasoning. Divide the mixture into 24 and shape into small patties (known as latkes). Heat a little of the butter and oil in a large non-stick frying pan and fry the latkes over a medium heat for 3-4 mins each side until golden brown (you will need to do this in batches, add more butter and oil each time). Drain on kitchen paper and keep warm.\nMix the crème fraîche, herbs and horseradish sauce together and season. Spoon the mixture into a serving bowl. Slice the smoked salmon into strips and break the smoked mackerel into bite-sized pieces. Arrange on a serving platter with the potato latkes, herby crème fraîche and some lemon wedges."}
{"text": "The night before, mix the oats with the cinnamon in a large bowl. Stir in the apple juice and grated apple, cover with cling film and leave overnight in the fridge.\nIn the morning, stir through the clementine segments, divide between four bowls, then scatter over the almonds and pomegranate seeds."}
{"text": "Divide the icing in half. Knead the peppermint essence and blue food colour in to one half, in drips, until you have a flavour and colour you like. Repeat with the rosewater and pink colouring in the other half.\nRoll the two icings out on a lightly sugar-dusted surface to around ½ cm thick. Use a small biscuit cutter to stamp out shapes – we used hearts and stars in two sizes, then re-roll trimmings to get as many shapes as you can. If you want to use as decorations, stamp a hole out of the centre using the tip of a small piping nozzle or poking with the end of a skewer. Dry on a sheet of baking parchment for a couple of days. Store in airtight containers, layered between more sheets of baking parchment.\nTo make decorations or napkin rings, thread some ribbon through the holes and tie around a rolled up napkin, or to the tree."}
{"text": "Place the watercress, parsley and walnuts in a blender and pulse until finely chopped. Add the oil, lemon juice and sugar, and season well. Blend for 1 min until everything has combined into a thick green sauce. Can be made several hours ahead."}
{"text": "Place the potatoes in a pan of cold, salted water and bring to the boil. Turn down the heat and simmer for exactly 5 mins. Tip into a colander, then leave to drain for a good 10 mins to ensure they are really dry, before gently tossing in the colander to rough them up slightly.\nHeat oven to 200C/180C fan/gas 6. Heat the fat in a sturdy, roomy roasting tin on the hob until it starts to shimmer. Carefully lay the potatoes in a single layer in the fat and leave for 1 min to start to crisp. Turn them until completely coated in fat, then transfer the tin to the oven. Leave undisturbed for 40 mins to crisp up, then turn them again, adding the garlic if you like, before returning them to the oven for 20 mins or until completely crisp and golden."}
{"text": "Fill a saucepan with 500ml water, the milk, a good pinch of salt and a grinding of black pepper, then bring to the boil. Add the turnips and potatoes and cook for 2 mins. Strain, drain well and pat dry.\nHeat oven to 180C/160C fan/gas 4. Butter a baking dish and rub the sides with garlic to just add a hint of flavour. Mix the cream and mustard in a large bowl, add the potatoes and turnip, mix until well coated and season really well. Layer into the baking dish, flattening the top level. Can be assembled and chilled a day ahead.\nBake for 30-40 mins or until golden brown and the turnip and potato are cooked through – check with the point of a sharp knife."}
{"text": "Line 4 individual pudding moulds with cling film – brushing with oil first will help. Divide the ice cream between them, shaping so an even thickness covers the base and sides with a hollow in the middle. Mix the jam with 2 tsp of the kirsch, spoon into the ice-cream hollows, cover and freeze overnight.\nFor the base, heat oven to 180C/ fan 160C/gas 4. Butter and line a 20cm square cake tin. Reserve 2 tbsp of the almonds, then whizz the rest in a food processor until finely chopped and tip into a bowl with the flour, butter, beaten whole eggs and 100g caster sugar. Beat until smooth, then spread into the tin and bake for 15-18 mins until golden and springy. Cool on a wire rack. This cake will sit quite happily in a tin for 24 hrs, but stamp out the bases on the day or the edges will dry overnight.\nFor the meringue, whisk the egg whites until stiff, then add the remaining sugar and continue whisking until the meringue is thick and glossy. Can be chilled for up to 5 hrs. With a 7cm round cutter or rim of a pudding mould, cut 4 bases from the almond sponge. Drizzle with the rest of the kirsch, then sit them on a baking sheet lined with baking paper.\nWhen you’re ready to serve, heat oven to 220C/fan 200C/gas 7. Turn 1 ice cream out onto each round of cake, peeling off the cling film, then spread over meringue using a knife or small spatula until completely covered. Scatter with remaining almonds and bake for 3 mins until the tips of the meringues are just browning. Lift onto serving plates with a fish slice and serve immediately."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Oil a 23 x 33cm Swiss roll tin. Cut a rectangle of baking parchment 4cm larger all round than the tin. Fold in a 2cm strip all round, making a diagonal cut into each corner.\nFor the roulade, melt the butter in a large pan. Add the garlic and fry for 1 min. Add the flour and cook for 1 min, stirring constantly. Gradually beat in the milk. Bring to the boil, stirring constantly, until the sauce is thick and smooth. Remove from the heat and stir in half the cheese. Season, then allow to cool slightly. Beat in the egg yolks and parsley. Whisk the egg whites to stiff, but not dry peaks, then gently fold into the cheese sauce. Pour into the tin, tipping the tin so that the mixture fills all the corners. Bake for 15 mins until risen and golden.\nMeanwhile, heat the oil and butter in a large wok or frying pan and stir-fry the spring greens and garlic for 4-5 mins until tender. Season.\nSprinkle the remaining cheese over a sheet of baking parchment just larger than the tin. Turn the roulade out onto the parchment, then peel off the lining paper. Trim the crispy edges off the roulade. Use a slotted spoon to remove the spring greens from the garlicky butter, then spread over the roulade leaving a 2.5cm space at one short end uncovered. Roll up the roulade from the short end with no filling on it, using the paper to help. Serve the roulade immediately, drizzled with any remaining garlicky butter."}
{"text": "At least 24 hours before serving, mix the salt, pepper and herbs, except the thyme sprigs, in a large bowl. Add the duck legs and rub in the herby salt until well coated. Cover and leave overnight or up to 24 hours in the fridge.\nNext day, wipe the salty mixture from the duck legs and place them in a single, tight-fitting layer in the base of a pan. Add the bay leaves from the bowl and pour over the goose fat. If it doesn’t cover the duck, top up with the groundnut oil. Cook over the lowest possible heat for 2½ hours, so the fat barely bubbles. The duck skin should be creamy rather than golden once cooked. Transfer the legs to a bowl and strain in the fat, pushing the duck under until fully submerged. (The duck can now be chilled and refrigerated for up to 1 month.)\nWhile the duck is cooking (or up to 2 days ahead of the meal), make the madeira gravy and cabbage. For the gravy, melt the butter in a small pan, add the shallots and cook for 6-8 minutes, stirring until golden. Stir in the flour and cook, stirring all the time, until the flour browns – take care not to let it burn. Whisk in the stock and continue whisking over the heat until slightly thickened. Add the madeira and cook for 2 minutes more. Strain through a sieve into a bowl. (The gravy can now be cooled and chilled for up to 2 days.)\nFor the cabbage, scoop 2 tbsp of the goose fat from the duck as it cooks (if making at another time use olive oil) and put into a medium pan. Add the shallots and cook, stirring, until softened. Tip in the juniper berries and cabbage and cook over a fairly high heat until the cabbage starts to soften. Stir in the vinegar, orange juice, raisins and redcurrant jelly. Cover and leave to cook for 15 minutes, stirring now and then until tender. (Cool and chill for up to 2 days if making ahead.)\nOn the day, preheat the oven to fan 180C/ conventional 200C/gas 6. Remove the duck legs from the fat and wipe away any excess with kitchen paper. Put the duck on a wire rack in a roasting tin and top each leg with a sprig of thyme. Roast for 10 minutes, then add the creamy wild mushroom potatoes to the oven (see recipe, below) and cook with the duck for 30 minutes, or until the duck skin is golden. Meanwhile, reheat the cabbage and gravy in separate pans until piping hot.\nTo serve, put a generous spoonful of cabbage on serving plates and sit the duck legs on top. Spoon round the gravy and serve with the potatoes. For a green vegetable, quickly stir fry some sugar snaps."}
{"text": "Heat the butter in a large, heavy-based frying pan and add the onions. Cook over a medium heat for 6-8 mins, turning occasionally, until golden and caramelised. Meanwhile, cook the sprouts in a pan of boiling salted water for 3-4 mins until just tender.\nStir the sugar and vinegar into the onions and allow to bubble for a few secs. Remove from the heat, drain the sprouts thoroughly and toss through the onion mixture to serve."}
{"text": "Knead the ready-to-roll icing until smooth, then roll out to approx 1cm thickness. Using snowflake cutters of various sizes, stamp out 3 snowflake shapes. Lay the snowflakes on baking parchment on a flat surface and leave overnight to harden. Keep any trimmings and wrap up in cling film.\nNext day, make the royal icing. Drop a writing tube into a piping bag and spoon in a third of the icing. Spread the rest around the base of the cake to create a snowdrift effect. Pipe snowflake outlines over the cut-out snowflake shapes and pipe snowflakes all over the surface of the cake in different sizes and designs. Leave for 1 hr until the icing has hardened slightly, then sprinkle silver lustre over the cake, snowdrift and snowflakes.\nUsing the leftover ready-to-roll white icing, mould thimble-sized supports for your snowflakes to lean against. Position the snowflakes on the top of the cake. Finally, fix the silver balls to the icing with a little more of the royal icing. Finish by scattering sparkles over."}
{"text": "Boil carrots and turnips for 3 mins until starting to soften then cool completely under cold running water. Can be blanched up to a day ahead.\nWhen you’re ready to serve, heat butter and caster sugar in a pan until the butter melts, add the veg and seasoning, then toss for 2 mins until just tender and glossy."}
{"text": "First, make the stuffing. Fry the onion in the butter for 5-10 mins until softened, then leave to cool completely. Thoroughly mix the remaining ingredients in a large bowl, including the cooled onions.\nIf the wings are attached, cut at the first joint (on most butchered birds they will have been removed). Find the wishbone between the neck and the breast, then use a sharp knife to scrape away the flesh around it. Gently pull it out, trying to keep it as one, cut it away and discard.\nPlace the pheasant, breast side down, on the board. Using a sharp boning knife, see tip, left, cut through the skin to the backbone along the length of the bird.\nWorking down the length of the pheasant, slowly run your knife down against the ribcage, keeping close to the bone and scraping the flesh away from both. Twist out the thigh joints when you get to them.\nVery carefully cut away the main carcass. This is where the skin is at its thinnest, so cut carefully as you don’t want to nip or pierce the skin.\nOpen the bird out like a book and lay it, skin-side down, on the board.\nSeason the bird’s flesh with salt and pepper then arrange half of the stuffing down the middle of each of the birds in a sausage shape.\nRe-form the bird by lifting the sides up and around the stuffing. After you’ve done one, repeat with the other pheasant.\nWrap each pheasant tightly and neatly with bacon so that the bacon goes all the way round the bird and joins on the underside.\nUsing butcher’s string, tie the pheasant at regular intervals around the width. Then tie it once around the length to hold the stuffing in.\nFinally, tie the legs together. The pheasant can be prepared to this stage and chilled up to a day ahead.\nHeat oven to 200C/ 180C/gas 6. Transfer the pheasant to a roasting tin. Roast for 45-50 mins, basting regularly with the juices from the tin. Finally, cover with foil and rest for about 15 mins. Serve in thick slices with the juices from the pan."}
{"text": "Slice the grapes in half, then cut the cheeses and quince paste into 12 pieces.\nThread a grape half onto a mini skewer, followed by a piece of each of the cheeses and a piece of quince paste. Repeat, then arrange the sticks on a serving platter."}
{"text": "Boil the potatoes for 5 mins in salted water until the outside of the potatoes starts to soften. Drain well, return to the pan and shake to fluff up the outsides – alternatively, you can scratch them with a fork. (This process will make them crispier.)\nHeat oven to 180C/160C fan/gas 4. Put the goose fat (if using) and oil in a large shallow roasting tin and heat for 8-10 mins until the goose fat has melted and the mixture is really hot. Remove from the oven, carefully tip in the potatoes and stir well to coat them in the fat. Spread them out as much as the space allows and roast underneath the turkey for 45 mins, turning frequently and adjusting the positions so that they brown evenly.\nWhen the turkey comes out of the oven, turn up the heat to 220C/200C fan/gas 7, season the potatoes with the flaky salt and roast for another 30 mins, turning halfway through the cooking time, until beautifully golden."}
{"text": "Heat oven to 150C/130C fan/gas 2. Place a large frying pan over a medium heat and pour in 1 tbsp of the oil. Dust the partridges in the flour and fry until evenly browned all over. Remove from the pan and drain on a piece of kitchen paper.\nPut a large casserole dish on the heat. Pour in the remaining oil, add the lardons and cook until the fat has rendered out and the lardons are crisp. Add the onion and celery to the pan and sweat down until soft. Stir in the apples to soften a little. Add the thyme, sage and the partridges, then pour over the cider and chicken stock and bring to the boil. Cover and transfer to the oven for 25 mins or until the thigh meat is cooked through and will come away from the bone, and the sauce has reduced and thickened. Remove from the oven and serve with the Smoked butter mash (see 'Goes well with')."}
{"text": "To make the sorbet, bring the tea, sugar and liquid glucose to the boil in a pan. Make sure the sugar and glucose have dissolved, then strain into a jug and leave to cool completely. Pour into an ice cream machine and churn until frozen, then transfer to a freezer-proof container and freeze until needed.\nTo make the cream layer, pour the cream into a heavy-based pan and bring to the boil. In a bowl, whisk together the egg and sugar, then pour over the cream and whisk until combined. Rinse out the cream pan and pour in the mixture. Return to the heat and cook gently, whisking all the time, until it reaches 88C – you’ll need a digital thermometer to test this. When it reaches this temperature, it will have thickened and the egg will be cooked. Pass the mix through a fine sieve into a clean bowl. Pour in the whisky, then squeeze any excess water out of the soaked gelatine and add to the bowl. Stir until all the gelatine has melted, then leave to cool a little. Pour into 4 small or 2 large glass dishes, leaving enough room for the jelly, and place in the fridge for at least 4 hours until set.\nMake the jelly when the cream layer is almost set, put the whisky and sugar in a small pan and bring to the boil, making sure the sugar has dissolved. Remove from the heat, squeeze out any excess water from the gelatine, add to the pan and stir until melted. Pass the jelly through a fine sieve into a jug and place to one side to cool completely.\nOnce the cream layer has set, remove from the fridge and pour over the cooled jelly. If you have some left, don’t worry, just leave it to set in the fridge and eat it on its own. Return to the fridge and chill until the jelly has set. Can be made up to 2 days in advance; once set, cover with cling film and store in the fridge.\nHeat oven to 180C/160C fan/gas 4. To make the crumble, rub the butter into the flour until it resembles crumbs, then mix in the remaining ingredients. Tip onto a baking tray and bake for 15-20 mins or until golden brown. You will need to stir it a few times to ensure it cooks evenly. Remove from the oven and leave to cool. When cool, bash to a semi-fine crumble. Store in an airtight container until ready to serve.\nRemove the set creams from the fridge and sprinkle over a generous layer of the crumble mix. Serve topped with a scoop of tea sorbet. Perfect with a shot of whisky!"}
{"text": "On Christmas Eve, put the potatoes in a large saucepan and cover with cold salted water. Bring to the boil, reduce the heat to a simmer and cook for 2-3 mins until slightly tender. Drain and give them a good shake in the colander. Tip into a large roasting tin lined with baking parchment and leave, uncovered, in the fridge overnight.\nWhen your turkey crown goes in, put the duck fat in your largest roasting tin and heat in the oven. After 10 mins, transfer your cold potatoes to the hot duck fat – you should hear them sizzle as they hit the tin. Toss to coat in the fat and season well with flaky sea salt, then spread them in a single layer so they crisp up better. Roast for about 1 hr 30 mins, turning a few times, to evenly brown. Serve immediately."}
{"text": "Wash and peel the baby carrots, keeping the green tops intact. Put them in a medium saucepan and half-fill with salted water. Bring to the boil and cook for 4 mins or until just tender. Drain, then transfer to a serving dish, season and stir in the butter."}
{"text": "Heat oven to 180C/160C fan/gas 4. Toss the carrot chunks, sweet potato and parsnip with 2 tbsp of the oil on a baking sheet. Roast in the oven until golden and tender – about 20-25 mins.\nMeanwhile put the last tbsp of oil in a deep frying or sauté pan with the onion, and cook gently for around 8-10 mins to soften. Stir in the saffron and rice, then stir in the stock. Bring to the boil, then reduce the heat so the rice is gently simmering and cook, stirring occasionally for 25 mins or until the rice is tender and stock just absorbed – like a paella. Stir in the cinnamon, coriander and both types of cumin, plus the chopped apricots and take off the heat. Leave to cool with the roasted veg while you get the rest of the ingredients and tins ready.\nRoughly chop the pistachios. Grease 8 small loaf tins with a little oil, then cut long strips of baking parchment to line the base and ends of each tin – with overhangs to help you lift out the loaves when they’re done.\nScrape the cooled rice into a big mixing bowl and stir through the beaten eggs with salt and pepper. Scatter over chickpeas if using, plus the roasted veg and 100g of the pistachios and fold through. Divide the mixture between the loaf tins, and use your hands to neatly round the tops. \nMake the sauce by combining all the ingredients with a little salt and pepper in a saucepan. Simmer for 20 mins until thickened and rich. \nAn hour before you want to serve, heat the oven to 200C/180C fan/gas 6. For the roasted pomegranate roots, mix the carrots, beetroot, shallots and oil in a big roasting tin with some seasoning. Roast on the top shelf for 15 mins, with an empty tray heating on the bottom shelf.\nStir the cumin seeds, pomegranate molasses, orange juice and zest through the veg and put back on the top shelf. Sit the Persian rice loaves on the preheated tray, and bake for another 30 mins together. Finally, stir the pomegranate seeds through the veg, and swap the shelves – so the loaves sit on the top, for a last 5 mins of cooking. Meanwhile gently reheat the sauce.\nCarefully lift the loaves out of their tins onto a platter, and scatter with the last 50g of chopped pistachios plus some coriander leaves. Let guests help themselves, sitting the Persian loaves in a pool of tangy tomato sauce – with spoonfuls of the roasted pomegranate roots, couscous, salad leaves and Greek yogurt alongside."}
{"text": "Pour the rosé wine into a large saucepan with the star anise, stem ginger, black peppercorns, allspice berries and pink grapefruit. Bring to a simmer over a medium heat then stir in the crème de cassis, strain into a jug then serve in heatproof glasses or cups."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the quail's eggs in a bowl of warm tap water to get them used to the change in temperature. Then bring about an inch of water to the boil in a saucepan and prepare a bowl with some iced water. Gently lower the quail's eggs into the boiling water and boil for 2 mins, then drop them into the iced water. Leave them in there until chilled. Carefully peel and set aside.\nToss the celeriac, apple, herbs and cheese together with the pumpkin seeds, chilli flakes and season. Combine the egg yolk with the Dijon and stir into the celeriac mixture. \n the egg white to stiff peaks and fold into the celeriac fritter mix.\nHeat a little rapeseed oil and butter in a non-stick frying pan. Put two dessertspoonfuls of fritter into the hot fat and fry for 1 min or until a caramelised crust has formed. Turn carefully and cook for a further 2 mins. Place on a lined baking sheet and bake for 5 mins. Remove from the oven and allow to settle on the sheet for a couple of mins. Dress the parsley and red onion with a little of the vinegar and rapeseed oil. Divide between plates and top with the quail's eggs and celery salt. Serve with the parsley salad."}
{"text": "Pour the cider, Calvados, apple juice and sugar into a large saucepan, and gently heat to mull.\nAdd the orange zest and spices, bring to a simmer, then turn down and keep on a low heat for 20-30 mins. Ladle into glass mugs to serve."}
{"text": "Soak all but one handful of the bread chunks in the milk and set aside. Heat the oil in a large non-stick pan and cook the onions with the fennel and chilli flakes (if using) for 10 mins until softened. Add the garlic and the cavelo nero or kale and cook for 5 mins until softened, adding more oil if needed. Leave to cool.\nTip the onion mixture and the remaining ingredients (aside from the handful of bread) into a large bowl, season generously and use your hands to scrunch everything together really well. Scatter the stuffing into a shallow roasting tin or baking dish. \n. Top the stuffing with the remaining torn bread. To cook, heat oven to 220C/200C fan/gas 7 and bake for 30-35 mins until the top is crispy."}
{"text": "Gently heat sugar and wine in a saucepan. Once sugar has dissolved, bring to the boil.\nTip in the chilli and cranberries, return to the boil, then turn the heat down and simmer for about 10 mins until the berries have popped but not completely collapsed. Take off the heat. The sauce will continue to cook with the heat from the pan, then thicken as it cools."}
{"text": "Gently melt the butter in a small pan and leave it to settle. Slowly pour the clear yellow fat from the melted butter into a small bowl or jug, leaving the milky liquid in the pan. Discard the milky bit. Pull apart and shred the ham as finely as possible into stringy strips – use a knife to help if you need to.\nMix the ham with the parsley, spices, vinegar, two-thirds of the butter and a little crunchy sea salt. Divide between 8 small ramekins or pots. Press down and flatten the surface with your fingers, then spoon or pour over the remaining butter. Chill until butter is solid, then wrap in cling film. Will freeze for up to 3 months.\nTo serve, defrost the pots overnight in the fridge if frozen. Serve with toast, cornichons and chutney, or dip pots briefly in a bowl of hot water and turn the potted ham out onto plates first."}
{"text": "Heat oven to 170C/150C fan/gas 3-4 and place the turkey in a large roasting tin. Tuck 3 of the onion halves and the lemon quarters into the cavity and season. Cover with foil, make sure there’s plenty of space between the turkey and foil for the air to circulate and seal the edges tightly so that no steam escapes. Roast for 4 hrs.\nMeanwhile, finely chop the remaining onion half, and mix with the butter and sage. Take the turkey out of the oven and raise the temp to 200C/180C fan/ gas 6. Brush the sage and onion butter all over the turkey and return to the oven, uncovered, for 45 mins until crisp and dark golden. If you’re making the roasties, then start them in the oven when the turkey goes back in, uncovered.\nTransfer the turkey to a warm serving plate, cover loosely with foil and leave to rest for 30 mins. Tip the juices out of the pan into a bowl, leave for a moment to settle, then scoop the buttery oil from the surface into a separate bowl. Spoon 2 tbsp of this oil back into the tin and return to the heat.\nStir the flour into the tin using a wooden spoon, scraping the residue off the bottom of the tin as you go. Cook for 2 mins, then stir in the Marsala or Madeira and bring to the boil. Make the reserved turkey juices up to 500ml using hot chicken stock and pour into the tin. Bring to the boil and simmer for a few mins, then add cranberry jelly. Keep warm until ready to serve."}
{"text": "Carefully cut the duck skin from the duck breast, then very finely chop the skin. Reserve 12 bacon rashers for lining the tin. Cut all the meat and remaining bacon into 1cm pieces, keeping the different meats separate (Step 1). Put all the best bits to one side.\nReserve the chopped bacon and, from the best bits, reserve 100g chopped chicken, 250g chicken livers, half the mixed game, half the duck and half the duck skin.\nPut all the remaining meat and duck skin into a food processor (include any fattier pieces) and blend to a mince. Transfer to a bowl and add the garlic, allspice, juniper berries, parsley, Armagnac or brandy, wine and stock. Mix in the reserved chopped meat and marinate in the fridge overnight.\nHeat oven to 180C/160C fan/gas 4. Grease a 1.5-litre loaf tin or terrine mould with butter. Lightly stretch the reserved bacon rashers (Step 2) and use most of them to line the tin or mould, overlapping slightly and leaving plenty of overhang at the top (Step 3). Pack the meat mixture into the tin (Step 4), then fold over the bacon overhang and lay the reserved rashers on top.\nCover the terrine with baking parchment, then cover tightly with foil. Put a folded tea towel in a roasting tin and set the terrine on top (Step 5). Pour enough hot water into the roasting tin to come just below the rim of the terrine tin.\nPut in the oven, then reduce heat to 160C/140C fan/gas 3 and bake for 1½ hrs. Take from the oven and leave to cool for 1 hr in the water bath, then remove and leave to cool completely.\nOnce cool, cut a strip of foil or card to fit the top of the tin, put it on top of the terrine and weigh it down with a few heavy cans (Step 6). Chill overnight.\nCarefully remove the terrine from the tin, wipe off all the jelly and serve in slices with the toasts and cornichons."}
{"text": "Heat oven to 200C/180C fan/gas 6 and cook the chorizo on a tray for 12 mins. Meanwhile, mix together the prawns and harissa. In a bowl, combine the garlic, mayo and yogurt to make a dip.\nTurn the chorizo, add the prawns to the tray and cook for 3 mins more. Sprinkle the parsley over the prawns, then thread each onto a skewer, followed by a sausage. Serve with the dip."}
{"text": "Whisk the dressing ingredients and set aside. Toss together the salad ingredients in a large bowl with the dressing. Serve from the bowl or pile onto a serving platter."}
{"text": "Rinse a 22 x 10 x 7cm deep loaf tin (about 1.5 litres in volume) with cold water, but don’t dry it. Line the tin with cling film, smoothing out as many of the wrinkles as you can.\nStir the chocolate, chestnut purée and amaretti biscuits together, then stir through the orange and zest. Gently fold in the cream until combined, then spoon the mixture into the tin. Smooth the top and cover with cling film. Freeze for 3-4 hrs until just firm.\nTake the parfait out of the freezer 20 mins before serving. To serve, dip the tin briefly in hot water, then turn out onto a serving plate and remove the cling film. Scatter over the grated chocolate and slice."}
{"text": "In a large bowl, mix the mustard and vinegar. Add the oils, mustard seeds, tarragon, spring onion and salt and pepper. Add the pears to the dressing, toss well, then cover and chill for up to 4 hrs until ready to serve. Place a wedge of each cheese on small serving plates, then divide the pear salad between the plates. Serve with biscuits, crackers and walnuts."}
{"text": "Put the veg in a large pan of salted water. Bring to the boil and cook for 15 mins until tender. Drain well, then mash adding the butter, oil and mustard. Season generously. Mix together until the butter has melted, and serve piping hot. This can be made a day ahead and reheated in the pan with a touch more butter, or in the microwave."}
{"text": "Boil the potato for 15 mins until soft. Meanwhile, place 25g of the butter and all of the cream in a heavy-based pan and bring to the boil. Slice the spring onions, separating the green and white parts, then add the white slices to the boiling liquid and cook for 1-2 mins to soften. Pass the cooked potato through a ricer or sieve to a really fine mash, then add to the pan and mix everything together. Set aside to cool.\nAdd the crabmeat and sliced green bits of spring onion to the potato mixture and stir together. Melt the remaining butter. Unwrap the filo pastry and cover with a clean, damp tea towel to prevent it drying out. Brush melted butter over one sheet, place another on top and brush again with butter. Then add a final sheet of filo.\nCut the filo sheets lengthways into 3 long strips. Then cut each strip in half across the middle. Place a teaspoon of the crab onto the bottom right-hand corner of each filo strip. Fold the filo over to make a triangle, then fold again, rolling up the strip. When the mixture is enclosed and you have a neat triangle shape, place on a baking sheet and brush with more butter. Can be made ahead up to this point and frozen for up to 1 month.\nHeat oven to 200C/fan 180C/gas 6. Cook the rolls for 15-20 mins until golden and crisp. To serve, pile the parcels up on a plate or bowl, then scatter over with extra sliced spring onion, if you like."}
{"text": "Heat oven to 220C/200C fan/gas 7. Put 1 slice of pancetta on a chopping board and stretch out using the back of a knife. Put 1 sage leaf and 1 sausage on top, and roll the sausage up on the diagonal, covering all of it. Put on a lightly greased baking sheet and repeat with the remaining sausages. \n Cook for 20-25 mins until crisp and cooked through."}
{"text": "Cut a 3m length of kitchen string and tie a fat knot 10cm from one end. Thread the other end onto a big, blunt needle, such as a tapestry needle. Thread on bay leaves, popcorn and cranberries, in a random pattern. Tie off when you get to the other end, leaving enough string to hang it up with."}
{"text": "Ask your butcher to remove the meat from the rabbit, or do it yourself. The leg meat can be as roughly prepped as you like, but keep the loins as neat as you can.\nPut the leg meat, trimmings and pork belly in a processor, finely chop, then tip into a large bowl. Melt the butter and cook the garlic, shallots and thyme together gently for 8 mins or until the shallots are soft but not coloured. Tip onto the minced meat, add the allspice, peppercorns and 3 tbsp brandy, then mix well. Leave to mingle for 1 hr, or longer if you like, in the fridge.\nAdd the oil to the pan and quickly brown the loins; you don’t need to cook them through. If you fancy, add 1 tbsp brandy to the pan and flambé them to finish. Set aside on a plate and tip any pan juices into the minced mixture.\nHeat oven to 160C/140C fan/gas 3. Remove the garlic from the mince and season generously. It’s a good idea to fry a small ball of the mixture, let it cool, then taste to check the seasoning. Line a 900g loaf tin with a strip of foil. Stretch each piece of bacon a little with your knife. Arrange the rashers so that the base of the tin is covered with overlapping bacon and the rashers come neatly up the sides in a single layer and overhang generously. Boil a kettleful of water.\nPress a third of the mince into the tin. Make a lengthways channel along one side, then poke in a line of loin pieces, so that they meet end-to-end. Scatter half the cornichons over the other side. Add the next third of mince and repeat, this time with the loins and cornichons on the opposite sides. Cover with the remaining mince, then bring the bacon over to seal. Wrap tightly in foil and put in a deep roasting tin. Pour in enough hot water to come halfway up the terrine and bake for 2 hrs or until a skewer comes out hot from the middle of the terrine, and the juices run clear. Top up the water if needed.\nTo press the terrine, sit the loaf tin on a rack in a roasting tin. Tear some cardboard to fit the top of the loaf tin as neatly as you can (we used egg box lids). Add a few layers and sit something extremely heavy on top to press the cardboard and terrine down (we used a cast-iron dish). Cool to room temperature, then chill completely, ideally overnight. Remove the weight and re-wrap the terrine in clean foil or cling film. Ideally, let it mature for 2 days in the fridge before eating. Serve with the pickle salad, below, and remaining cornichons."}
{"text": "Put the chicken thighs into a pan with the stock and a string-tied bundle of 2 bay leaves, a few of the thyme sprigs and a little of the parsley. Add a few leek trimmings, the peppercorns and ½ tsp salt. Add water to just cover the meat, if needed. Bring to the boil, then cover and gently simmer for 30 mins.\nMeanwhile, lightly butter a 900g loaf tin (ours was 12cm x 22cm x 7cm) and line with cling film, leaving plenty of overhang. Melt the butter in a \n, then add the leeks, shallots and some seasoning. Cook for 10 mins over a medium heat until starting to colour. Add the bacon and garlic and cook for 2 mins more until the bacon is cooked through. Leave to cool.\nAdd the chicken breast to the stock mixture and top up with hot water to cover. Bring to the boil, then cover and simmer gently for another 20 mins. When ready, the chicken breast will be cooked through and the thigh meat will pull away easily from the bones. Lift the meat from the pan, drain the stock and leave to cool until it is just warm.\nDiscard the bones and any knobbly bits, then roughly chop the chicken. Stir into the leek mixture, along with 2 tsp more thyme leaves, the apricots and the brandy.\nSoak the gelatine in cold water for 5 mins until floppy. Squeeze out the excess water, stir into 300ml of the warm stock, then mix with the chicken. Put a few bay leaves in the base of the tin, then spoon the chicken mixture on top and press down well. Cover with the cling film. Leave to cool, then chill thoroughly – overnight is best. \nTo serve, slice the terrine while it's still wrapped in cling film, then carefully peel the cling film off each slice. Drizzle the toast slices with olive oil and grill until golden brown and crisp, then sprinkle with a little salt. Serve the terrine with the toast and our yogurt piccalilli & crisp kale salad."}
{"text": "Cook the potatoes in a large saucepan of boiling salted water until tender. Drain, then place back in the warm pan to dry out a little.\nPour the vinegar over the potatoes and add a few pinches of salt. Let sit for 10 mins to cool, then add the remaining ingredients and toss gently. Taste and add a little more salt if necessary, then pour into a serving dish."}
{"text": "Arrange the salad ingredients on a large platter or big salad bowl. Pour the dressing ingredients into a glass jar with a fitted lid, add some seasoning and shake well. When ready to serve, pour the dressing over and toss everything together."}
{"text": "Blanch the sprouts in boiling water and drain well. Heat most of the oil in a wok and add the ginger. Sizzle for a moment, then add the sprouts and stir-fry until hot. Scatter over the sesame seeds and drizzle with a touch more oil. Season with salt, if you like, and serve."}
{"text": "Line a baking tin with baking parchment. Heat both chocolates in separate bowls in the microwave in 30-sec blasts, or over pans of simmering water. Pour the dark chocolate into the baking tin, then pour the milk chocolate on top in a trail. Spread the chocolate out to make a reasonably thick slab.\nArrange the red smarties over the slab at intervals – these are the reindeer noses. Cut a marshmallow in half and press above the smarties to make eyes. Snap a pretzel in half for each set of antlers, snapping off any excess pretzel, then push into the chocolate near the noses.\nTo make the snowmen, arrange the rest of the marshmallows in lines of three. Use pieces of pretzel for the arms and a piece of shoe lace for the scarf. Sprinkle over the stars and sprinkles, then leave the chocolate to set completely.\nOnce the chocolate is hard, use an icing pen or small brush dipped in black food colouring to add pupils to the reindeer eyes, and faces and buttons for the snowmen. Use a knife to cut the bark into pieces around the reindeer and snowmen. To give them as gifts, put the chocolate shards in cellophane bags and tie with a pretty ribbon."}
{"text": "In a large frying pan, gently cook the shallots, garlic and juniper in the oil and half the butter until soft and golden – about 10 mins.\nAdd the sprouts and stock and simmer for 10 mins until sprouts are just tender and syrupy. Stir in the remaining butter with some seasoning and serve."}
{"text": "A day ahead, divide the pomegranate seeds between the holes in an ice cube tray, top up with water and freeze.\nReserve half the mint for serving, and tear the rest into a large jug with the lime quarters. Using a rolling pin, bash the mint and lime to release the flavours. Add the pomegranate juice and lemonade. Put ice cubes in each glass, then strain over the pomegranate mix through a small sieve. Garnish with lime slices and more mint."}
{"text": "Finely grate the beetroot and mix with the lemon zest, tarragon, sugar and salt.\n2 Line a shallow dish with several layers of cling film in different directions, so it hangs over the edges. Spoon in half the beetroot mixture, drizzle with half the gin and put the salmon fillet on top. Spread the rest of the beetroot mix on top of the salmon, drizzle over the rest of the gin, then wrap as tightly as possible in the cling film. Leave to cure in the fridge for 48-72 hrs, turning the salmon occasionally (the longer you leave it, the firmer it becomes). Drain off any liquid as it escapes.\nWhen the salmon is cured, scrape off the salt mixture really well, then rinse with cold water and dry well.\nFor the salad, put the sugar in a pan with 2 tbsp water and melt over a low heat. Bring to the boil and bubble until you have a golden caramel. Add the walnuts and mix together to coat. Tip onto a baking sheet lined with greased baking parchment and leave to cool.\nSegment the citrus fruits over a bowl to catch the juice. Cut each segment into two or three pieces. Mix 4 tbsp of the juice with a pinch of salt and sugar, and plenty of black pepper. Whisk in the oil.\nFinely slice the salmon. Divide the watercress and fruit segments between eight plates, then top with salmon. Scatter over the walnuts, drizzle over the dressing and serve."}
{"text": "Add the advocaat and lemonade to a tall glass filled with ice. Stir gently until the outside of the glass feels cold.\nGarnish with the maraschino cherry. "}
{"text": "Heat oven to 180C/160C fan/gas 4. Remove giblets, then wash and dry the turkey, removing any remaining feathers. Mix half the butter with the orange zest and plenty of seasoning. Lift up the skin at the neck end of the turkey and use your fingers to ease the skin away from the breasts. Gently smear some of the zesty butter over the breasts and under the skin. Pack the stuffing into the neck opening and secure the skin closed with skewers or cocktail sticks. Weigh the turkey at this point and write it down so you can work out your timings, then rub the rest of the zesty butter all over.\nStuff the 2 whole oranges into the cavity with some bay leaves. Pile the sliced shallots and a few more bay leaves into a large roasting tin and sit the turkey on top. Pour 500ml of the stock around, cover with foil to make a tent over the turkey, then roast for 20 mins per 450g/1lb.\nMeanwhile, bubble the remaining butter, orange juice and sugar together until syrupy. With 30 mins cooking time to go, remove the foil, brush the turkey liberally with the syrup, then return to the oven to brown at 200C/180C fan/gas 6. Brush once or twice more while roasting. To test that the turkey is ready, pierce the thigh in its thickest part and make sure the juices run clear. Lift the turkey out, brush again with syrup and leave to rest, covered loosely with foil, for 20 mins or so while you make the gravy and finish cooking the veg.\nPour the tin juices into a jug (keeping shallots and bay in the tin), then put the roasting tin over a flame. Stir in the flour, then gradually stir in the remaining stock Marmite and reserved turkey juices – skimmed of any fat. Bubble until a nice consistency, then strain into a saucepan, squishing the shallots with a masher to squeeze out all the flavour. Keep the gravy warm while you carve the turkey to serve."}
{"text": "Heat the oven to 200C/180C fan/gas 6. Line a large baking sheet with baking paper and mark 8 circles about 8-9cm across using a glass or mug. Turn the paper over. Sift the flour onto a sheet of baking paper. Put the butter and 150ml water into a pan, then bring slowly to the boil until the butter has melted. When the water is bubbling, remove quickly from the heat, tip in the flour all at once and beat quickly with a wooden spoon until it forms a dough that leaves the side of the pan clean. Remove from the heat and cool for 3 mins.\nLightly beat the eggs with a fork. Add the egg to the dough gradually, beating well with each addition until the dough is smooth and glossy. Put this dough into a piping bag fitted with a large plain nozzle (about 2cm across) or use a large food bag with the corner snipped off. Pipe 8 thick rings onto the baking sheet using the marked circles as a guide.\nBake the buns for 20-25 mins until crisp and golden, then split them carefully in half through the centre using a sharp knife in a sawing action; return to the oven for 5 mins. Transfer to a cooling rack, taking care to keep the tops and bottoms together, and leave to cool. Whip the cream to soft peaks and stir in the vanilla. Melt 100g of the chocolate for 1-2 mins in a microwave. Leave to cool slightly, then fold into the cream.\nStir half the crystallised fruit and the almonds through the cream. Fill the choux rings with the mixture using two teaspoons. Melt the remaining chocolate and drizzle over the choux rings. Scatter with crystallised fruit and leave to set. Dust with icing sugar before serving."}
{"text": "Shuck your oysters if not already prepared. Watch our \n.\nTo make the sauce, mix all the ingredients together in a small bowl. Drizzle the sauce over the oysters, then sprinkle with chopped chives and serve straight away."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Beat butter, sugar, egg and vanilla together with a pinch of salt until smooth. Stir in the flour, cinnamon and coconut with a wooden spoon.\nOn a floured surface, roll out the dough to a just a bit thinner than 1/ 2 cm. Make a two templates out of card of roughly 10 x 5.5cm and 8 x 3cm. (If you can find cutters even better). Place the larger template on the dough and use a pastry wheel, pizza cutter or knife to cut out the shape. Repeat until all the dough is used. Lift onto baking sheets, then bake for 10-12 mins until pale golden. Cool for a few mins, then transfer to a cooling rack to finish cooling. Biscuits can now be frozen, see tip.\nRoll out the ready-to roll icing on an icing sugar dusted surface. Use the smaller template, cut out the icing in the same way.\nSift the icing sugar into a bowl and stir in enough water to make runny. Brush the biscuit with a little of the runny icing. Stick an icing rectangle in the centre and scatter the sprinkles around the edges. Repeat with the rest. Pipe guests names onto biscuits and set aside to set. Will keep in an airtight tin for up to 3 days."}
{"text": "Put the pineapple into a blender or food processor and blitz to a purée. To make the stock syrup, put all the ingredients in a large pot with 500ml water, slowly bring to the boil and stir until the sugar has dissolved, then remove from the heat.\nTip the pineapple purée and the lime juice into the syrup and stir well. Leave to cool, then strain and churn in an ice-cream maker following manufacturer’s instructions. Place in a container and freeze. Alternatively, tip the syrup into a large tray and freeze until it starts to set, then every hour or so break up the ice with a fork. Serve the sorbet scooped into dessert glasses with a few slices of mango."}
{"text": "Wash the oranges and put in a large pan with the water and lemon juice. Bring to the boil, partly cover and simmer for 21/2 hours, until the oranges are very soft. Remove from the heat and scoop the oranges out into a large bowl. When they are cool enough to handle, cut them in half and scoop the flesh and seeds back into the pan using a dessertspoon. Bring back to the boil and simmer uncovered for 30 mins.\nMeanwhile cut the orange peel into strips(either using a sharp knife or knife and fork for a chunkier style). Press the contents of the pan through a sieve into a preserving pan, pressing though as much pulp as possible. Add the peel, sugar and treacle or molasses to the pan. Put a couple of saucers in the freezer.\nBring slowly to the boil, stirring to dissolve the sugar, then raise the heat and boil rapidly until setting point is reached. This should take around 6-10 mins. To test this turn off the heat under the marmalade, take a saucer out of the freezer and spoon on a little blob of marmalade. Leave for a moment, then push the marmalade with your finger. If the surface wrinkles it is ready, if not boil for a few more minutes and test again.\nStir the whiskey into the marmalade, then leave it to cool for 10 mins. Give it a stir to distribute the peel, then spoon into clean warm jars(put them through the dishwasher and leave to dry or wash and drain, then wash well, then warm in the oven for 10 mins) cover and label."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Heat 1 tbsp olive oil in a large frying pan, then add the courgettes and fry for 3-4 mins until browned. Sprinkle with paprika, drain, then transfer to a shallow ovenproof baking dish.\nAdd the remaining oil to the frying pan and fry the onion and garlic for 5 mins, stirring occasionally, until softened and lightly browned.\nAdd chopped tomatoes, chilli, sugar and seasoning, then cook for a further 2 mins. Spoon sauce over the courgettes, then put in the oven on a low shelf.\nPut the risotto rice into a casserole dish with the boiling water, then season. Cover and cook in the oven, above the courgettes, for 20 mins until the rice and courgettes are tender.\nFluff up the rice with a fork, then spoon onto warmed serving plates. Top with the courgette mixture and garnish with fresh basil leaves and cheese."}
{"text": "For the blini mix, tip the flour into a bowl, then season. Make a well in the middle, then add the egg yolk and half the milk. Whisk until smooth, gradually add the rest of the milk, then the butter and chives. Whisk the egg whites until starting to stiffen, then fold into the batter. To cook, lightly grease a frying pan, then sizzle spoonfuls for 2-3 mins on each side until golden, flipping them over when bubbling. Set aside and keep warm.\nMake a dressing in a large bowl with the mustard, vinegar and olive oil. Add the leaves, then toss. Serve the salad, salmon and blinis with some beetroot on the side."}
{"text": "Heat a large frying pan and add the pancetta. Cook for 2-3 mins until just starting to turn golden. Remove from the pan with a slotted spoon and set aside. Add the butter, onions and garlic to the pan, and cook for 4-5 mins, stirring occasionally. Remove from the heat and transfer to a bowl with the pancetta. Leave to cool.\nHeat oven to 180C/160C fan/gas 4. Stir the orange zest, breadcrumbs, sage and nuts into the onion mixture and mix well. Season, then stir in enough of the beaten egg to bind the mixture but not make it sloppy. Use to stuff the turkey or shape into balls, place in a roasting tin and cook for 30 mins."}
{"text": "Unroll the pastry and sprinkle most of the cheese over one half of the sheet. Fold the pastry in half to cover the cheese and seal it in.\nDust your rolling pin and work surface with a little flour and put your pastry sheet on it. Roll it out until doubled in size.\nHeat oven to 200C/180C fan/gas 6 and line two baking sheets with baking parchment.\nUsing cookie cutters, cut the pastry into shapes and put them on the prepared baking sheets. (Put the cutters on the dough close together so that less pastry is wasted. You can fold the trimmings back on themselves and re-roll to cut out more shapes.)\nBrush the shapes with milk and add a pinch of cheese and a sprinkling of your chosen topping, if using.\nBake in the oven for 10-12 mins or until risen and golden, then transfer to a serving plate. Will keep in an airtight container for 3 days."}
{"text": "Tip the bread mix into a food processor, add the walnuts and whizz until fully incorporated. Transfer to a bowl and stir in the apricots and most of the poppy seeds. Warm the milk to hand temperature, then stir into the flour mix with a wooden spoon. Knead in the bowl until smooth. Cover with oiled cling film and leave somewhere warm-ish to rise for 1 hr.\nFind a heatproof dish the same size or a bit bigger than your cheese box. Sit it in the middle of a big baking tray.\nShape the risen dough into a long, thin log that will wrap around the dish on the sheet, like a wreath. Press the ends together, loosely cover with oiled cling film and leave to rise for 20-30 mins.\nHeat oven to 180C/160C fan/gas 4. Brush the egg all over the loaf, then sprinkle with the remaining poppy seeds. Using kitchen scissors, randomly snip into the dough, to give a spiky finish. Bake for 35-40 mins until golden and crusty, and the bottom sounds hollow when you tap it. Remove the dish from the middle.\nTo serve, unwrap the cheese and put it back into the box. Stab a few times, add the wine and tie kitchen string around the box to secure it in case the glue comes undone. Sit the cheese in the middle of the bread, without its lid, and bake for 10-15 mins until molten. Serve straight away and, if you like, pop another cheese in the oven so you can finish off the bread when the first cheese box is wiped clean."}
{"text": "Roughly chop the tangerines. In a bowl, toss the tangerines with the madeira until thoroughly coated, then set aside to macerate.\nHeat oven to 110C/90C/gas \n. Line two baking sheets with baking parchment. \n the egg whites in a clean bowl or stand mixer until soft peaks form. Without stopping whisking, gradually add the sugar and whisk until thick and glossy, then whisk in the vinegar too. Toss the walnuts in the melted chocolate, then fold into the egg so the meringue is marbled with chocolate.\nSpread a circle of the chocolate and walnut meringue about 20-25cm in diameter on each baking sheet. Bake for 2 hrs until crisp but slightly soft in the middle – don’t worry if it cracks; it will still taste delicious. Remove from the oven and carefully lift the meringues and parchment onto wire racks to cool. Peel the parchment from the meringues, then use a wide palette knife to lift one meringue onto a serving platter or cake stand.\nWhip the cream to soft peaks, being careful not to over whip. Fold in half the tangerines and the madeira used to soak them. Spread just over half the cream mixture onto the meringue, then top with the other layer of meringue, the remaining cream and the rest of the tangerines. Sprinkle over the grated dark chocolate and serve. Can be made a day ahead and chilled in the fridge."}
{"text": "Oil a shallow square metal or silicone baking tray, about 18 x 18cm. Put the sugar in a pan with the cream of tartar and 500ml water and heat gently at first, stirring so that the sugar melts. Then, turn up the heat and boil for 10-15 mins until the mixture is a little more syrupy. If you have a sugar thermometer, it should reach 115-118C.\nStir the cornflour into 150ml water, then, \n all the time, pour it into the sugar syrup. Keep whisking, until everything combines to make a smooth, gloopy mix. Take out the whisk and start to stir with a \n or spoon over a medium heat. Keep stirring until the mixture is thick enough to see a clear line drawn through it with the spoon and it starts to leave the sides of the pan. It will be very thick and make big bubbles that burst as it cooks, so be careful. This can take up to an hour. Test the mix by dropping a small amount into very cold water; it should form a ball that can be pressed gently when cold and that will feel a little springy.\nStir in the rosewater or rose syrup and the food colouring, if using, then pour everything into the tray and level the top. Leave to cool and set completely. Sieve some cornflour and icing sugar together over a board and carefully turn out the Turkish delight. Cover it with more icing sugar and cornflour and cut it into cubes with a sharp \n. Dust with yet more of the icing sugar mixture and move the pieces apart so they can dry. "}
