{"text": "Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil and the butter in a frying pan, then add the onion and fry for 5 mins until softened. Cool slightly. Tip the sausagemeat, lemon zest, breadcrumbs, apricots, chestnuts and thyme into a bowl. Add the onion and cranberries, and mix everything together with your hands, adding plenty of pepper and a little salt.\nCut each chicken breast into three fillets lengthwise and season all over with salt and pepper. Heat the remaining oil in the frying pan, and fry the chicken fillets quickly until browned, about 6-8 mins.\nRoll out two-thirds of the pastry to line a 20-23cm springform or deep loose-based tart tin. Press in half the sausage mix and spread to level. Then add the chicken pieces in one layer and cover with the rest of the sausage. Press down lightly.\nRoll out the remaining pastry. Brush the edges of the pastry with beaten egg and cover with the pastry lid. Pinch the edges to seal, then trim. Brush the top of the pie with egg, then roll out the trimmings to make holly leaf shapes and berries. Decorate the pie and brush again with egg.\nSet the tin on a baking sheet and bake for 50-60 mins, then cool in the tin for 15 mins. Remove and leave to cool completely. Serve with a winter salad and pickles."}
{"text": "Put the butter, sugar, fruit, zests, juice and 100ml/3½fl oz brandy in a large pan. Bring slowly to the boil, stirring until the butter has melted. Reduce the heat and bubble for 10 minutes, stirring occasionally.\nRemove the pan from the heat and leave to cool for 30 minutes.\nMeanwhile, preheat the oven to 150C/gas 2/ fan 130C and line a 20cm round cake tin. Toast the nuts in a dry frying pan, tossing them until evenly browned, or in the oven for 8-10 minutes - keep an eye on them as they burn easily. When they are cool, chop roughly. Stir the eggs, nuts and ground almonds into the fruit mixture and mix well. Sift the flour, baking powder and spices into the pan. Stir in gently, until there are no traces of flour left.\nSpoon the mixture into the tin and smooth it down evenly - you will find this is easiest with the back of a metal spoon which has been dipped into boiling water.\nBake for 45 minutes, then turn down the heat to 140C/gas 1/ fan120C and cook for a further 1-1¼ hours (about a further 1¾ hours if you have a gas oven) until the cake is dark golden in appearance and firm to the touch. Cover the top of the cake with foil if it starts to darken too much. To check the cake is done, insert a fine skewer into the centre - if it comes out clean, the cake is cooked.\nMake holes all over the warm cake with a fine skewer and spoon the extra 4tbsp brandy over the holes until it has all soaked in. Leave the cake to cool in the tin. When it's cold, remove it from the tin, peel off the lining paper, then wrap first in baking parchment and then in foil. The cake will keep in a cupboard for up to three months or you can freeze it for six months."}
{"text": "Tip the sugar, butter, dried fruit, whole cherries, ginger, orange zest and juice into a large pan. Pour over the rum, brandy or juice, then put on the heat and slowly bring to the boil, stirring frequently to melt the butter. Reduce the heat and bubble gently, uncovered for 10 mins, stirring every now and again to make sure the mixture doesn’t catch on the bottom of the pan. Set aside for 30 mins to cool.\nStir the nuts, eggs and ground almonds into the fruit, then sift in the flour, baking powder and spices. Stir everything together gently but thoroughly. Your batter is ready.\nHeat oven to 150C/130C fan/gas 2. Scoop the cake mix into 12 deep muffin cases (an ice-cream scoop works well), then level tops with a spoon dipped in hot water. Bake for 35-45 mins until golden and just firm to touch. A skewer inserted should come out clean. Cool on a wire rack.\nUnravel the marzipan onto a work surface lightly dusted with icing sugar. Stamp out 12 rounds, 6cm across. Brush the cake tops with apricot jam, top with a marzipan round and press down lightly.\nMake up the fondant icing to a spreading consistency, then swirl on top of each cupcake. Decorate with sugared almonds and snowflakes, then leave to set. Will keep in a tin for 3 weeks."}
{"text": "Put the flour and 1 tsp salt into a large bowl. Make a well in the centre and add the yeast. Meanwhile, warm the milk and butter in a pan until the butter melts and the mixture is lukewarm. Add the milk mixture and egg to the flour mixture and stir until the contents come together as a soft dough (add extra flour if you need to).\nTip the dough onto a well-floured surface. Knead for 5 mins, adding more flour if necessary, until the dough is smooth, elastic and no longer sticky.\nLightly oil a bowl with the vegetable oil. Place the dough in the bowl and turn until covered in oil. Cover the bowl with cling film and set aside in a warm place for 1 hr or until doubled in size. Lightly grease a baking sheet and set aside.\nFor the filling, knock the dough back to its original size and turn out onto a lightly floured surface. Roll it into a 1cm-thick rectangle. Brush all over with the melted butter, then sprinkle over the sugar, cinnamon and fruit.\nRoll up the dough into a tight cylinder, cut into 9 x 4cm slices and position on the prepared baking sheet, leaving a little space between. Cover with a tea towel and set aside to rise for 30 mins.\nHeat oven to 190C/170C fan/gas 5. Bake the buns for 20-25 mins or until risen and golden brown. Meanwhile, melt the glaze sugar with 4 tbsp water until syrupy.\nRemove from oven and glaze. Set aside to cool on a wire rack. Once cool, mix the zest and icing sugar with about 2 tbsp water to drizzle over the buns. Serve."}
{"text": "Heat oven to 190C/170 fan/gas 5 and line a 12-hole muffin tin with cake cases. Put all the cake ingredients into a bowl and mix with a whisk until smooth. Spoon the mix into the cases, bake for 25 mins until golden and risen and a skewer comes out clean. Cool on a wire rack.\nFor the frosting, beat the butter, vanilla extract and icing sugar until pale and creamy and completely combined. To make snowmen, reindeer and Christmas puddings, first spread the icing over the top of each cake. Then lay the chocolate buttons on top, slicing some buttons into quarters to make ears and hats. Finally, use icing pens for the details. For the Christmas tree, colour the icing with green food colouring and pipe onto the cakes using a star-shaped nozzle, decorate with sweets, sprinkles and white chocolate stars."}
{"text": "Peel strips from the carrots using a vegetable peeler, then mix with the other salad ingredients in a large bowl. Combine all the dressing ingredients in a jam jar, season, then put the lid on and shake well. Toss through the salad when you’re ready to eat it. The salad and dressing will keep separately in the fridge for up to four days."}
{"text": "In a small saucepan gently heat the frozen berries, icing sugar and cinnamon until the sugar has dissolved. Remove from the heat, stir in the cassis, if using, and set aside to cool completely.\nWhip the double cream and Greek yogurt until just holding it’s shape, ripple through the lemon curd. Break the meringue nests into a glass bowl, or 8 individual glasses. Spoon over half the cream, then half the berries. Repeat with the remaining cream and berries. Serve immediately."}
{"text": "Grease and line a 20cm x 20cm brownie tin. Heat oven to 180C/160C fan/gas 4. Put the butter and both types of chocolate in a heat proof bowl and either melt in the microwave (in 30 second bursts, stirring after each) or set over a pan of barely simmering water, stirring every now and then until the chocolate has melted.\nLeave the chocolate and butter mixture to cool a little while you whisk the eggs and caster sugar in a large bowl using electric beaters. Once the mixture is pale, fluffy and looks like it’s roughly doubled in volume, whisk in the melted chocolate. Fold in the flour, cocoa powder and mixed spice until no pockets of flour remain then pour into your prepared tin. Level the top with a spatula and bake for 20-25 mins. The top should look set and shiny but should be a little wobbly if you gently jostle the tin.\nLeave the brownie to cool completely in the tin then chill in the fridge until set. While the brownie cools brush the rosemary sprigs and glacé cherries with egg white, dab off the excess with kitchen paper then dredge in caster sugar until well coated. Leave to dry on a wire rack. Put the chocolate truffles onto a sheet of baking paper or foil then spray with the edible gold lustre.\nDust the chilled brownie with icing sugar to create a snowy surface and top with amaretti biscuit pieces then poke the crystalised rosemary sprigs into the surface at random intervals (cut the brownie into pieces and dust on icing sugar first, if you like). Nestle a glacé cherry or gold truffle alongside the rosemary sprig then add the buttons and silver balls."}
{"text": "Mix the vodka and ginger wine in a jug. Stir in the cranberry juice, lime juice and some sliced stem ginger. Garnish with lime zest, if you like."}
{"text": "Heat oven to 220C/200C fan/gas 7. Prepare the pizza base mix following pack instructions. Once rolled out, leave to rest for 10 mins, then top with the pasta sauce.\nScatter over the stuffing and turkey, then top with the mozzarella. Toss the sage leaves with the oil, then scatter over the pizza, drizzling over any remaining oil. Bake for 10-12 mins until the crust is crisp and the cheese has melted."}
{"text": "Heat oven to 230C/fan 210C/gas 8. Smear the butter all over the poussins, season inside and out, then criss-cross the bacon over each one. Sit the poussins in a roasting tin and cook for 40 mins until the birds are golden and the bacon is crisp. Remove from the tin, leave to rest and set the tin aside until you’re ready to make the gravy.\nAbout 5 mins before you sit down to eat, make the gravy. Place the tin on a medium heat, then stir in the flour and splash in the Worcestershire sauce. Bubble together, then drain the veg over the roasting tin and stir in the vegetable stock. Bring the gravy to the boil, taste for seasoning, adding more Worcestershire sauce if needed, then pour into a warm gravy jug."}
{"text": "Peel the tomatoes - prick them with a sharp knife, place in a bowl and cover with boiling water. Leave for a few seconds then drain and cover with cold water. The skins will now come away easily.\nChop the tomatoes and aubergine and seed and chop the peppers. Put in a large heavy-based pan with the onions and garlic and bring to the boil. Cover with a lid, lower the heat and gently simmer for about one hour, stirring occasionally, until tender.\nTip the sugar, vinegar, salt, coriander, paprika and cayenne into the pan and bring to the boil over a medium heat, stirring, until the sugar has dissolved. Continue to boil for 30 minutes or so, until the mixture achieves a chunky chutney consistency and the surplus watery liquid has evaporated. Take care towards the end of the cooking time to continue stirring so that the chutney doesn't catch on the bottom of the pan.\nLadle the chutney into sterilised or dishwasher-clean jars (Kilner jars are ideal) and top with paper jam covers. Seal the jars while still hot. Leave to mature for at least a month in a cool dark place."}
{"text": "Put 1kg mixed dried fruit, the zest and juice of 1 orange and 1 lemon, 150ml brandy or other alcohol, 250g softened butter and 200g light, soft brown sugar in a large \n set over a medium heat.\nBring to the boil, then lower the heat and simmer for 5 mins. Tip the fruit mixture into a large \n and leave to cool for 30 mins.\nHeat oven to 150C/130C fan/gas 2. Line a deep 20cm cake tin with a double layer of \n, then wrap a double layer of newspaper around the outside – tie with string to secure.\nAdd 175g plain flour, 100g ground almonds, ½ tsp baking powder, 2 tsp mixed spice, 1 tsp ground cinnamon, ¼ tsp ground cloves, 100g flaked almonds, 4 large eggs and 1 tsp vanilla extract to the fruit mixture and stir well, making sure there are no pockets of flour.\nTip into your prepared tin, level the top with a \n and bake in the centre of the oven for 2 hrs.\nRemove the cake from the oven, poke holes in it with a skewer and spoon over 2 tbsp of your chosen alcohol. Leave the cake to cool completely in the tin.\nTo store, peel off the baking parchment, then wrap well in cling film. Feed the cake with 1-2 tbsp alcohol every fortnight, until you ice it.\nDon’t feed the cake for the final week to give the surface a chance to dry before icing."}
{"text": "Layer all the ingredients in a 1 litre glass or plastic preserving jar in the order the ingredients are listed.\nWrite the following method on a gift label: ‘Tip the contents of the jar into a large mixing bowl. Make a well in the centre and add 2 beaten eggs, 300ml/½pt milk and 100g/4oz melted butter. Mix quickly and lightly to a soft batter. Divide between 12 muffin cases. Bake at 190C/fan 170C/gas 5 for 18-20 mins. Use within 4 weeks.’ Attach the label and a wooden spoon to the top of the jar with some raffia or coloured ribbon."}
{"text": "Tip the icing sugar, vanilla extract, egg yolk and butter into a mixing bowl, then stir together with a wooden spoon (or pulse in a food processor until well combined). Add the flour and mix to a firm dough. Shape the dough into two flat discs and wrap in clingfilm. Chill for 20-30 mins. Heat oven to 190C/fan 170C/gas 5 and line two baking sheets with non-stick baking paper.\nRoll out the dough on a lightly floured surface to about the thickness of two £1 coins. Cut out Christmassy shapes (use a cutter if you like) and place on the baking sheets. Using the tip of a skewer, cut a small hole in the top of each cookie. Bake for 10-12 mins until lightly golden.\nLift the biscuits onto a wire rack to cool. Meanwhile, mix the icing sugar with a few drops of cold water to make a thick, but still runny icing. Colour with edible food colouring, if you like. Spread it over the cooled biscuits, decorate with edible balls and thread with ribbon when dry."}
{"text": "Mix the fruit, almonds, citrus zests and the carrot with the brandy and orange liqueur in a large mixing bowl. Cover and leave to soak overnight.\nMix all the dry ingredients together, then add to the soaked fruit mixture. Grate in the butter, then add the eggs and stir. Don’t forget to make a wish!\nGrease a 1.5-litre pudding basin with butter and line the base with greaseproof paper. Spoon in the mixture, press down well and make a hollow with the back of the spoon in the centre. Cover the surface with a round of greaseproof paper, then cover the bowl with double-thickness greaseproof paper and foil and tie at the rim with string. Lower the pudding into a pan with an upturned saucer in the base, then fill with water until it comes halfway up the sides of the bowl. Steam for 6 hrs, topping up with water as necessary.\nAlternatively, steam in the oven. Stand the pudding basin in a roasting tin filled with water, then cover with a tent of foil and cook for the same length of time at 160C/fan 140C/gas 3. Check roasting tin occasionally as the water may need to be topped up.\nTo store, allow to cool, then store in a cool, dry cupboard. The pudding will keep for up to a year.\nOn the day, steam for 1 hr before turning out, decorating with holly and serving with extra-thick double cream or vanilla ice cream. Alternatively, try my Orange custard cream (below)."}
{"text": "Heat oven to 140C/120C fan/gas 1. Line the base and sides of a 20cm cake tin first with a double layer of brown paper, then with a double layer of baking parchment. In a large bowl, mix the fruit, almonds, peel, figs and cherries. Turn well and add the flour, spices and lemon zest. In a separate bowl, cream the butter and sugar thoroughly, then add the vanilla extract, honey and treacle. Still beating, incorporate the eggs, then stir in the fruit and flour mixture. Dissolve the bicarbonate of soda in the milk and stir in thoroughly. Add the brandy by the spoonful, until you have a soft dropping consistency.\nTurn the batter into the cake tin and make a dip in the middle using the back of a spoon. Bake for 3½ hrs, then insert a skewer – if it comes out clean, it’s ready. If there is any cake mix on the skewer, give it 10 mins more and test again. When it’s done, remove the cake from the oven and leave to cool in its tin. The next day, remove from the tin, wrap in fresh greaseproof paper, then put it into an airtight tin or wrap tightly in foil. The usual thing is to keep the cake for at least a month before icing it, and to unwrap and sprinkle it occasionally with more brandy."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Line the base and sides of a 20 cm round, 7.5 cm deep cake tin. Beat the butter and sugar with an electric hand mixer for 1-2 mins until very creamy and pale in colour, scraping down the sides of the bowl half way through. Stir in a spoonful of the flour, then stir in the beaten egg and the rest of the flour alternately, a quarter at a time, beating well each time with a wooden spoon. Stir in the almonds.\nMix in the sherry (the mix will look curdled), then add the peel, cherries, raisins, cherries, nuts, lemon zest, spice, rosewater and vanilla. Beat together to mix, then stir in the baking powder.\nSpoon mixture into the tin and smooth the top, making a slight dip in the centre. Bake for 30 mins, then lower temperature to 150C/fan 130C/gas 2 and bake a further 2-2¼ hrs, until a skewer insterted in the middle comes out clean. Leave to cool in the tin, then take out of the tin and peel off the lining paper. When completely cold, wrap well in cling film and foil to store until ready to decorate. The cake will keep for several months."}
{"text": "Tip the raisins, currants and sultanas into a bowl. Pour over 200ml ginger wine, then cover and leave to sit at room temperature overnight so that the fruit plumps up.\nHeat oven to 160C/fan 140C/gas 3. Using the bottom of a 20cm, loose-bottomed cake tin as a template, cut out 2 circles of baking parchment. Then cut 2 thick strips (about 2cm deeper than the tin) that will fit around the inside of the tin. Make small cuts along one of the edges, about 2cm apart. Grease the tin, then place one parchment circle at the bottom. Place one strip inside the tin, making sure the cut side is at the bottom, as this will help you to fit it inside. Do the same with the remaining strip, then place the second circle on top (see step-by-step).\nPut the butter and sugar into a mixing bowl and whisk with an electric beater until creamy and light, about 5 mins. Add the eggs, one at a time, making sure you stir well after each addition, then mix through the flour, ground almonds and spices. Stir in the soaked fruits, and any liquid left over, with the fresh root ginger and treacle until everything is well combined.\nSpoon in the mixture and smooth the top, then use a spoon to make a slight dip in the centre. This will ensure the cake has an even surface when finished. Bake for 30 mins, then lower the oven to 150C/fan 130C/gas 2 and bake for another 2 hrs until a skewer inserted in the middle comes out clean. Skewer the cake all over, then drizzle over the remaining 4 tbsp ginger wine. Leave the cake to cool in the tin, then peel off the lining paper. To store, wrap first in baking parchment and then in tin foil. The cake will keep in a cupboard for up to 3 months or can be frozen for up to 6 months."}
{"text": "Calculate the cooking time: cook for 10 mins at 240C/fan 220C/gas 9, then reduce to 190C/fan 170C/gas 5 and cook for 20 mins per kg for medium-rare, 32 mins per kg for more well done, plus 30 mins resting.\nIf the goose is ready-trussed, then loosen the string and pull out the legs and wings a little – this helps the bird cook better.\nCheck the inside of the bird and remove any giblets or pads of fat. Using the tip of a sharp knife, lightly score the breast and leg skin in a criss-cross. This helps the fat to render down more quickly during roasting.\nGrate the zest from 4 lemons and 3 limes. Mix with 2 tsp fine sea salt, 1 tsp Chinese five-spice powder and pepper, to taste.\nSeason the cavity of the goose generously with salt, then rub the citrus mix well into the skin and sprinkle some inside the cavity.\nStuff the zested fruit and a small handful of parsley, thyme and sage sprigs inside the bird and set aside for at least 15 mins. \nHeat oven to 240C/fan 220C/gas 9.\nIf you want to give the bird a nice golden skin, brown in a large \n (or a heavy-based \n), using a couple of tbsp olive oil. Holding the bird by the legs (you may like to use an oven glove), press it down on the breasts to brown.\nOnce browned, place the bird in the roasting tin. Drizzle with 3 tbsp clear honey and sprinkle with 1 tbsp thyme leaves.\nRoast for the calculated time, turning the heat down after 10 mins to 190C/fan 170C/gas 5. Cover the goose with foil if it is starting to brown too much.\nEvery 30 mins or so, baste the bird with the pan juices, then pour off the fat through a sieve into a large heatproof bowl. You will end up with at least a litre of luscious fat – save this for the potatoes and other veg.\nAt the end of the cooking time, leave to rest for at least 30 mins, covered loosely with foil. The bird will not go cold, but will be moist and much easier to carve."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Butter and line a round, deep 20cm cake tin with two layers of baking parchment (see Knowhow, below). Tie a few sheets of newspaper around the outside of the tin, level with the top of the baking parchment.\nHeat the brandy in a small pan, then add the saffron and leave to infuse off the heat for a few mins. Put the butter, sugar, eggs, flour, ground almonds, baking powder and a pinch of salt into a bowl, then beat together until creamy and smooth. Mix the fruit, nuts and brandy saffron mix into the batter and stir well.\nSpoon into the prepared tin, smooth the top and make a slight dip in the middle. Bake for 1½ hrs, then cover loosely with foil to stop the top over-browning. Turn oven down to 140C/fan 120C/gas 1 and cook for 1 hr more until a skewer comes out clean. Leave to cool in the tin then, while it’s still warm, prod the cake all over with a skewer.\nMix the brandy and honey together and spoon over the cake. Wrap up well in foil and keep in an airtight container until Christmas, feeding with more honeyed brandy every so often."}
{"text": "For the pudding, empty the first six cups and the nuts, if using, into a mixing bowl with the spices, then stir in the milk and egg. Once well combined, tip into a buttered 1.5 litre pudding bowl.\nCover with a double layer of buttered foil, making a pleat in the centre to allow the pudding to rise. Tie the foil securely with string, then place in a steamer or large pan containing enough gently simmering water to come halfway up the sides of the bowl. Steam, covered with a lid, for 21⁄2 hours. Check the water level during cooking, topping up if necessary. If you are preparing this pudding ahead, remove the foil, let it cool slightly, then wrap in cling film and then fresh foil. If you are serving it immediately, unwrap and invert onto a deep plate.\nFor the sauce, put everything in a pan and bring slowly to the boil, stirring. Allow to bubble away for 2-3 minutes, still stirring, until the sugar has dissolved and the sauce is pale caramel in colour and slightly thickened. Remove from the heat. Pour the sauce over the pudding and decorate with the whole mixed nuts."}
{"text": "Mix the fruit, zest, juice and sherry, and leave overnight to soak. Next day, heat oven to 160C/fan 140C/gas 3. Butter and double-line a deep, 20cm round cake tin. Wrap the outside with brown paper or newspaper and secure with string, as this will protect the sides from overcooking.\nBeat the butter, sugar and vanilla seeds together until pale and creamy. Mix the flour, ground almonds and mixed spice together, then tip into the butter mix with the eggs. Beat until combined and smooth. Stir in the whole almonds, fruit and any leftover juices, turn into the tin, then smooth the top and make a dip in the middle. Bake for 1½ hrs.\nTurn down the oven to 140C/fan 130C/ gas 2, then bake for 1½ hrs more until dark on the top and a skewer inserted into the middle comes out clean, or with a few damp crumbs clinging to it. Once cool enough to handle, turn onto a cooling rack and peel away the lining paper. Cool completely.\nKeep the cake well wrapped, then feed once a fortnight with 1-2 tbsp sherry. Poke holes into the cake with a skewer and slowly spoon over the sherry. If you don’t have time to do this, this cake is delicious freshly made, and can be covered and decorated as soon as it has completely cooled down."}
{"text": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve."}
{"text": "To make the base, mix the gingernuts and sugar in a large bowl and sprinkle in the flaky salt. Pour in the melted butter and mix with a wooden spoon to form a biscuit crumb-like mixture. Press into a 20cm round springform cake tin, spreading the mixture in an even layer to the corners. Chill in the fridge for 30 mins until set.\nPut the Christmas pudding, brandy, stout and orange zest in a blender, and whizz to a purée.\nUsing an electric hand whisk, beat the cream cheese with the double cream, sugar and vanilla seeds, then fold through the purée. Spread the mixture over the biscuit base and leave to chill in the fridge overnight.\nThe next day, peel the clementines, slice into rounds and place on a baking tray. Sprinkle them with sugar, then blowtorch until caramelised and leave to cool. Release the cheesecake from the tin and arrange the clementines on top. "}
{"text": "Get everything prepared. Chop the almonds coarsely. Peel, core and chop the apples. Sharpen your knife and chop the candied peel. (You can chop the almonds and apples in a food processor, but the peel must be done by hand.) Grate three quarters of the nutmeg (sounds a lot but it's correct). Mix all the ingredients for the pudding, except the butter, in a large bowl.\nHolding the butter in its wrapper, grate a quarter of it into the bowl, then stir everything together.Repeat until all the butter is grated, then stir for 3-4 minutes - the mixture is ready when it subsides slightly after each stir. Ask the family to stir too, and get everyone to make a wish.\nGenerously butter two 1.2 litre/ 2 pint bowls and put a disc of greaseproof paper in the bottom of each. Pack in the pudding mixture. Cover with a double layer of greaseproof paper or baking parchment, pleating it to allow for expansion, then tie with string (keep the paper in place with a rubber band while tying). Trim off any excess paper.\nNow stand each bowl on a large sheet of foil and bring the edges up over the top, then put another sheet of foil over the top and bring it down underneath to make a double package (this makes the puddings watertight). Tie with more string, and make a handle for easy lifting in and out of the pan. \n.\nBoil or oven steam the puddings for 8 hours, topping up with water as necessary. Remove from the pans and leave to cool overnight. When cold, discard the messy wrappings and re-wrap in spanking new greaseproof or baking parchment, foil and string. Store in a cool, dry place until Christmas.\nTo make the brandy butter, cream the butter with the orange zest and sugar. Gradually beat in the brandy or cognac and chopped ginger. Put in a small bowl, fork the top attractively and put in the fridge to set. The butter will keep for a week in the fridge, or it can be frozen for up to 6 weeks.\nOn Christmas Day, boil or oven steam for 1 hour. Unwrap and turn out. To flame, warm 3-4 tbsp brandy in a small pan, pour it over the pudding and set light to it."}
{"text": "Mix all of the boozy fruit ingredients together in a bowl, then microwave on High for 3 mins. Stir, then leave to cool completely, ideally overnight.\nFor the ice cream, put the spices in a saucepan and gently heat for 3 mins or so, stirring once or twice, until fragrant. Tip in the cream and vanilla seeds, and bring to the boil. Meanwhile, whisk the yolks and sugar together. Whisk the hot cream into the egg mix, then tip the mix into a clean pan and gently heat for 5-10 mins until it coats the back of a wooden spoon. Pour everything into a bowl or plastic container and leave to cool completely. If possible, chill it overnight as this will infuse the ice cream with a stronger Christmassy spice flavour.\nPass the mix through a sieve into another container, then freeze for 5 hrs, stirring in the frozen edges with a fork every hour until you have a smooth, thick mix. Oil a 1.4 or 1.2-litre pudding basin and line with cling film.\nDrain the boozy fruit in a sieve, mix the fruit with the ginger nuts and zests, then quickly stir into the ice cream. Tip into the basin, cover the surface with cling film, then freeze for at least 6 hrs.\nFor the topping, put everything into a small pan, gently heat until the sugar dissolves, then simmer for 2 mins. Cool completely. To turn the pudding out, let it sit at room temperature for about 15 mins, then turn onto a plate. Ease the cling film away. Spoon the cranberries and syrup over to serve."}
{"text": "Peel off the outer leaves of the cabbage, then cut into quarters and slice out the core. Use a sharp knife or the slicing attachment of a food processor to thinly slice the cabbage.\nHeat the butter in a large saucepan, then tip in the onions and gently fry until softened, about 5 mins. Add the orange zest to the pan along with the cinnamon stick, then cook for 1 min more. Add the shredded cabbage, then pour over the port, red wine vinegar, orange juice and 150ml water. Bring up to the boil, then reduce the heat to a simmer, cover the pan and cook for 45 mins-1 hr until the cabbage is softened."}
{"text": "Spoon the dulce de leche into a bowl, then beat in the coffee, vanilla and brandy until smooth. Stir in both pots of cream until well mixed.\nPour into 1 large or several smaller sterilised bottles. This will keep in the fridge for 2 weeks. Drink in liqueur glasses or serve over ice."}
{"text": "Soak the sultanas, currants, figs, mixed peel, cherries and the apricots in the brandy in a bowl overnight if possible or for at least a few hrs (if you don't have time for this, place the fruit in a microwaveable bowl with the brandy and give it a quick blast in the microwave to plump up). In a larger bowl, mix the ginger and syrup, apples, orange juice and zest, eggs, suet, crumbs, sugar and flour. Using your fingers or a wooden spoon, mix in the soaked fruit and mixed spice.\nButter 2 x 1.5-litre pudding basins and divide the mixture between them, filling almost to the rim. Smooth the tops and cover with 2 circles of greaseproof paper. Cover each pudding with a sheet of foil with a folded pleat down the centre, to allow the pudding to expand, and secure everything by tying it tightly with some string. Stand the puddings in a deep, large pan (or 2 if that’s easier) on trivets or upturned saucers and pour boiling water around so it comes about a third of the way up. Cover the pan and steam the puddings for 5 hrs, topping up with more boiling water when necessary.\nLet the puddings cool down before removing the foil and greaseproof paper, then cover with cling film over the top and store in a cool, dry place if you aren’t using them straight away. This is the time you can drizzle them with more booze in the run-up to Christmas if you have time. To reheat, steam the pudding for 1 hr more before turning out and flaming with hot brandy."}
{"text": "Whizz the ice cream in a food processor until smooth, fold in the Christmas pudding and scrape into a freezer-proof container. Freeze for at least 2 hrs then scoop into bowls and top with the toffee sauce or amaretto."}
{"text": "Gently fry the leeks in the butter until softened. Add the mushrooms, mace and thyme, and turn up the heat a bit to soften the mushrooms and drive off any liquid that comes out of them. Stir in the potato for 2 mins, followed by the lentils, chestnuts and cream. Cook for 2 mins more, then take off the heat and stir in the 4 tbsp cranberries.\nTo make the pastry, put the flour and suet in a food processor with 1 tsp salt. Whizz together until you can’t see any big suet lumps, then keep pulsing while you add the milk, a spoon at a time, until the pastry comes together.\nRoll out a quarter of the pastry on a lightly floured surface, then use 4 individual pie dishes to cut 4 pastry lids – we used 4 x 250ml ramekins. Use a small star cutter to cut out a star from each lid, then keep stars and lids covered with cling film.\nCut 4 strips of baking parchment and use a little butter to stick one in each pie dish, so the ends of the strips stick outeach side to help you remove the pies when baked. Gather lid scraps with the remaining pastry and divide into 4 equal pieces. Roll out each to £1 coin thickness and use to line each pie dish with an overhang. Divide the filling between the dishes. Top each with a lid, and roll down the overhang to meet the lid. Use a fork’s prongs to press and seal edges. The pies can now be covered and chilled for up to 24 hrs before baking.\nTo bake, heat oven to 220C/200C fan/ gas 7. Brush each pie with beaten egg and bake for 30 mins. Lift pies from dishes and sit directly onto a baking sheet. Mix 20 cranberries with the redcurrant jelly and divide between the star holes on top. Brush pastry stars with beaten egg, add a small thyme sprig to each, then add to the pie baking sheet and put back in the oven for 5-10 mins, until pies and stars are golden and crisp. Top each pie with a star and serve."}
{"text": "Grease and flour 4 small ramekins and set aside. Tip all the ingredients, except the berries and cherries, into a large jug or bowl. Using a hand blender, blend until completely combined, then stir in the dried fruit. Chill cake mix until needed.\nHeat oven to 230C/fan 210C/gas 8. Divide the mix between the ramekins and bake for 15 mins until puffed up and golden. Tip the cakes out onto plates, top with a scoop of vanilla ice cream and drizzle with honey."}
{"text": "Heat oven to 200C/180C fan/gas 6. Mix the pudding, mascarpone and Baileys. Lay out a sheet of filo on a large flat baking tray, brush with some melted butter and lay another sheet on top. Repeat with more butter and filo until you have 4 layers.\nPlace the filling in a log in the centre and brush the border with butter. Roll up to enclose the filling, then brush with the remaining butter. \n. Bake for 20-25 mins until golden brown, dust with icing sugar and serve warm with cream or custard."}
{"text": "Put the dried fruits, dates, cranberries and ginger in a pan with the orange zest and juice, and the orange liqueur, then warm gently for 10 minutes, stirring occasionally until the juices are absorbed and the mixture looks sticky. Set aside to cool.\nLightly grease a 1.3 litre/21⁄4 pint pudding basin, and line the base with a small disc of greaseproof paper. Beat the butter, sugar, eggs and flour together in a food mixer or large bowl until creamy, then stir in the cooled fruits, breadcrumbs, cinnamon and nuts.\nSpoon the mixture into the pudding basin, cover the bowl with greaseproof paper and foil, and tie on securely with string. Put a long strip of folded foil under the basin and bring it up round the sides so that you can use it as a handle to lift the pudding in and out. Put the basin in a large pan and pour a kettle of boiling water into the pan so it comes halfway up the bowl, then cover and steam for 3 hours, topping up with boiling water every now and then. Leave it to cool, then store in a cool place for up to 1 week or freeze for 1 month.\nThe sauce can be made up to a day ahead. Melt the butter and sugar together in a frying pan. Tip in the pecans and cook, stirring, for a minute or two to toast them. Add the cranberries, orange juice and liqueur and continue to bubble until rich and syrupy. Cool, then tip into a bowl, cover and chill until ready to eat.\nTo serve: Steam the pudding in a pan of boiling water for 1 hour, to warm it through.\nPut the pecan sauce in a pan, and gently warm through until melted and bubbling. Meanwhile, turn out the pudding. Peel the lining paper from the pudding and pile the nuts and cranberries from the sauce on top, and then generously spoon over the buttery sauce. Decorate with holly and dust lightly with icing sugar. Serve the pudding with the sauce and cream."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Place a 12-hole silicone muffin tray on a baking sheet or butter a non-stick 12-hole muffin tin, and stick two criss-crossing strips of baking parchment in each hole.\nMelt the chocolate and butter over a low heat. Cool a little, then stir in the soured cream and eggs. Mix the flour, sugar, almonds, cocoa and baking powder in a bowl. Pour in the chocolate and stir until smooth, then stir in the cherries. Spoon into the muffin holes so they are 3⁄4 full, then bake for 20 mins. Cool in the tins. Can now be frozen in plastic bags for 3 months.\nTo decorate, mix the icing sugar and custard powder with 2 tbsp water to make a thick icing. Remove the muffins from the tins and cool on a rack. Cut off any rounded tops, stand upside-down on the rack, then spoon icing over. Leave to set, then top with bay leaves and cherries. Best eaten on the day."}
{"text": "To make the pudding, quickly blitz together the chopped pudding and custard in a food processor. Whip the cream and sugar to soft peaks and stir into the flavoured custard. Pour the mix into a 1.2 litre/2 pint pudding basin, then cover and freeze overnight or for several hours. (The pudding can be frozen for up to 1 month.)\nFor the sauce, cut away the pith and peel from the tangerines or satsumas with a sharp knife, then cut either side of the membranes to release the segments. Bring the orange juice and caster sugar up to a boil, stirring occasionally, until the sugar is dissolved. Then boil hard for 20-25 mins, until reduced by about half to a thick syrupy consistency (like golden syrup). Watch it carefully so it doesn’t boil over, lowering the heat if necessary. Leave to cool, finishing with a splash or two of your chosen liqueur, if using. Can be kept chilled for 3-4 days.\nTo serve the dessert, transfer it to the fridge 30 mins before serving, then dip the basin into hot water and turn the pudding out onto a chilled plate. Arrange some of the fruit segments around the base of the pudding, and some on top. Drizzle with some of the syrup and serve the rest separately. Finish the decoration with holly leaves and a dusting of icing sugar."}
{"text": "Pulse the madeira cake in a food processor until you have fine crumbs. Melt the white chocolate in a bowl over just simmering water or in the microwave. Shop bought madeira cake can vary in texture so you may need to add a little extra melted white chocolate to make the mixture stick into balls. Stir the orange zest into the chocolate, then work the chocolate into the crumbs using your hands.\nForm into 10 small truffle-sized balls, then roll gently in your palms to smooth the surface. Arrange the balls on a baking parchment-lined dinner plate. Refrigerate for 30 minutes to allow the mixture to set.\nMelt the dark chocolate in a microwave or over a bowl of just simmering water. Dip a lolly stick into the melted chocolate about 1.5cm in and poke half way into a cake ball. Repeat with the remaining balls. Put them back on the plate. Return to the fridge for five minutes.\nDip the cake pops one at a time into the melted chocolate, allowing any excess chocolate to drip off and spin the pops to even out the surface. Poke the pops into a piece of polystyrene or cake pop holder if you have one, keeping the pops apart. Allow to set for about half an hour.\nHeat the white chocolate in a microwave or over a pan of simmering water. Allow to cool for a few minutes until it has a thick, runny consistency. If the chocolate is too hot, it will melt the dark chocolate underneath so make sure you do not overheat it. Spoon a small amount on top of the cake pops and tip them back and forth so that it runs down the sides a little. If you have holly decorations, set one on each pop. If using writing icing, wait for another 20 minutes or so until the white chocolate has set. To avoid a bloom on the chocolate, cover the cake pops in chocolate on the day you want to eat them – or the day before at the earliest.\nPipe on holly leaves with the green icing and two little dots for berries using the red. Once finished, store them in a cool place, though not the fridge"}
{"text": "Butter a 500ml, a 1-litre and a 2-litre pudding bowl, then line the base of each with a circle of baking parchment. Butter 3 large sheets of greaseproof paper, lay each on a large sheet of foil butter side up, and fold a pleat in the middle of each.\nRoughly chop 250g of the figs and set aside. Put the remaining figs, butter and brandy into a food processor and whizz until smooth-ish, then scrape into your largest mixing bowl. Tip in the chopped figs, mixed vine fruits, grated apple, sugars, breadcrumbs, flour and allspice. Stir everything together, allowing as many helpers to give a stir and adding as many wishes as you like. Divide between the pudding bowls and smooth the surfaces.\nCover the puds with the buttered paper-foil sheets, tie with string and trim. Lower the puds into separate saucepans with upturned saucers or scrunched up bits of foil in the bottom (so the puds don’t touch the bottom), then fill each pan with enough boiling water from the kettle to come halfway up the sides of the bowl. Cover with a lid and simmer the small pud for 1-1½ hrs, medium for 2-2½ hrs and large for 3 hrs, topping up the water as needed. Remove and leave to cool. If giving as a gift, put a new piece of parchment on top. \n."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Butter a 22 x 31cm or similar Swiss roll tin, then line with buttered baking paper. Tip in 1 tbsp cocoa, turn the tin until it’s evenly coated, then tap out any excess.\nFor the sponge, beat the eggs and sugar with electric beaters for 7 mins, or until thick enough to hold a trail. Fold in flour and cocoa, then swirl in butter and fold through. Tip into the tin, bake for 10 mins until just firm, then cool under a clean tea towel.\nFor the mousse, beat the egg yolks with the sugar until thick and pale. Melt the chocolate and loosely whip the cream until it just holds its shape. Quickly beat half the cream and all of the chocolate into the egg mix, then gently fold in the rest of the cream. Whisk the egg whites until softly peaked, then fold in.\nGrease a 1.4 litre/2½ pint basin with a little oil. Line with cling film, letting it overhang. To build the pudding, cut a circle of sponge to fit the bottom of the basin and put it in. Cut seven sloping rectangles about 10cm long from the sponge and fit them tightly together around the bowl. Sprinkle with most of the coffee and Tia Maria mix. Fill the bowl halfway with the mousse then, using what’s left of the sponge, top the mousse with a snug-fitting circle of cake. Sprinkle with remaining coffee mix. Spoon in the rest of the mousse, then cover with the overhanging cling film. Chill for at least 4 hrs until firm (ideally overnight), then turn onto a plate.\nFor the topping, heat all the ingredients gently in a bowl over a pan of simmering water until the chocolate melts. Leave to cool, stirring occasionally, until thick and glossy. Spread all over the turned-out pudding, then top with the chocolate-coated cocoa beans and chocolate curls."}
{"text": "Fry the onions, garlic and ginger in the oil for about 15 mins. Add the lamb and stir-fry until browned. Add the spices, cook over the heat to release their flavours, then add the almonds. Pour in the stock and season to taste.\nCover the pan and simmer for 45 mins, stirring occasionally. Add the apricots, then simmer 15 mins more until the lamb is tender. Thin with a little water if the sauce starts to get too thick.\nTo freeze, cool, then pack into a freezer container or bags. Will keep for up to 3 months. Thaw for 6 hrs in the fridge, then reheat in a pan until bubbling hot."}
{"text": "Start with the fruit. Pour the apple juice into a saucepan and bring to a simmer. Add the butter, let it melt, then take off the heat and add the syrup and rum. Put the mixed fruit and cranberries into a large bowl, pour over the hot rum mix, then cover tightly with cling film and leave overnight.\nThe next day, heat oven to 160C/140C fan/gas 3. Grease and double-line a 20cm round, deep cake tin with non-stick baking parchment. Beat the butter and sugar together until creamy and pale, then gradually beat in the eggs until light and fluffy. If the mix starts to split or look lumpy, add 1 tbsp of the flour and keep beating. Sift in the flour, spices and 1/4 tsp salt, and fold in using a large spoon. Fold in the orange zest, nuts, soaked fruit and soaking liquid.\nSpoon the batter into the tin, level the top, then make a slight dimple in the middle using the back of the spoon. Bake for 1 hr 30 mins, then reduce oven to 140C/120C fan/gas 1 and bake for a further 1 hr 45 mins or until it has risen, is a dark golden colour and a skewer inserted into the middle of the cake comes out clean. Put the tin on a cooling rack and leave until warm.\nTo feed the cake the first time, use a cocktail stick to poke all over the top of the warm cake. Stir together the rum and maple syrup, then slowly spoon over the cake. Cool completely, then remove the baking parchment, wrap loosely in clean baking parchment and store in an airtight tin. Feed the cake every week to 10 days until you decorate it.\nTo cover, ice and decorate your cake, see 'goes well with' for instructions on how to make our Midwinter candle cake, Sparkly bauble cake or Sparkling snowfetti cake."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Butter eight 150ml ramekins and line the bottoms with circles of non-stick baking paper. Divide the cake mix between the ramekins, transfer to a baking sheet and slide into the oven. Bake for 30 mins until springy and dark golden brown. Leave until cool enough to handle, then run a round-edged knife around the edge of the each cake. Turn out and cool completely on a rack.\nIf the cakes have risen into peaks, make flat by slicing the tops off with a serrated knife. Melt the jam with 1 tbsp water and brush over the top of the cakes. Lightly knead the marzipan and shape eight golf ball-sized balls. (You will have some left over – wrap up well for another time.) Using a rolling pin, gently roll the balls into flat circles, approx 1cm thick and the same diameter as the cakes. Sit the marzipan on the jammy side of the cakes. Do the same with the icing, brushing the marzipan with a little cooled, boiled water to help it stick.\nBeat the egg white until just frothy and broken up. Spread the caster sugar over a plate. Dip the cranberries and rosemary in the egg white, shake off the excess and roll in the caster sugar to create a frosty effect. Leave to dry for 15 mins. Tip away all but 2 tsp of the egg white and mix with the icing sugar to create a thick paste. Use to fix two cranberries and a sprig of rosemary to the top of each cake. Decorate with gold ribbon. The cakes will keep in an airtight container for up to a week."}
{"text": "Drain the cherries in a sieve over a bowl. Cut them in half. Peel the pear, then grate it coarsely.\nIn a large bowl, combine the cherries, pear, the raisins, sultanas and brandy. Stir well and cover with clingfilm.\nHeat in the microwave on high for 3 mins, then leave to cool for 5 mins to let the fruit plump up. Break the chocolate into squares while you wait.\nTip the chocolate and butter into the hot fruit. Stir, then leave to melt. Let it cool, uncovered, for about 15 mins.\nMeanwhile, rub 1 tbsp butter around the inside of a 1-litre pudding basin.\nLay two sheets of foil over each other and butter the one on top. Holding both sheets together, fold a 3cm pleat across the middle of the foil and set aside.\nBeat the eggs together in a small bowl. Sift the flour, sugar, mixed spice and cocoa powder on top of the chocolatey fruit, then add the breadcrumbs, eggs and 1/4 tsp salt.\nStir everything together with a wooden spoon – it will be quite a wet mixture. Tip it into the buttered basin.\nCover the pudding with the buttered foil (buttery-side down), and scrunch it over the edge of the basin. Tie string tightly under the lip of the basin, and make a string handle to help you lower the basin in and out of the saucepan later.\nTrim the foil so that a frill of about 5cm is left sticking out, then tuck the frill up and under itself neatly. The aim is to keep the pudding watertight beneath.\nPut a heatproof saucer into the very large saucepan, then put the basin on top. Pour in just-boiled water to come halfway up the basin.\nCover the pan and steam the pudding for 2 1/2 hrs. Test the pudding is cooked by inserting a skewer through the foil – if there is any wet mixture, steam for 15 mins more then check again.The pan should be simmering rather than boiling hard. Top up the water levels as it cooks, if you need to.\nTo store, let the pudding cool and leave in a cool dark place to mature. Don’t unwrap the foil. \nTo reheat, steam in a pan for 30 mins, or microwave on medium for 5 mins. Remove the foil to microwave, covering with clingfilm instead.\nFor the sauce, break the chocolate into squares. Put all the ingredients in a small pan and heat gently, stirring, until smooth. Serve the pudding topped with any remaining cherries, the sauce and a dollop of double cream."}
{"text": "Mix together the orange and lemon zests and juice, the orange blossom water, rosewater and honey in a large bowl. Stir in all of the dried fruit, cover and leave overnight to soak.\nThe next day, heat oven to 160C/140C fan/ gas 3. Grease and double-line a 22cm round or square cake tin (for a flatter cake) or a 20cm round or square tin (for a deeper cake) with baking parchment. In another big bowl, beat the butter and sugars together with an electric mixer until pale and fluffy. Beat in the eggs, one by one, then fold in the flour, almonds and cinnamon.\nTip in the soaked fruits and any juices left in the bowl, and stir in. Spoon the mix into the prepared tin and level the top. If you want your cake flat rather than slightly rounded, make a gradual dip in the centre of the mix with the back of a wooden spoon. Bake for 1 hr 30 mins, then turn the oven down to 140C/120C fan/gas 1 and bake for another 1 hr 30 mins for 22cm cakes, or 1 hr 50 mins for 20cm cakes, until a skewer poked into the centre comes out clean. Cool in the tin, sitting on a wire rack.\nWhile the cake is still warm, mix together the feeding ingredients, pepper the cake with holes using a thin skewer and spoon over the liquid. If you’re making the cake ahead of time, feed once a week for up to 4 weeks. Keep well wrapped in parchment, inside an airtight container, for up to 1 month. If you’re not getting ahead, this cake tastes just as delicious a day or two after baking."}
{"text": "Grate the zest from the orange and squeeze the juice (about 120ml/1 cup) into a large bowl. Snip the apricots into small pieces with scissors, then add the dried fruit and the marsala. Cover with cling film and leave to soak overnight.\nThe next day, rub a little of the butter around the inside of a 20cm round, deep cake tin, then line the base and sides with a double layer of parchment. Heat oven to 160C/140C fan/gas 3.\nPut 200g of the biscuits in a large food bag, squish out the air, then bash the biscuits to fine crumbs. It doesn’t matter if there are a few nuggets left.\nPut the remaining butter and the sugar into a large bowl and beat with an electric mixer for 2 mins or until paler and creamy.\nMix in the eggs, one by one. Sift in the flour, baking powder, mixed spice and 1 /4 tsp salt. Tip in the crumbs and beat together for a few seconds until evenly mixed.\nFold in the soaked fruit and almonds with a spatula.\nScrape the cake mixture into the prepared tin. Level the top and make a saucer-sized dimple in the middle of the batter. This will help your cake to rise evenly.\nBake for 2 hrs, then turn the oven down to 140C/fan 120C/ gas 1. Cover the cake with foil and bake for another 1 hr 30 mins or until risen and dark golden brown.\nCheck the cake is cooked by inserting a cocktail stick into the middle. It will come out dry when the cake is ready. Set on a cooling rack and leave for a few hours.\nUsing the cocktail stick, poke deep holes all over the cake. Slowly drizzle 2 tbsp marsala or sherry over the cake.\nWhen completely cold, wrap the cake in clean baking parchment and store in a tin in a cool, dark place. Feed it every seven to 10 days until you are ready to decorate it.\nUnwrap the cake and put it on a flat plate or board (25cm or bigger). Brush a thin layer of apricot glaze over the cake.\nSift a little of the royal icing sugar onto your work surface. Unwrap the marzipan and knead it with your hands until it feels softer.\nSprinkle the marzipan with more sugar and roll it to an even circle about 35cm across.\nLift the marzipan over the cake, smooth it down to the board, then trim with a knife. Don’t cut too close to the cake at first. You can smooth the icing with a jam jar or tumbler, then trim again if you need to\nSpray the marzipan lightly with the gold spray. Spread the almonds out onto some baking parchment and spray these heavily.\nBreak four of the remaining 50g biscuits into nuggets using your fingers.\nMix the royal icing sugar with 4 tsp cold water. It should be thick but run very slowly when you drop it from the spoon. Spoon it over the cake and spread it to the edges, letting it drip here and there. Use a palette knife to help.\nPut the whole biscuits on the cake first, then add the broken biscuits and the almonds in-between.\nPut 1 tsp icing sugar in a fine sieve and shake a snowy dusting over the cake. Scatter the cake with the sugar balls, snowflakes or sprinkles, then leave the icing to set."}
{"text": "Heat oven to 200C/180C fan/gas 6. Place the butter in a small saucepan and heat until foaming and browned. Remove from the heat and pour through a sieve, then leave to cool. Discard the white solids, leaving only the melted butter. Grease 10-holes of a friand or muffin tin with a little of the butter. Whisk the egg whites in a large bowl until just frothy. Sift over the flour, spices and icing sugar. Scatter with ground almonds and pour in the cooled butter. Fold into the egg whites and mix until smooth and without any lumps. \n.\nFill each hole with some of the mix and place the tin or tins on a baking sheet. Bake for 18-20 mins until the friands have risen and are golden and springy to the touch. Remove from the oven and leave to cool for about 5 mins before transferring to a wire rack. Eat slightly warm or completely cool, but the friands are best eaten on the day of baking. Dust with icing sugar before serving with Chestnut fool (see 'Goes well with')."}
{"text": "Tip the flour into a large bowl or the bowl of a freestanding mixer. Add the yeast and sugar to one side of the bowl and 1 tsp fine salt to the other. Mix together, then add the melted butter and 275ml warm water. Mix to a dough, then knead for 10 mins by hand (or 5 mins in a freestanding mixer) until the dough feels stretchy and soft. Clean out the bowl, then lightly grease with a little oil. Turn the dough over in the oiled bowl until it’s well coated. Cover with cling film or a tea towel and set aside somewhere warm until the dough has doubled in size. Alternatively, put the dough in the fridge and leave to rise slowly for 2 days (bring it to room temperature before continuing to step 2).\nLine your largest baking sheet with parchment, and dust with polenta or cornmeal. Drain the mozzarella and dry the balls on some kitchen paper. Tip the dough onto your work surface and punch out the air bubbles. To make a Christmas tree shape, you’ll need 23 balls. Tear off lumps of dough, ensuring each one is roughly the same size (if you want to be exact, weigh the dough, divide the weight by 23, then weigh each ball of dough as you break them off).\nShape each piece of dough into a disc and place a ball of mozzarella in the middle. Pull up the sides of the dough to encase the cheese, pinching the dough together to seal. Roll into a ball and place on the baking sheet, sealed-side down, in a tree shape. Leave a little space between each ball, as they will grow when proving. You’re likely to have 2 or 3 balls without mozzarella, so use these pieces of dough for the trunk – for anyone who doesn’t like cheese. Cover the tray with a sheet of oiled cling film and set aside for 30 mins until almost doubled in size.\nWhile the dough proves, make the tomato dipping sauce. Melt the butter in a saucepan, add the garlic and sizzle for 30 secs until fragrant. Add the tomatoes, oregano, vinegar, sugar and some seasoning. Bubble for 30 mins until the sauce is thick. Heat oven to 200C/180C fan/gas 6.\nWhen the dough is ready, uncover the baking sheet and bake for 20-25 mins until golden brown. Meanwhile, make the garlic butter. Melt the butter in a saucepan, add the garlic and sizzle for 1-2 mins until the garlic is a shade darker (but not brown). When the bread is cooked, transfer it to a platter. Stir most of the parsley into the garlic butter and use a pastry brush to brush it all over the bread. Leave it to soak in, then brush on more. Sprinkle over a little extra parsley to garnish, if you like. Reheat the tomato sauce and serve it alongside the bread with any remaining garlic butter."}
{"text": "Heat oven to 180C/160C fan/gas 4 and line the muffin tin with the muffin cases. Put half the butter, sugar and vanilla in a bowl, and beat until pale and fluffy. Add one egg and mix well. Add half the flour and milk, and mix with a spatula until combined. Use 2 teaspoons to distribute the cake mixture evenly among the cases and bake for 12 mins until risen and golden, and a skewer inserted to the centre comes out clean. Transfer to a wire rack to cool. Repeat to make another batch of 24 mini cakes.\nWhile the cakes are cooling, make the icing. Put the butter and icing sugar in a bowl and beat until smooth. Add the vanilla and food colouring, and blend again until evenly coloured. Transfer the icing to a piping bag fitted with a small star nozzle. Once the cakes have cooled, use a skewer to make a small hole in the base of each cake. To decorate the cakes, pipe blobs of green icing over the surface of each one.\nNow you’re ready to start assembling your Christmas tree. Paint the foam cone all over with green paint and leave to dry – don’t worry about it being too neat. Push the cone into the pot. To build the tree, push a cocktail stick into the base of each cake and press it into the cone. Continue until the cone is covered in cakes, trying to keep them as close together as possible. You may have some left over, which you can serve alongside the tree.\nSpray the chocolate star gold and put on top of the tree, then decorate the rest of the tree with sweets. The cakes will last for 3 days."}
{"text": "Put the mixed fruit, halved glacé cherries, mixed peel, carrot, and lemon and orange zest in a bowl with the sugar and spice. Pour in the lemon juice and alcohol, and stir really well. Cover and leave to soak overnight.\nHeat oven to 160C/140C fan/gas 3 and put a full kettle of water on to boil. Grease a 1.5-litre pudding basin and put a disc of baking parchment in the base. Stir the eggs into the fruit mixture, then stir in the chopped nuts, flour and breadcrumbs. Finally, grate in the frozen butter, stirring the mixture frequently so that it evenly disperses.\nFor the topping, mix the soft butter and golden syrup together, and spread over the bottom of the basin. Pile in the whole cherries, orange segments and whole nuts, breaking the pecans in half as you add them. Try not to just make a thick layer of fruit and nuts on the base – ease some up the side too. Spoon in the pudding mixture and level the top, then cover with baking parchment and foil. Tie the top with string or an extra-large rubber band, then place in a roasting tin and pour in the water from the kettle. Cover the whole thing with a tent of foil to seal in all the steam, then place in the oven for 6 hrs. This gives a light pudding, so if you prefer a darker one, cook for up to 8 hrs. Will keep in the fridge for 1 month. If you want it to last longer, omit the orange segments.\nTo serve, steam in a large pan with an upturned saucer on the base for 2 hrs, then turn out and decorate with holly, if you like. Serve with Brandy syrup cream (see 'Goes well with')."}
{"text": "Sift the flour, salt and cinnamon into a bowl. Stir in the sugar and yeast, then make a well in the centre. Pour the milk into a small pan, add the butter and warm gently until the butter has melted. Pour into the well, then add the beaten eggs. Gradually mix to make a soft, slightly sticky dough.\nTurn the dough out on to a lightly floured surface and knead vigorously for 5 minutes until smooth. Put the dough into a clean bowl, cover with oiled cling film and leave somewhere warm for 11⁄2 hours or until the dough has doubled in size. Lightly butter a 900g loaf tin.\nPunch the air out of the dough and turn it out on to a lightly floured surface again. Knead once more until smooth, then knead in the walnuts and raisins. Divide the dough into three and shape each piece into an oval ball. Drop each ball side by side into the prepared tin and cover loosely with oiled cling film. Leave somewhere warm for 30 minutes until the dough has reached the top of the tin. Meanwhile, preheat the oven to fan 180C/conventional 200C/gas 6.\nMix the egg yolk with 1 tbsp of water and brush over the top of the risen loaf. Bake for 20 minutes, covering loosely with a double sheet of foil once it’s nicely browned. Then, lower the temperature to fan 160C/conventional 180C/gas 4 and bake for a further 20 minutes. Turn the loaf out of its tin and tap the base – it will sound hollow if the loaf is done. If it doesn’t, return it to the oven out of its tin and bake for another 5-10 minutes. Cool the loaf on a wire rack. (The loaf can be sealed in a plastic bag and frozen for up to 1 month. If you slice it before freezing you can toast the slices straight from the freezer, otherwise you need to remove the whole loaf from the freezer the night before.) Serve lightly toasted, with butter and jam."}
{"text": "Gently melt the butter, muscovado sugar and syrup in a large pan until the sugar dissolves. Mix the flour, spices and ½ tsp salt. Cool the butter mixture a little, then stir in the bicarb. Immediately add half the spiced flour and beat well. Add the egg and the rest of the spiced flour, then beat well again until the mixture comes together as a soft dough. Tip onto a sheet of foil, flatten to a large disc, then cool and chill until firm. \n.\nHeat oven to 190C/170C fan/gas 5. Halve the dough and roll out on a floured surface. Stamp out trees using a cutter about 10cm long and arrange, well spaced apart, on baking sheets. Bake for 12-15 mins until golden. Leave to harden, then lift onto a rack. Repeat with the remaining dough. Use the trimmings to stamp out 3-4cm stars, then bake for 9-10 mins.\nTo decorate, mix about 3 tbsp water into the icing sugar to make a thick icing. Use to sandwich two trees together with a lolly stick between them. Use the rest of the icing to ice the trees and stars, adding sweets or sprinkling with the sugar. For a neater result, use the writing icing to make an outline of the tree before filling in with the icing. Leave to set. \n."}
{"text": "Place everything but stout and eggs into your largest bowl and mix. Add stout and eggs, and stir everything together. Spoon into pudding basins – we used 1 x 2 litre, 1 x 1 litre and 1 x 500ml basins. Cover with pleated greaseproof paper and foil and secure with string.\nLower the puds into saucepans with upturned saucers or scrunched-up bits of foil in the bottom (so the puds don’t touch the bottom), then fill with water from the kettle until it comes halfway up the sides of the basins. Simmer the small pud for 1½ hrs, medium for 2½ hrs and large for 3½ hrs (topping up with water as necessary). Cool, then store in a cool, dry cupboard for up to 1 year.\nTo serve, re-boil puds as above to heat through, 1½ hrs for small, 2½ hrs for medium and 3½ hrs for large (top up as necessary). Turn onto a plate, decorate, and serve."}
{"text": "The night before making the cake, put the mixed fruit and cherries in a bowl, add your chosen spirit or orange juice, cover with cling film and leave to soak for 8-12 hrs. If you don’t have time to soak the fruit, put the bowl in the microwave for 5 mins, stir, then microwave for 5 mins more before leaving to cool completely.\nGrease a 23cm springform cake tin and line the base and sides with baking parchment. Heat oven to 150C/130C fan/gas 3. Using a large bowl and electric hand whisk, or a stand-alone mixer, cream together the butter and sugar until pale, light and fluffy. Spoon in the golden syrup, then add the beaten egg in 4 additions, whisking well after each and adding 1 tbsp of the flour to prevent the mixture from curdling. When all the eggs have been incorporated, gently fold in the rest of the flour and the spices. Finally, fold in the soaked fruit and the orange and lemon zest. Spoon the mixture into the prepared tin and smooth the top with the back of the spoon. Bake for 2 hrs or until a skewer inserted into the centre comes out clean. Your kitchen will be filled with lovely Christmas smells!\nLeave the cake to cool in the tin for about 30 mins. Remove from the tin and place on a wire rack until completely cold. If not decorating straight away, wrap the cake in foil to store. If you’ve made your cake a few weeks before you want to eat it, you can brush the cake with a little extra alcohol every week for up to 4 weeks. This will keep it moist and add flavour.\nTo decorate the cake, brush all over with a little melted jam. Lightly dust your work surface with icing sugar and roll out the marzipan to a circle, large enough to cover the top and sides of the cake. Lift the marzipan by hanging it over the rolling pin and drape it over the cake. Smooth the marzipan down the sides of the cake, then trim away any excess from the bottom. Brush the marzipan all over with the remaining apricot jam, then roll out 1kg of the fondant icing and, using the same method as for the marzipan, cover your cake with the icing. Trim the edges and smooth out any marks with the palm of your hand, rubbing the icing to give it a shine.\nKnead the remaining icing, then cut off a small piece, about the size of a small marble, and set aside. Colour the large piece of icing with brown food colouring, adding a little at a time and kneading in well, until you have the desired colour. Divide the icing into 3, then shape a reindeer – body, head, 2 feet and a tail – from each piece. Mix 1 tbsp icing sugar with a tiny splash of water to use as a glue. Stick the head onto the body and squash down a little. Use a small knife to make three indents in the feet, then stick to the reindeer body, along with the tail.\nRemove a small piece from the reserved icing to make Rudolph’s red nose. Colour with red food colouring, then use the icing glue to attach to one of the reindeer heads. Colour the remaining icing black and shape into two more noses and two eyes for each reindeer, then stick onto the heads. Poke half a pretzel into either side of the reindeers’ heads to create antlers. Use a little of the icing sugar glue to stick the reindeer to the top of the cake, then tie the gold string around their bodies to create reins. Finish the cake by tying a sparkling red ribbon around the base and securing it in place with a pin."}
{"text": "Whisk the egg yolks and sugar with an electric whisk for 10 mins until pale and thick. Break up the Christmas pudding with a fork and stir it into the egg mixture so it is evenly distributed, then pour in the brandy and mix again.\nIn a separate bowl, whip the cream until it holds soft peaks, then fold it into the mixture with a large metal spoon. Pour into a freezer-proof container, cover well and freeze for several hours until set."}
{"text": "Heat oven to 160C/140C fan/gas 3. Put the duck on a rack set over a roasting tin and prick the skin all over with a skewer. Season well. Halve one of the oranges and squeeze some of the juice into the duck cavity and the tin, then stuff the cavity with both of the halves. Pour 100ml water into the tin and roast for 20 mins per 500g (about 50 mins). Turn the oven up to 220C/200C fan/ gas 7 and roast for another 20 mins until the duck skin is crispy and golden.\nPut a small pan of water on to boil. Using a peeler, pare the zest from the remaining orange. Scrape any pith off the zest using a small, sharp knife. Add the zest to the water and gently boil for 8-10 mins, then drain, slice thinly into strips and set aside. In the same pan, dissolve the brown sugar with the balsamic vinegar. Cut the pared orange in half, juice it and pour the juice into the pan. Add the Grand Marnier and 1 tsp butter. Bubble until it has reduced by half and is dark and syrupy. Remove from the heat and stir in the orange zest.\nOnce the duck is cooked, wrap it in foil to keep warm and put it on a board to rest. Spoon off the fat from the roasting tin and discard. Pour any remaining duck juices into a wide, shallow saucepan. Tip in the stock and bring to the boil. Add the wine and simmer for 2-3 mins, then add half the orange sauce and stir well. In a small bowl, mix the cornflour with 2 tsp cold water, then stir into the gravy. Season, add 1 tsp butter and whisk together. Pour into a warm gravy jug.\nTo serve, brush the remaining sticky orange glaze over the duck, then put the duck on a board and garnish with the watercress. Heat a frying pan over a medium heat and add 1 tsp butter. Once the butter has melted, tip in the spinach and cook for 1-2 mins until it has wilted. Season and tip into a warm serving dish."}
{"text": "Put the spinach in a colander, then pour over a kettle of boiling water and leave to wilt. Once cool, wring out the excess moisture using a clean tea towel, then chop the spinach and put in a large bowl. Stir in the tofu, oil, pine nuts, nutmeg, garlic, lemon zest, chopped dill and fruit until well combined, season generously and set aside.\nOn a well-floured surface, roll the pastry out into a 60 x 20cm rectangle. Leaving a 1cm border, spoon the spinach mixture along the length of the pastry, leaving a 2cm gap at both short ends. Fold in the two short ends to stop any of the filling coming out, then roll the pastry away from you to enclose the filling and create a long sausage shape. Join the two ends together to create a wreath shape and stick together with a little almond milk. Transfer the wreath to a baking tray lined with baking parchment and chill for 20 mins. Can be made up to this point a day in advance and kept covered in the fridge.\nHeat oven to 200C/180C fan/gas 6. Using a sharp knife, cut slashes across the top of the wreath. Mix a little almond milk with some olive oil (this will help the pastry colour) and brush all over the wreath. Bake for 40-45 mins until golden brown. Leave to cool for 5 mins, then transfer to a board and decorate with the reserved dill fronds and some dried cranberries."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease a 20cm round cake tin and line the base with a circle of baking parchment.\nPut the butter in a big mixing bowl with the sugar and vanilla extract, and mix until it looks creamy. Crack in the eggs, one at a time, mixing after each one. Sift the flour and cocoa together, add to the bowl with the milk and stir everything together until smooth. Spoon into the cake tin and use the back of a wooden spoon to spread the top to make it as flat as you can. Bake for 20 mins until a skewer poked into the centre comes out clean, with just cake crumbs stuck to it, not wet batter. Leave the cake to cool completely in the tin on a wire rack.\nRemove the cake from the tin and use a serrated knife to cut it into 8 wedges. Turn each one so that the round, outside edge is facing you, and push a lollipop or cake pop stick through the middle of the outside edge. Remember to leave enough of the stick poking out for you to hold.\nMix the food colouring and icing sugar with enough water to make an icing that is a bit runny, but still quite stiff. Try drizzling a bit on a spare piece of paper; you want it to stay in strips, not run all over the place.\nSpoon some icing over each cake wedge (you can cover it completely or drizzle lines across them in a tree shape). Decorate with sugar snowflakes and mini Smarties, then lift onto a wire rack and leave to set completely (this will take a few hours). Iced cakes will keep in the tin for up to 2 days. The un-iced cake can be frozen for up to 6 months. Defrost completely before cutting and decorating."}
{"text": "Line 4 small pudding-shaped moulds (200ml capacity) with cling film, smoothing it over to fit snugly, leaving an overhang around the edge. Finely grate the zest from the clementine and put it to one side. Squeeze 3 tbsp of juice and put it in a pan with the rum and sugar. Heat gently until the sugar has dissolved. Tip in the cranberries and raisins, and simmer for 2 mins (no more or it will become too thick) to plump up the fruit. Pour into a bowl, stir in the mixed peel and clementine zest, and leave until cold (about 1½ hrs, or you can leave overnight).\nIn a medium bowl, beat the yogurt with a spoon until smooth. Whip the cream so it's softly whipped, then fold into the yogurt. Measure off 4 tbsp of the fruit and its syrup, and set aside in a rigid freezer container (freeze for up to a month). Stir the rest into the yogurt mixture. Pour or spoon the mixture into the pudding moulds. Bring the overhang of cling film over the puddings, then cover with foil. Freeze for up to a month.\nFor the chocolate stars, cover a baking sheet with baking parchment. Draw 4 star shapes on the paper with a pencil (no need to be too accurate), then turn the paper over. Melt the white chocolate and, using a teaspoon, drizzle 4 star shapes over the pencil outlines. Leave to harden. Freeze the chocolate stars in a rigid freezer container layered between greaseproof paper.\nWhen ready to use, thaw the extra fruit and syrup at room temperature and the puddings in the fridge for 1 hr. Tip the puddings onto plates and peel off the lining. Serve with some of the sauce spooned over, with a chocolate star propped up against each one (the stars can be used straight from the freezer)."}
{"text": "Heat oven to 180C/160C fan/gas 4 and put in a baking tray to heat up. Grease 4 x 150ml ramekins, then add some sugar to each and shake to coat before tipping out the excess.\nWhisk the egg whites until stiff peaks form, then add the sugar and continue whisking until stiff again. In a big mixing bowl, stir together the custard and crumbled cake. Stir in a quarter of the egg whites, and very gently fold in the rest using a big metal spoon until the mixture isn’t too streaky.\nDivide the mixture between the ramekins, running your finger around the top inside of each to leave a ‘gap’ between the mixture and the ramekin just at the very top. Bake for 12-15 mins until risen and golden. Meanwhile, warm the caramel sauce.\nServe the hot soufflés immediately, with jugs of warm caramel sauce for people to pour into theirs."}
{"text": "Place all the ingredients, except the eggs, treacle and lemon and orange juice, into your largest bowl with 1 tsp salt, then mix. Add the remaining ingredients along with 700ml water, then mix to a consistency that drops off your spoon. Cover and leave in a cool place overnight. The mixture will become firm.\nThe next day, add enough water to bring the mix back to a dropping consistency, then spoon into greased pudding basins – we used a 2 litre and a 1 litre. Cover with pleated greaseproof paper and foil, and secure with string.\nLower the puddings into a saucepan with upturned saucers or scrunched-up bits of foil in the bottom (so the puds don’t touch the bottom), then fill with boiling water from the kettle until it comes halfway up the sides of the bowl. Simmer the smaller pudding for 2-2½ hrs and the larger one for 3-3½ hrs. Cool, wrap well in foil and chill for up to 3 days."}
{"text": "Heat oven to 190C/170C fan/gas 5. Make the crumble top first. Rub the butter and flour together until they look like rough breadcrumbs. Stir in the almonds, demerara sugar, cinnamon and a pinch of the cardamom, saving the rest for the friand batter.\nMelt the butter, then let it cool for 5 mins. Meanwhile, generously grease the wells of a 12-hole friand tin (we used a Master Class non-stick friand tin, or you can use a deep non-stick muffin tin). Sift the dry ingredients for the friands, including the remaining ground cardamom, into a large bowl. Also add the rougher bits of almond that collect in the sieve.\nCut 12 thin half-moons from 1 apple, then peel and chop the rest of the fruit into small pieces. Put the egg whites in a separate bowl and whisk until thick, foamy and doubled in size, but not stiff.\nUsing a spatula or large metal spoon,fold thewhitesintothedryingredients,thenfold in the melted butter until even, followed by the chopped apple. Divide the batter between the tin and top with the crumble, then poke in the apple slices. Bake for 25 mins or until golden and risen. I find it best to let the friands cool in the tin, then carefully ease them out with a palette knife. Best on the day they are made, but will keep in an airtight tin for 2 days, or freeze for 1 month."}
{"text": "Heat oven to 180C/160 fan/gas 4. Put the stollen cubes into an ovenproof serving dish. Mix the cream, milk and eggs together and pour over the stollen. Sprinkle over the amaretti biscuits. Bake for 45 mins until golden and slightly risen. Serve dusted with icing sugar, if you like."}
{"text": "Pour away any excess fat from the turkey roasting tin but keep the onion halves (if using our \n). Set the tin over a medium heat, then sprinkle over the flour. Stir with a wooden spoon and cook for 2 mins, turning the onion over in the mixture to extract the flavour.\nSlowly stir in the wine and stock, adding any juices from the resting turkey. Bring to the boil, scraping the bits from the bottom, then simmer over a low heat for 15 mins. Sieve and season before serving alongside your Christmas turkey."}
{"text": "Soak the dried fruit in 100ml of hot water. Gently warm the apple juice for a few mins in a pan, then add the yeast and leave to activate for 10-15 mins (it will start to bubble).\nPut the flour in a bowl. Stir in the yeast and apple juice mixture to form a smooth dough, then cover and leave to prove somewhere warm until roughly doubled in size, about 1-2 hrs. You can also put the dough in the fridge to rise slowly overnight.\nDrain the fruit and add to the dough along with the nuts, spices and marzipan. Squish everything together, then turn the dough out onto a lightly floured work surface and knead until the fruit stays in the dough.\nShape the dough into a sausage shape and put it on a baking tray lined with baking parchment. Cover with a clean tea towel and leave to prove somewhere warm for 30 mins–1 hr until it has risen by about a quarter.\nHeat oven to 180C/160C fan/gas 4. Bake the stollen for 20 mins, then reduce oven to 150C/130C fan/gas 2 and bake for 25-30 mins more until golden brown and firm to the touch.\nRemove the stollen from the oven and brush all over with the melted butter. Dust with the icing sugar and leave to cool completely before slicing. Store any remaining stollen, well wrapped, in an airtight container."}
{"text": "Chop the butter and put in a large pan with the sugar. Chop the apricots and figs and add to the pan with the cranberries or cherries & raisins, orange and lemon zests, orange juice and orange liqueur.\nHeat slowly, stirring, until the butter has melted and the mixture has come to a slow simmer, then simmer for 10 mins, stirring occasionally. Meanwhile, toast the almonds in a dry frying pan until lightly coloured. Cool slightly, then tip half the almonds and half the pistachios into the food processer and grind to a fine powder. Roughly chop the remaining almonds (keep the pistachios whole).\nRemove the pan from the heat and leave to cool. Heat oven to 150C/130C fan/gas 2. Grease and double-line the base and sides of a 20cm-deep cake tin with baking parchment.\nStir the chopped and ground nuts and the eggs into the cooled mixture. Set a sieve over the pan and sift in the flour, baking powder and spices. Stir in gently until the flour is well mixed in. Stir in the orange flower water.\nPour the mixture into the prepared tin and smooth the top. Bake for 2 hrs, then reduce the heat to 140C/120C fan/gas 1 and cook for a further 1-1½ hrs until the cake is dark golden and firm to touch. If the cake starts to become too dark, place 2 sheets of foil loosely on top.\nTo test it is cooked through, insert a fine skewer into the centre – if it comes out clean with no uncooked cake stuck to the skewer, it is cooked. If not, cook for a further 15 mins and test again.\nLeave the cake to cool in the tin for 30 mins, then turn out, peel off the paper and cool on a wire rack. Wrap in 2 sheets of baking parchment, then overwrap in foil. Will keep for 3 months, or freeze for up to a year.\nTo make the pistachio paste, grind the nuts as finely as possible in a blender or food processor. Tip into a bowl with the sugars and ground almonds. Add a few drops of almond extract, the egg yolks and lemon juice, and mix to a firm dough, using your hands to work the mixture into a ball.\nKnead the dough to a fairly smooth ball, then cut off a third and wrap in cling film. Dust the work surface with a little icing sugar and roll out the remaining paste to a little larger than the top of the cake. Brush the cake thinly with apricot jam and cover with the paste. Trim off excess using a sharp knife in a downward movement around the side of the cake.\nAdd a few drops of green food colour to the remaining pistachio paste to make it green. To make a tree, pinch off a small piece of paste and flatten between your fingers to a rough round. Place on a tray dusted with icing sugar. Make a smaller round and place on top, slightly offcentre. Continue to build up the tree, then top with a tiny paste cone. Repeat to make 7 trees in varying sizes. Leave to dry for several hours or overnight in a cool dry place. To make the icing, beat the egg whites with the lemon juice and glucose in a mixing bowl. Gradually sift in the icing sugar, beating all the time to make a stiff icing that forms peaks.\nTie the ribbon round the cake. Thread a cocktail stick through a tree base, then thread on the tree, leaving a little of the stick showing at the base to attach to the cake. Swirl the icing thickly over the cake, forming peaks and teasing it over the sides. Stick the trees into the top of the cake and scatter over a handful of silver balls. Dust the trees thickly with icing sugar."}
{"text": "Whisk the cream with the vanilla and icing sugar until it just holds its shape. Crumble the cake into six glasses, then top with a few cherries, a dollop of cream and a drizzle of the kirsch. Scatter over the chopped chocolate."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line and grease a 20cm square brownie tin. Beat the butter and sugar using an electric whisk for about 5 mins or until the mixture is light and fluffy. Gradually beat in the eggs, one at a time, making sure each egg is well incorporated before adding the next. Add the mincemeat and orange zest, and beat again for a few secs to combine.\nSift in the flour, cinnamon and nutmeg, and stir with a large metal spoon until completely mixed. Tip into the tin and smooth using the back of the spoon. Bake in the oven for 30-35 mins or until a skewer inserted into the centre comes out clean.\nMeanwhile, make the white chocolate icing. Put the chocolate in a large bowl. Pour the cream into a small saucepan and bring to the boil. Remove from the heat and pour over the chocolate. Stir until the chocolate has melted and it’s all combined, then set aside and leave to cool.\nLeave the traybake to cool in the tin for 10 mins, then transfer to a wire rack. Once the cake is completely cool, spread the icing on top of the cake, then finely grate over the extra chocolate and cut into squares."}
{"text": "Pour the milk into a small pan and add your \n and the sugar. Bring to a simmer mixing with a balloon whisk.\nPour the coffee into a mug and slowly add the hot spiced milk, holding some of the froth back with a spoon. Float the milk froth on top when the mug is full, then garnish with another pinch of festive spice."}
{"text": "Tip the butter into a large bowl and whisk with an electric hand whisk. Add the icing sugar, milk and \n. Mix well, first with a spoon, then with the electric beaters until smooth and fluffy. "}
{"text": "Grease a 2-litre pudding bowl with dairy-free margarine, then line the base with a circle of baking parchment. Grease a large sheet of baking parchment, then lay it on top of a large sheet of foil, margarine side up. Fold a pleat in the middle of each sheet.\nRoughly chop 125g of the figs and set aside. Put the remaining figs, the dairy-free margarine and the rum into a large \n and whizz until smooth-ish, then scrape into a large \n. Tip in the chopped figs, sultanas, raisins, grated apple, sugars, breadcrumbs, flour and allspice. Stir everything together, then spoon into your pudding basin.\nCover with the buttered paper-foil sheet, tie with string and trim. Lower into a large \n, with upturned saucers or scrunched-up bits of foil in the bottom (so the pud doesn’t touch the bottom), then fill the pan with enough boiling water from the kettle to come halfway up the sides of the bowl. Cover with a lid and simmer for 3 hrs, topping up the water as needed. Remove and leave to cool. Will keep in a cool, dry cupboard for up to a year."}
{"text": "Put the dried fruit, zests and juice, rum, coconut oil and sugar into a large pan set over a medium heat. Give it a good mix, bring to the boil, then lower the heat and simmer for 5 mins until the sugar has dissolved. Tip the mixture into a large \n and leave to cool for 30 mins. \nHeat oven to 150C/130C fan/gas 2. Line a deep 20cm cake tin with a double layer of baking parchment, then wrap a double layer of newspaper around the outside, tying it with string to secure. Mix the chia seeds with 150ml water. Leave to sit for 5 mins until gel-like and thick.\nAdd the remaining ingredients to the fruit mixture, along with the chia seed mix, and stir well, making sure there are no pockets of flour. Tip into your prepared tin, level the top with a spoon and bake in the centre of the oven for 2 hrs.\nRemove the cake from the oven, poke holes in it with a skewer and spoon over 2 tbsp of rum. Leave the cake to cool completely in the tin.\nTo store, peel off the baking parchment, then wrap well in cling film. Feed the cake with 1-2 tbsp alcohol every fortnight, until you ice it. Don’t feed the cake for the final week to give the surface a chance to dry before icing."}
{"text": "Mix the golden syrup, orange juice, sugar, spices and vanilla in a pan. Heat, stirring regularly, over a medium-low heat until all the sugar is dissolved and everything is combined – don’t let the mixture boil. Add the butter, and stir until melted and incorporated into the hot sugar mix.\nAdd the bicarb and whisk until fluffy and pale. Pour into a mixing bowl. Allow to cool slightly, then add the flour and beat on slow, or mix with a wooden spoon, until the mixture comes together and resembles an oily dough – it should be gloopy, pliable and runny, but will harden as it cools and sets.\nUsing a \n, tip the dough onto two large pieces of cling film laid out in a cross, one on top of the other. Wrap up to seal, then chill in the fridge for at least two hours or overnight. The dough can be made ahead to this stage and frozen for up to a month. Defrost in the fridge overnight, then leave at room temperature for 1 hr before kneading until pliable.\nHeat oven to 180/160C fan/gas 4 and line a couple of baking trays with baking parchment. Roll out the dough on a lightly-floured surface to a thickness of around \ncm. Using a round cutter with a diameter of 6-7cm, stamp out little rounds and transfer to the trays, leaving a 1cm gap between each one. Bake for 12-15 mins until darkened and firm (see tip, right). Transfer to a wire rack and leave to cool.\nWarm a tbsp of apricot jam with a little water until just boiling. Brush each cookie with the jam to aid sticking. Roll out the black fondant icing with a little icing sugar to a thickness of 2mm. Use the same round cutter as before to punch out little black circles, then stick them to the cookies. Use the excess icing to make two little wings for each cookie (keep some back to make the eyes). Roll the icing into 28 small balls, then halve each. Press a half onto the sides of each biscuit to make the wings\nFor the chest and face detail, roll out the white icing to a similar thickness as the black. Stamp out a smaller round shape, then use your fingers to stretch out the top to create the face shape. Mould the tummy by pinching the icing in a little where the face joins the tummy. Stick the moulded white icing onto the black icing with a little water.\nFor the beak, mould tiny pieces of the orange icing into triangles. To make the feet, shape the icing into tear drop shapes (two for each biscuit), press a little to flatten, then make two indentations to create the flipper effect. Stick to the biscuits with a dab of water, the beak towards the bottom of the face, the feet just below the white icing.\nFor the face, make two small circles for each biscuit – either using a tiny polka dot cutter or making small flat discs – then stick to the face. Add a small ball of white icing to each black circle to create a sparkle on each eye. Add a bow tie, if you like, with a small brush dipped in food colouring, and rosy cheeks using a little red dust colour with a paintbrush under each eye. Leave to set overnight, then wrap as gifts or serve."}
{"text": "Fry the onions in the butter for 15-20 mins until golden and softened. Butter a 900g loaf tin and put in the fridge to chill.\nHeat oven to 200C/180C fan/gas 6. Combine all the ingredients in a large mixing bowl, and work everything together to form a large meatball. Remove the loaf tin from the fridge and transfer the mixture to it – it will look like a lot, but should all fit if you pack it in. Use a \n to shape the top, so that it resembles a loaf of bread.\nCover with foil, then bake for 1 hr, or until the loaf reaches 70C on a meat thermometer. Heat grill to medium, then grill the loaf for 5-10 mins until golden on top. Leave to rest in the tin for 20 mins, then carefully tip the loaf onto a carving board or platter. Serve in slices with the usual trimmings, gravy and bread sauce."}
{"text": "Put the ground coffee, cinnamon stick and dates in a large cafetiere. Add the ground nutmeg, cloves and orange zest, then pour over 400ml freshly boiled water.\nStir gently with a wooden spoon to combine, then leave to steep for 4 mins. Slowly push down the plunger and serve in espresso cups."}
{"text": "Layer your ingredients in the jar as follows: First, put in the wholemeal flour mixed with baking powder. Then, the dried cranberries followed by the rolled oats with cinnamon. Your fourth layer is the soft brown sugar seasoned with flaky sea salt and finally, the white chocolate chunks and Horlicks. If giving the jar as a present, simply \n with the recipe method and print it off, stick it on the jar and tie a ribbon around the top.\nIf you want to make the biscuits yourself, or would rather handwrite the label, the method is as follows: Butter two baking sheets and pre-heat the oven (180C/160C fan/gas 4). Whisk an egg, the soft butter and vanilla extract in a bowl using an electric whisk until the mixture is smooth and creamy, so about 5 mins.\nAdd the contents of the jar and mix together gently to form a dough. Put 12 golf-ball-sized spoonfuls of the dough onto each baking sheet, then bake for 11 mins. Remove the cookies from the oven and leave to cool a bit on the baking sheets. Eat them while they’re still warm."}
{"text": "Put the dried fruit into a large bowl, add 2 tbsp brandy and the sugar, then cover with cling film. Microwave on High for 2 mins until the sugar has melted and the fruit plumped up. Give it a stir, then leave to cool and soak overnight. If you’re short of time, carry on with step 2 and leave to soak for as long as it takes to complete step 2.\nPut the cream, remaining brandy and icing sugar into a large bowl and whip to soft peaks. Pour the custard into another bowl and fold the cream into it. Tip into a freezer container and freeze the mix for 4 hrs, stirring the frozen edges into the rest of the mixture every hour or so until the whole tub is soft, but frozen (or use an ice cream machine, churning for 20-30 mins until thick). Meanwhile, line a 1.2-litre pudding basin with cling film.\nOnce the ice cream mix is thick, quickly fold the soaked fruit (and any liquid from it) and frozen cranberries through it and spoon into the lined basin. Freeze overnight or for at least 6 hrs. To serve, leave bombe at room temperature for 10 mins and turn out onto a serving plate.\nTo make the cranberry brandy butter sauce, in a heavy-based pan gently heat muscovado sugar and butter until the sugar dissolves.\nSplash in brandy, add cranberries and boil gently till the cranberries pop, but still hold their shape and colour the sauce. If you want to, sieve the seeds out of the sauce and add some more cranberries for a really glossy finish. Serve hot or warm."}
{"text": "Butter two cake tins, 24cm and 18cm, and line the bases with parchment paper. Heat oven to 180C/fan 160C/gas 4. Beat the butter and sugar in a bowl until light and creamy. Gradually beat in the eggs and orange zest, adding some flour with the last few additions to prevent curdling. Using a metal spoon, fold in the remaining flour and milk. Split the mix between the tins and smooth the tops.\nBake the cakes together, 30-35 mins for the smaller and 40-45 mins for the larger, until golden and springy. Cool in the tins, then turn out on a rack to cool fully.\nBreak milk and dark chocolate into a bowl and melt over a pan of simmering water, stirring occasionally. Melt white chocolate the same way. Peel the paper from the cakes and sit the largest on a plate. Spread a small blob of chocolate in the middle and sit the smaller cake on top. Drizzle with chocolate, sprinkle with edible gold or silver balls and leave to set. Keep in an airtight container."}
{"text": "Whizz the bread in a food processor to make crumbs. Tip into a large bowl. Put the onion, garlic and parsley in the processor and whizz until finely chopped. Add the onion mix to the breadcrumbs with all the other ingredients except the bacon. Season generously and squish everything together with your hands until combined.\nSet aside about one third of the stuffing for the turkey and divide the rest into 20 pieces. Mould each piece into a little finger-sized sausage, then wrap each one in a rasher of bacon. Put the sausages into a shallow ovenproof dish, ready for roasting (see Citrus & thyme turkey)."}
{"text": "Butter and line the base of a 1.5-litre pudding basin with greaseproof paper. In a large bowl, stir the ingredients together, adding them one at a time in the order they are listed, until everything is completely mixed.\nTip the pudding mix into the basin and cover with a circle of greaseproof paper. Place the pudding on a plate and microwave on Medium for 20-25 mins until cooked and an inserted skewer comes out clean. Leave to stand for 5 mins, then turn out and serve with brandy butter and cream."}
{"text": "Melt the marshmallows and golden syrup in a pan, then stir in Rice Krispies. Working quickly, pack the mixture into ice cream cones and push a lolly stick into the middle of each one. Chill the cones for 1 hr until completely firm. Mix icing sugar with green food colouring and enough water to make a thick icing. Dip the cones into the icing and decorate with sweets and sprinkles. Prop up on a wire cooling rack to set."}
{"text": "To make the filling put all the ingredients into a bowl and mix well together. Cover and leave in the fridge overnight.\nTo make the pastry put the flour, icing sugar and butter into a food processor and using the pulse button, process until the mixture resembles fine breadcrumbs. Add 8-9 tsp’s cold water and process until the mixture forms a dough.\nHeat the oven to 190C/170C fan/gas 5. Roll out the pastry to 0.5cm thickness and cut out rounds big enough to fully line your tart tin. Fill each tart with a heaped teaspoonful of the fruit mixture. Roll out the marzipan and using a 4cm round cutter, stamp out 18 rounds. Place one on each of the tarts. Bake in the oven for about 12–15 mins until crisp and golden brown. Sprinkle with icing or caster sugar before serving warm."}
{"text": "Take your turkey out of the fridge at least 1 hr before you cook it. Heat oven to 200 C/180 C fan/ gas 6 and beat the butter with the rosemary. Starting from the neck of the turkey, carefully push your fingers underneath the skin until you can get your whole hand between the skin and the breast meat. Trying not to tear the skin as you go, spread the butter inside the pocket, squishing some into the crevice between the thigh and breast meat.\nPut the garlic, lemon and bay leaves inside the turkey, then season liberally all over. Put the shallots in your largest flameproof roasting tin and put the turkey on top, breast-side up. Roast for 1 hr, then give it a good baste, pour in the wine and nestle the cabbage wedges in the tin (or underneath the turkey if they won’t fit). Return to the oven for another 30 mins – covered with foil if the turkey is looking too brown. The juices should run clear when you pierce the thickest part of the thigh, or a thermometer should read 75 C. If not done, carry on cooking for a further 5-10 mins.\nSet aside the turkey on a board to rest for 1 hr, transferring the garlic and bay to the roasting tin for the gravy. If you want crispy skin, don’t cover the turkey. Wrap the cabbage wedges in two parcels of foil, with a spoonful of the turkey juices, season liberally and return to the bottom of the oven to carry on cooking while the turkey rests.\nSpoon away most of the turkey fat, then put the tin on the hob over a medium heat. Mash the veg with the back of a wooden spoon to extract as much flavour as possible , then pour in the stock and reduce the gravy by half. If you want to thicken it, stir in the cornflour mixed with 1 tbsp water. Once happy with the consistency, strain and keep warm until ready to eat."}
{"text": "Preheat the grill to high and line the grill rack with foil. Halve the cheese to make two discs. Halve and core the pear, cut each half into slices and arrange in two piles on the foil. Lightly brush the pears with oil then top each pile with a cheese disc (cut side up) and grill for a few minutes until lightly golden and bubbling. Scatter with the nuts and grill for a minute or so more.\nWhisk the cranberry sauce with the oil and lemon juice and season. Arrange salad leaves on two plates. Put the pears and cheese on top. Spoon over the dressing, scatter over any stray nuts and eat right away with crusty bread while the cheese is still deliciously runny."}
{"text": "Heat the olive oil in a medium non-stick frying pan with a metal handle that can go into the oven. Add the onion and fry for 5 mins, to soften. Add the shredded sprouts, sausages and potatoes and fry over a high heat to re-heat – try not to stir too much or you’ll break up the potatoes too much. Meanwhile, beat the eggs in a large bowl with plenty of salt and pepper. Heat the grill.\nPour in the egg mixture and leave to cook undisturbed over a gentle heat for 8 mins until firmly set underneath but not set on top. Put under the grill for a few mins until the top is set and just golden (if you don’t have a pan that’s suitable, then carefully slide the tortilla out of the pan onto a baking sheet instead to grill). Eat for breakfast, brunch, lunch or dinner, sliced into wedges with tomato or brown sauce, and baked beans, if you like."}
{"text": "For the ceviche, mix the chillies, onion, salt, citrus juices and coriander with 1 tsp salt in a large bowl – this is your dressing and, once mixed with the salmon and prawns, it’s known as ‘tiger’s milk’. Mix in the salmon and prawns and leave to sit for 10 mins while you make the guacamole.\nPut the avocado flesh in a mixing bowl and mash with the back of a fork. Mix in the lime juice and 1 tsp salt, then gently stir in the spring onions, tomatoes, coriander and cumin. The guacamole can be made an hour ahead and drizzled with a little extra lime juice so it doesn’t brown.\nPut the guacamole in a serving bowl and push it over to one side of the bowl. Tip the ceviche into the bowl alongside the guacamole. Serve with the corn chips."}
{"text": "Make sure the cake has completely cooled, remove from its tin and peel off the baking parchment. Use an 8cm round cookie cutter to cut a hole through the middle of the cake, pushing down as far as you can, then cut all the way down using a small sharp knife. Carefully remove the centre by lifting the cake and pushing the smaller cake up through the middle (you may need to get someone to help you with this). Keep the smaller cake to decorate and give as a gift (see 'goes well with').\nSpread a little runny icing around the edges of a cake board or stand and invert the large cake on top.\nOn a clean surface dusted with icing sugar, roll out 100g marzipan into a long rectangular strip, about 8 x 20cm. Trim the edges, then use this piece to line the central hole of the cake. Trim away any excess. Roll out the remaining marzipan to a circle large enough to cover the cake – use a piece of kitchen string to help you check. Melt the apricot jam in a small pan with 1 tbsp water, then sieve and brush a little all over your cake. Use the marzipan to cover the cake, then trim any excess from the bottom and the centre.\nIn a large bowl, mix the royal icing sugar with enough water to make a thick, spreadable icing. Use the food colouring to dye it a rich leaf-green colour. Working quickly, spread the icing all over your cake – don’t worry about being too neat as most of the icing will be covered. Break the fondant icing into 2 lumps and dye different shades of green. Roll the icing out and cut out lots of holly shapes with cutters. Use a little runny icing as glue to stick the holly leaves all over the top of the cake. Put a big red bow at the top to finish the look."}
{"text": "Cut the brownie into 24 pieces, then use your hands (greasing them if necessary) to roll each piece into a little ball about the size of a truffle. Insert a lolly stick, or wooden coffee stirrer snapped in half, into each ball.\nPlace the chocolate into a large bowl. Bring the cream just to the boil in a small pan, then pour over the chocolate. Leave for a few mins until starting to melt, then stir until smooth. Dip the brownie lollipops into the melted chocolate until coated all over, scatter over the sprinkles to decorate, then leave for 30 mins until set. Try inserting the lolly sticks into an empty egg box to allow them to cool upright. Can be made up to 2 days in advance and stored in a cool place."}
{"text": "Use apricot jam to glaze your mini cake. Cover using marzipan and 250g of the white ready-to-roll fondant icing.\nRoll out another 50g icing and cut out snowflakes or stars using cutters – you can spray them with gold or silver edible spray to make them look really dramatic. Stick them on top of the cake with a little runny icing, place an edible gold ball between the points and add the pretty ribbon."}
{"text": "To make the syrup, place all the ingredients in a pan with 150ml water, then bring to a simmer. Cook for 10 mins until the fruit is softened, then remove the vanilla pod and blend to a smooth purée with a hand-held blender. Strain through a sieve. Allow to cool.\nExtend the pastry by rolling out on a lightly floured surface, so it is big enough to cut out a 30cm circle. Lay the pastry circle on a baking tray. Mix all the filling ingredients together. Spoon the mincemeat filling into the centre of the pastry (no more than 10cm diameter), creating a dome shape. Brush the edges of the pastry with water and gather all together to create a 'bag' effect. Press the pastry lightly together to seal well, keeping it fairly loose.\nLay a greased baking tray on top, then turn the two trays over. Remove the top tray, and lightly roll the 'bag' with a rolling pin to create a flat round pastry disc, about 18cm across. Brush the pastry with the egg white, then sprinkle with the granulated sugar. Score 3-4 lines with a sharp knife in the centre, then chill for 15-20 mins. The tart can be made ahead and chilled for up to 2 hrs. Heat oven to 200C/fan 180C/gas 6. Bake for 25-30 mins until golden brown and crispy.\nNow finish it in style: Sit the tart on a plate and decorate with sprigs of holly sifted with icing sugar. Serve warm, in slices, with a little custard, cream or ice cream and the pear and raisin syrup."}
{"text": "Heat oven to 180C/fan 160C/gas 4 and lightly oil a non-stick baking sheet. Rub together the butter and flour with your fingertips to fine breadcrumbs (or pulse in a food processor). Stir in the rest of the ingredients until you have a soft dough.\nDrop 8 tbsp or 16 heaped tsp of the dough on to the baking sheet, spacing out well. Bake for 18-20 mins until golden. Transfer to a wire rack to cool and dust with plenty of icing sugar. Pack into an airtight container or gift jars."}
{"text": "Heat oven to 200C/180C fan/gas 6. Tip the cranberries into a bowl and cover with boiling water. Meanwhile, heat the oil in a frying pan and soften the onion. Tip into a large bowl and leave to cool. Add the almonds to the same pan and toast until golden brown. Leave to cool, then roughly chop. With their peel on, whizz the clementine quarters in a food processor until puréed. Drain the cranberries.\nAdd the nuts, clementine purée, cranberries and the remaining ingredients, except the butter, to the onion, with plenty of seasoning. Stir everything together, then tip into a casserole dish. Dot with butter, cover with foil and roast in the oven for 30 mins. Uncover, then roast for a further 15 mins until crisp and golden."}
{"text": "Up to a day ahead, heat oven to 200C/fan 180C/gas 6. Slice the ciabatta into about 25 thin slices. Lay them on a couple of baking trays and brush with the oil. Toast in the oven for 10 mins until they begin to go golden, checking after 5 mins as the trays may need turning.\nUp to an hour ahead, cut the stilton into slices a little smaller than the toasts (this is easier to do if the cheese is cold from the fridge), keep covered.\nBefore serving, heat oven to 200C/fan 180C/gas 6. Spoon a little pile of beetroot onto the end of each piece of bread. Prop a slice of cheese up against each pile of beetroot and bake for 3-4 minutes until the cheese is starting to melt. You don’t want it too melty – try to catch it just as it’s starting to ooze over the edge.\nTop each cheesy canapé with a little sprig of celery leaves and serve immediately."}
{"text": "To make the pastry, rub 225g cold, diced butter into 350g plain flour, then \n in 100g golden caster sugar and a pinch of salt.\nCombine the pastry into a ball – don’t add liquid – and knead it briefly. The dough will be fairly firm, like shortbread dough. You can use the dough immediately, or chill for later.\nPreheat the oven to 200C/gas 6/fan 180C. Line 18 holes of two 12-hole patty tins, by pressing small walnut-sized balls of pastry into each hole.\nSpoon 280g mincemeat into the pies.\nTake slightly smaller balls of pastry than before and pat them out between your hands to make round lids, big enough to cover the pies. \nTop the pies with their lids, pressing the edges gently together to seal – you don’t need to seal them with milk or egg as they will stick on their own.\nBeat 1 small egg and \n the tops of the pies. Bake for 20 mins until golden. Leave to cool in the tin for 5 mins, then remove to a \n.\nTo serve, lightly dust with icing sugar. "}
{"text": "Put the dried fruit, cherries, apple, zests, apple juice, brandy and Cointreau in a large bowl. Microwave on High for 1 min, then leave to soak overnight.\nButter and line a 2lb loaf tin with a strip of non-stick baking paper. Heat oven to 180C/160C fan/gas 4. Put the kettle on to boil and have a roasting tin, plus a sheet of buttered foil, ready.\nBeat the butter and sugar together until it turns a little paler, then stir in the eggs, flour, breadcrumbs, syrup, spices, salt, soaked fruit and the nuts. Spoon into the loaf tin and smooth the top. Scrunch the foil loosely over the tin, twisting corners to tighten it around the tin’s edges. Sit it in the roasting tin, then pour in a few cms of boiling water. Carefully transfer to the oven and bake for 40 mins.\nAfter 40 mins, turn down the oven to 160C/140C fan/gas 3 and cook for another 1½ hrs, topping up the water level every now and again.\nTo reheat the pudding, either return it to a medium oven for 30 mins in its tin, or turn out onto a serving plate, cover loosely with cling film and microwave for 5 mins on Medium. For the topping, gently heat the butter, sugar and syrup together until the sugar dissolves, stir in the brandy, then tip in the nuts and fruit. Spoon over the hot pudding and dust with a little icing sugar, if you like."}
{"text": "Put the rice pops and raisins into a bowl. Put the butter, milk chocolate, peanut butter and marshmallows into a small saucepan. Place on a medium to low heat and stir until the chocolate and butter have melted but the marshmallows are just beginning to melt.\nPour onto the rice pops and stir until well coated. Line an egg cup with cling film. Press about a tablespoon of the mixture into the egg cup. Press firmly and then remove, peel off the cling film and place the pudding into a cake case, flat-side down. Repeat with the remaining mixture. Chill until firm.\nMelt the white chocolate in the microwave or in bowl over a saucepan of barely simmering water. Spoon a little chocolate over the top of each pudding. Top with icing holly leaves."}
{"text": "Heat the oven to 190C/170C fan/gas 5. Cream together the butter and sugar, then gradually beat in the egg and vanilla extract. Sift and stir in the flour and mix to a fairly soft dough. Turn onto a lightly floured surface and knead gently. Cover or wrap the dough in cling film and chill for at least two hours.\nNext roll the dough out on a lightly floured surface to around 0.5cm thick. Cut into oval shapes with a cookie cutter or by cutting round a paper template. You can make mini owl biscuits by using a smaller cutter or template.\nTransfer the biscuits to a baking tray lined with baking parchment. Put different sized biscuits on separate trays. Place the whole almonds into the dough to create the owls' eyebrows and beaks. If creating decorations for the tree, make a hole near the top of the biscuits using the end of a paintbrush. Bake in the oven for 8 - 14 minutes, depending on the size of the biscuits, until the edges turn lightly golden in colour. Once out of the oven, leave the biscuits on the baking tray to cool.\nTo decorate, set aside enough white chocolate buttons to create the owls' eyes - use giant or standard-sized buttons depending on the size of the owls - the biggest you can fit are best to give a truly owl-like expression. Melt the remainder in the microwave or in a bowl over barely simmering water.\nUsing a small tipped paintbrush, carefully paint and stick down the decorations. Stick on the white chocolate buttons, then the dark chocolate chips on top to make the eyes. Neatly paint more melted chocolate over each owl's chest, pressing on the flaked almonds. You can layer the almonds with extra white chocolate.\nIf you find some of the almond eyebrows and beaks have come loose or you are planning to hang the owls on the tree, use some of the melted chocolate to stick them in place. Leave to set.\nThread pretty string or fine ribbon into Christmas decorations so you can hang them. Dust with icing sugar and gold edible glitter if using."}
{"text": "Preheat the oven to fan 130C/ conventional 150C/gas 2. Butter and \n a deep 20cm cake tin with greaseproof paper. Stir bourbon into the sultanas and let stand while you continue with the next step, stirring occasionally.\nPut the remaining fruits and the nuts into a big bowl with the lemon juice. In another very large bowl, cream the butter with the lemon zest and sugar. Add the eggs alternately with the flour in three or four batches, then stir in the sultanas plus any liquid, and all the fruit and nut mixture.\nTransfer to the tin and smooth the top, sloping it in towards the centre so it’s 2cm below the level of the sides.\nBake for about 2½ hours – it’s done when a skewer comes out with no cake mixture sticking to it. Cool in the tin for 10 minutes, turn out and let it cool fully.\nWrap the cake tightly in cling film and foil. (It will keep in a cool spot for up to 2 months.) To add even more flavour and moistness, pierce the top with a skewer and pour over 2 tbsp bourbon every few weeks."}
{"text": "Use a sharp, serrated knife and slice your fruitcake in half, leaving a top and bottom. Mix the apricot jam and orange zest, and spread over the top of the bottom half.\nTo make the icing, beat the egg whites with the orange juice, orange blossom water and glucose in a big mixing bowl. Gradually sift in the icing sugar, beating constantly with an electric whisk until you have a fairly stiff icing that can hold a peak. Spread a little icing over the jammy layer, then put the top half of the cake back on. Generously swirl the rest of the icing thickly on top.\nUsing scissors, snip a cut on each doily from an edge to the centre, then roll up each doily like a cone and secure with a bit of sticky tape. Cut a star from some gold card, or plain card covered with gold foil, and stick to the top of one of the trees. Arrange on top of the cake to create a winter scene."}
{"text": "Soak the mixed fruit, cranberries and zests in the clementine and lemon juices for 3 days, stirring daily, keeping the bowl covered with a tea towel.\nButter a 1-litre pudding basin and line the bottom with a greaseproof paper circle. Beat together the butter and sugar until pale and fluffy. Sift in the flour, cocoa and spice, then stir in before adding the eggs. Stir in the apple, soaked fruits and liquid. Add the breadcrumbs, cherries, and chocolate chips, mixing thoroughly.\nFill the basin with the mixture, then cover with a double thickness of greaseproof paper, pleated in the middle. Cover this with a layer of foil, pleated in the middle, then tie tightly with string.\nPlace the pudding in a large saucepan on a trivet or upturned saucer so it doesn’t touch the bottom, then fill halfway up the basin with hot water. Bring to a simmer, cover the pan, then cook for 2 hrs."}
