{"text": "Put the gammon, onion, tangerine zest and star anise in a large pan. Pour over all but 100ml of the ginger beer and, if necessary, top up with water so the gammon is just covered. Bring to the boil, skim the surface to remove any fat, reduce to a simmer, then cover and cook for 3-3½ hrs or until the meat is tender. When the gammon is cooked, remove it from the pan. Reserve the cooking liquor and use to cook lentils (see 'Goes well with'). \n.\nHeat oven to 220C/200C fan/gas 7. Carefully cut the skin off the gammon, making sure to leave a layer of fat, then lightly score the fat into diamond shapes. Place in a roasting tin lined with foil. Warm the honey, mustard and reserved 100ml ginger beer in a pan and boil until it thickens. Spoon over the fat, then stud a clove into the middle of each diamond. Bake for 20-25 mins or until the glaze has caramelised. \n. Slice and eat warm or cold."}
{"text": "Heat oven to 200C/180C fan/gas 6. Heat the oil in a large roasting tin in the oven. Cut any larger potatoes in half. Cover the potatoes in cold salted water, bring up to the boil and cook for 2 mins. Drain and steam-dry in a colander for 5 mins, then shake to ruffle up the outsides.\nRemove the roasting tin – be really careful as the oil will be hot. Tip in the potatoes and garlic (if using), and use a spoon to turn them so they are all coated in the oil. Sprinkle with sea salt and pepper, and roast for 1 hr 45 mins, turning every 30 mins or so, until really crisp and golden."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the sugar, honey and butter in a large pan and gently melt together. When all the sugar has dissolved stir in the coconut, flaked almonds, sliced cherries and flour.\nLine a large baking tray with greaseproof paper (about 40 x 30cm), and roughly spread the Florentine mixture out to a thin layer – don’t worry if you have small gaps, it should melt together in the oven. Bake for 10-12 mins until a rich golden colour, then set aside to cool and firm up.\nMelt the chocolate(s) all in separate heatproof bowls over gently simmering water. Line a second large tray or board with greaseproof paper and carefully flip the cooled Florentine bake onto it. Peel off the greaseproof paper. Spread the melted chocolate over, if you’re using a few types just leave a gap between each.\nLeave aside until set, then stamp out shapes using cookie star cutters - if the cutter is digging into your hands (as the Florentine mix may be a little hard), rest a small plate or pan on top of it and push down on this instead."}
{"text": "Heat 25g butter in a saucepan, then add 1 finely chopped small onion and cook for 5 mins until softened.\nStir in 2 tbsp plain flour and cook for 2 mins, then slowly start to whisk in 200ml full-fat milk. When it has all been incorporated, gently cook for 5 mins until the sauce has thickened.\u2028\nMeanwhile, place two 200g bags spinach in a large colander. Pour over a kettle full of boiling water until the leaves have wilted (you may have to do this twice).\nPlace the spinach in a clean dishcloth, squeeze out any excess liquid, then roughly chop.\nStir into the sauce with 100ml single cream, gently heat, then finely grate over some fresh nutmeg and season well."}
{"text": "Tip the pineapple into a food processor, then pulse until finely chopped. Tip into a large, wide pan with the apples, ginger, onion, figs, spices, vinegar and 2 tsp salt. Bring to the boil, stirring, then boil for 10 mins until the apples are softened.\nAdd the sugar, then stir to dissolve. Simmer for 20-30 mins, stirring occasionally, until the chutney is thickened. Pot into warm sterilised jars, seal and label. Will keep for 6 months."}
{"text": "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.\nTo poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.\nLightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives."}
{"text": "Peel off the outer leaves from the cabbage and discard. Quarter the cabbage, removing the tough stem, then thinly slice. Arrange a layer of the cabbage on the bottom of a large saucepan, followed by some of the onions, apples, zest, mixed spice, sugar and seasoning. Continue to create layers until you have used up the ingredients.\nPour over the vinegar and cider and dot the butter on top. Bring to the boil then simmer with a lid on over low heat for 1½ hrs, until tender. The cabbage will keep for 2 days, covered, in the fridge or freeze for up to 1 month. Reheat in either a pan or in the microwave."}
{"text": "Dip the cranberries in the egg white, then roll in caster sugar a few times until well coated. Leave to set (or use glacé cherries instead, even easier and no need to frost with egg white). Brush just the top of the cake with a little jam. Roll out the marzipan to slightly larger than the top of the cake, lay on top of the cake, press down and trim flush to the edges of the cake.\nMix a dribble of water at a time into the fondant icing sugar, until it’s a smooth, stiff consistency that won’t run. Pile on the top of the cake. Push to the edges with a palette knife so it eases down the sides a little. Make a wreath from the sage and bay, then add a few of the frosted cranberries (or glacé cherries if using instead)."}
{"text": "Mix the raisins, cranberries and mixed peel in a bowl, pour over the rum, then leave to soak while you make the dough. Tip the flour into a large bowl and stir in ½ tsp salt, the yeast, sugar, nutmeg and lemon zest. Rub the butter in until the mix is like fine crumbs. Warm the milk to hand-hot, then mix into the egg. Pour the milk into the flour mix, then stir with a round-bladed knife to make a soft dough, adding a drop more milk if needed to mop up any dry crumbs in the bottom of the bowl. Gather the dough into a ball, then knead for 3-4 mins on a lightly floured surface. Put the dough into a lightly oiled bowl, cover with cling film and leave until the dough has risen to double the size (about 45 mins-1 hr).\nKnead the dough 2 or 3 times, then roll out to a rectangle about 37cm x 17cm. Stir the chopped pistachios into the soaked fruits, then spread one-third of the fruit mix down the centre of the dough, leaving all the edges uncovered. Fold each side into the centre to overlap slightly. Press the edges with the rolling pin to seal, turn the dough, then repeat the rolling out and spreading of the fruit twice more. Roll out to a final rectangle that is 55cm x 16cm. Roll the marzipan into a sausage shape, so it’s slightly shorter than the length of the dough. Place it down the centre. Roll the dough over the marzipan, then turn the dough over so the join is underneath. Lift onto a buttered baking sheet, then curl the dough round a buttered 12cm round cake tin (see tip, below), brushing the ends with a little beaten egg and pinching them well together to seal.\nCover and leave to rise for 30-45 mins or until puffy and doubled in size. Heat oven to 190C/fan 170C/ gas 5. When the dough has doubled, brush with beaten egg and bake for about 25 mins until golden. Cool on the baking sheet briefly, then transfer to a wire rack.\nMake up the icing. Stir 2-3 tsp water into the fondant icing sugar and, when the stollen has cooled, drizzle the icing over. Scatter over the extra cranberries and pistachios and decorate with holly."}
{"text": "Roll the pastry out to about the thickness of a 50p piece on to a floured surface, and cut out 10cm circles, then continue to re-roll and cut out until you have about 18 circles.\nPlace 1 tsp of mincemeat in the centre of each circle, brush the edges with egg white, then gather together tightly to completely encase the mincemeat.\nFlip the pies over so the sealed edges are underneath, then squash them with your hand so you have a small puck-shaped pie.\nCut two small slits in the top of each pie, brush generously with egg white and scatter with sugar. The pies can now be frozen for up to 2 months. Heat oven to 200C/fan 180C/gas 6 and bake for 15 mins from raw or 25-30 mins from frozen."}
{"text": "Put all the ingredients into a pan and heat until steaming but not boiling. Ladle into mugs or glasses to serve, while you keep the rest warm on a low heat."}
{"text": "With your hands, roll the dough on a lightly floured surface into a sausage shape about 25cm/9in long and 5cm/2½in in diameter. Wrap the roll and chill for at least 1 hour. (The roll can be frozen for up to 6 weeks. To use, remove from the freezer and allow to thaw for one hour at room temperature so that the dough is soft enough to be sliced into biscuits.)\nPreheat the oven to 180C/gas 4/fan 160C and lightly grease 2 large baking sheets. Using a sharp knife, cut the dough into slices, each a generous 5mm/¼in thick, then arrange them on the greased baking sheets, spacing the biscuits slightly apart so they have a bit of room to spread as they cook.\nBake for 20 minutes until the biscuits are just turning pale golden around the edges, then transfer to a wire rack to cool. Dust generously with icing sugar. The biscuits will keep fresh for up to one week stored in an airtight tin."}
{"text": "Mix the mango, red chilli, red onion and a handful coriander leaves, then mix with the lime juice and sweet chilli sauce. Season.\nDivide between 32 mini croustade cups (in the supermarket bakery area) and serve within 1 hr so they’ll be firm."}
{"text": "Heat oven to 140C/120C fan/gas 1. Line baking sheets with baking parchment and draw 3 rectangles, roughly 25cm x 12cm. Whisk whites to stiff. Gradually whisk in sugar to stiff again, then whisk in the cornflour and vinegar. Fold in the desiccated coconut and pipe, or spread, the meringue mix into 3 even rectangles. Scatter flaked coconut over one of the meringues and bake for 1 hr, then turn off oven and leave in there with the door shut for 1 hr. Leave to cool.\nWhisk cream, icing sugar and lime zest and juice to a thick consistency. Spread half over one meringue base (not the one with flaked coconut on top – save that for the top), and scatter over half the raspberries. Sit second meringue base on top, spread with remaining cream and scatter with remaining raspberries. Top with coconut-covered meringue and serve."}
{"text": "Heat oven to 180C/160C fan/gas 4 and lightly grease a 20 x 30cm baking dish with a little of the butter.\nFirst, make the ponche de crème. In a large bowl, using an electric hand whisk, beat the eggs and lime zest for 1-2 mins until light and frothy. Gradually beat in the evaporated milk and rum, then add the vanilla, nutmeg and bitters, and mix well. Stir in the condensed milk and set aside.\nButter the brioche slices on one side and cut each in half diagonally. Layer half the slices across the base of the baking dish, butter-side down. Pour over half the ponche de crème. Scatter over the coconut flakes, raisins and half the nutmeg, and leave for 15 mins.\nSprinkle over the pecans and layer the remaining slices of brioche, butter-side up, on top. Pour over the remaining ponche de crème, ensuring it soaks all the bread. Sprinkle over the remaining nutmeg and the demerara sugar.\nPut the baking dish into a roasting tin and pour boiling water into the tin to come halfway up the outside of the baking dish. Carefully put the tin in the oven and bake for 40-45 mins until the custard is set and the pudding is golden brown. Scatter over pecans and coconut flakes and serve with ice cream or cream."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the parsnips on a baking tray, drizzle with the olive oil, season well and roast for 30 mins or until tender and nicely caramelised. Reduce the temperature to 180C/160C fan/gas 4.\nIn a large bowl, whisk together the cream, eggs, half the butter, half the cheese and half the thyme. Season well, then add the truffle oil, brioche and parsnips, and leave for 10 mins.\nLightly oil a medium baking dish and tip in the soaked brioche mixture. Heat the remaining butter in a shallow pan and cook until the butter turns brown. Add the hazelnuts and remaining thyme and cook for 2 mins before spooning over the top of the pudding. Cover the dish with foil, and cook in the oven for around 50 mins until puffed up and starting to caramelise. Remove the foil, sprinkle with the remaining cheese and place back in the oven for 15 mins to brown fully. Scatter over the black truffle, if using, add an extra drizzle of truffle oil, the extra thyme and serve."}
{"text": "Peel the potatoes, then cut into halves, or quarters if large. Bring a large pan of water to the boil, add a little salt, then tip the potatoes into the pan. Bring back to the boil and cook for 7 mins. Drain really well, then return to the pan and sprinkle over the flour. Place a lid on top of the pan, then pick up the pan using oven gloves or a tea towel and give it a few really hard shakes so the potatoes get bashed around (this will make them nice and crisp).\nHeat oven to 190C/fan 170C/gas 5. Spoon the goose fat or sunflower oil onto a large, lipped baking tray and leave to heat on the top shelf of the oven for 5 mins. Carefully pull out the tray, make sure its surface is evenly coated with the fat, then tip on the potatoes. Roast for 20 mins, then turn up the oven to 220C/fan 200C/gas 7 and roast for another 30 mins, turning the potatoes once, until golden and crisp. Sprinkle with a little salt and serve straight away."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Grease 2 large non-stick baking sheets with oil. Whizz the flour, ginger, zest and butter with 1⁄2 tsp salt to fine crumbs in a food processor. Pulse in the sugar and milk, then turn out and knead briefly on a floured surface until smooth. Wrap in cling film, then chill for about 30 mins.\nFlour the work surface again, then roll out the dough to the thickness of a £1 coin. Use 7cm cutters to cut out shapes, then use 4cm cutters to cut out the middles. Re-roll leftover pieces. Make a hole in the top of each biscuit, then carefully lift onto the baking sheets.\nCrush the sweets in their wrappers with a rolling pin, then put the pieces into the middles of the biscuits – the sweets should be level with the top of the dough. Bake for 15-20 mins or until the biscuits are golden brown and the middles have melted.\nLeave to harden, then transfer to a rack to cool. Thread with ribbon, then dust with icing sugar. Will keep for a month, but best eaten within 3 days."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Heat the oil in a frying pan, then soften the leeks for 5 mins. Line the base of a 28 x 18cm baking tin with greaseproof paper.\nMix the mince, thyme, two-thirds of the breadcrumbs, leeks and egg together with a little seasoning, then tip into the tin. Press the mixture firmly into the tin, then ruffle the surface with a fork. Mix the remaining breadcrumbs and bacon together and scatter over the top. Cook for 15 mins, then finish under the grill until golden and crisp on top. Serve with boiled potatoes and carrots."}
{"text": "Wash the dried fruit thoroughly in a colander under the cold tap (you may find it easier to do this in batches) - whatever it says on the packet, washing the fruit is something I've (Ruth Watson) always done. Tip the fruit on to clean tea towels and dry by patting in the cloths.\nPut the dried fruit in a very large bowl with the apples, suet, almonds, sugars and spices. Grate the zest of the lemon into the bowl, then squeeze in the juice. Tip in the peel and the alcohol.\nMix all the ingredients very thoroughly - it's easiest to do this with your (very clean) hands.\nCover and leave to stand for 24 hours, asking the family to stop and give it a good stir with a spoon when they pass by.\nPack the mincemeat into sterilised or dishwasher-clean jars (Kilner jars are ideal) and top with greaseproof paper jam covers. Seal the jars tightly and store in a cool place. The mincemeat will last from one year to the next, but's best used within 6 months."}
{"text": "Blanch the Brussels sprouts in a pan of boiling salted water for 3 mins, then drain and tip into a bowl of iced water to cool quickly. Drain well again and set aside until nearly ready to serve. Sauté the pancetta in the hot goose fat until crisp. Toss in the sprouts and stir-fry for 2-3 mins, adding the sage to serve."}
{"text": "Heat a knob of butter in a saucepan and when lightly foaming gently cook 1 chopped onion until softened, but not coloured.\nTip in 1 peeled and diced medium potato and stir to coat in butter, then pour over 1l ham or pork stock. Simmer until softened.\nTip in 500g frozen petit pois and bring back to the boil. Cook for a couple of mins.\nRemove from the heat and \n until smooth. Stir in 300g diced ham and serve."}
{"text": "Beat the crème fraîche with the vodka and a little seasoning until it holds its shape, then stir in the horseradish. Chill in the fridge.\nLay the slices of salmon over plates, then top with the beetroot and a spoonful of the crème fraîche. Top with the salmon caviar, if using, then scatter with the dill. Grind over some black pepper and serve."}
{"text": "Tip the porcini into a bowl and pour over 250ml boiling water. Leave for 20 mins to soften and plump up, scoop out the mushrooms with a slotted spoon and finely chop, then strain the liquid (leaving behind the last drop as it might contain grit) and set aside.\nSet aside about half the wild mushrooms, choosing those with the best shape, then finely chop the remainder. Chop 1 shallot very finely. Heat a large frying pan, add the butter and 1 tbsp olive oil, then cook the chopped shallot and garlic over a medium heat for 3-5 mins until softened. Tip in the chopped porcini and stir around the pan for 2 mins. Add the chopped mushrooms to the frying pan along with the thyme sprigs. Cook for 10 mins until lightly browned and any liquid has evaporated. Leave to cool.\nPlace the beef on a board. Take a sharp knife and make a slice lengthways along the fillet, about one-third of the way down, so it folds out like a book. One side of the beef should now be thicker than the other. Make another lengthways slice along the thick half of beef so the beef unfolds to a flat, evenly thick piece of meat, about the size of an A4 page. Spread the mushroom mixture all over the beef and season really well. Tightly roll up the beef to reform into a log and tie about 8 pieces of string around to secure well.\nHeat oven to 200C/180C fan/gas 6. Place a large heavy-based roasting tin over a high heat on the hob (ensure that it will fit in your oven beforehand). Heat some more butter and the other 1 tbsp oil in the tin, then fry the beef, turning every couple of mins, until well browned all over. This will take about 10 mins.\nTip the whole shallots into the tin around the beef and toss them in the oil. Roast for 20-25 mins for rare, 35 mins for medium and 45 mins for well done. If you have a thick piece of meat, it may take a little longer. Ten mins before the end of cooking, stir the whole mushrooms around the pan, coating well in the oil and juices, then leave to roast alongside the meat and shallots. Leave the meat to rest on a board for 10-15 mins and keep the vegetables warm in a serving dish while you make the sauce.\nPlace the tin back on the hob. Stir in the flour, mixing well into any oil in the pan, then very carefully pour over the brandy, making sure you don’t pour straight from the bottle. Use a small whisk to stir in the brandy, scraping up all the lovely browned bits from the tin. When the brandy has nearly boiled away, pour over the strained mushroom liquid and beef stock. Cook for about 5 mins until the liquid just coats the back of a spoon, then stir in the mustard and crème fraîche. Season, sprinkle with parsley and pour into a gravy boat. Cut the beef into thick slices and serve with the vegetables, gravy and some Parmesan puffs, if you like."}
{"text": "Put the butter, sugar, chocolate, brandy, vanilla and dried fruits into a large saucepan. Heat gently, stirring occasionally until everything has melted together. Remove from the heat.\nHeat oven to 150C/130C fan/gas 2. Line a deep cake tin, 20cm round or 18cm square, with a double layer of baking parchment. Wrap a few layers of newspaper around the outside and secure with string.\nMix the flour, almonds, cocoa and spice together. Stir the eggs into the slightly cooled chocolate mixture in the saucepan, followed by the flour mixture. Scrape into your prepared tin and bake for 1½ hrs- 1 hr 45 mins or until a skewer poked in comes out clean. Cool in the tin, then decorate (see 'Goes well with', right, for decoration ideas). \n."}
{"text": "Place the butter and 140g sugar in a \n and whizz until smooth.\nTip in both the flours and a pinch of salt, then whizz until mixture comes together.\nUsing your hands, roughly spread the mixture out in a 20 x 30 x 4cm baking tray. Cover with cling film and smooth over until there are no wrinkles. Place in the fridge, uncooked, for at least 30 mins and up to 2 days.\nHeat oven to 180C/160C fan/gas 4. Remove cling film, then lightly mark the shortbread all over with a fork. \nSprinkle with the remaining sugar, then bake for 20-25 mins. \nLeave to cool in the tin, then cut into 24 thin slices. Shortbread will keep in an airtight container for up to 1 week."}
{"text": "Mix the cream with 1 tbsp Baileys, and set aside. Divide the brownie pieces between 6 glasses, then drizzle each with 1 tbsp Baileys. Top with the sliced bananas, custard and Baileys cream, dividing equally, then drizzle with toffee sauce and finish with grated chocolate. Can be made a few hours ahead."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Stir the custard and almonds together. Unroll the pastry, then cut out circles using a 7cm plain round cutter. Gather up the pastry trimmings, re-roll, then cut out more circles – you should get 16-18. Use to line a couple of bun tins.\nSpoon a heaped tsp of the custard mix into each tart case, then top with a scant tsp of mincemeat. Scatter over some flaked almonds, then bake for about 10 mins until puffy and golden. Cool briefly in the tin, then dust with icing sugar and serve slightly warm."}
{"text": "Line the base of a 1kg loaf tin (19cm x 12cm x 9cm deep) with baking parchment. For the semi-freddo, mash the raspberries and half the sugar in a bowl with a fork. Whisk the cream, the rest of the sugar and the limoncello to soft peaks. Beat the crème fraîche briefly so it is in soft peaks like the cream. Gently fold the cream mixture and crème fraîche together.\nPour the mashed raspberries into the cream and give a few stirs only - just enough to swirl it through the creamy mix. Pour the mixture into the loaf tin and smooth the top.\nFor the coulis, mash the raspberries, sugar and limoncello with a fork, then push through a sieve.\nOpen-freeze (see 'Try' below) the semi-freddo then cover with cling film and foil and freeze for up to 1 month. Pour the sieved coulis into a rigid container and freeze for up to 1 month.\nTo serve, thaw the coulis in the fridge overnight. Thaw the semi-freddo in the fridge for 1 hr. Remove it from the tin and peel off the lining paper. Drizzle with a little of the coulis and scatter some raspberries over the top. Serve in slices with the rest of the coulis."}
{"text": "Tip the flour, sugar and a good pinch of salt into a large bowl. Add the butter and rub into the flour with your fingertips. Stir in the yeast.\nWarm the milk to hand hot. Make a well in the centre of the flour and add the milk and egg. Mix everything together to make a soft dough. Tip onto a lightly floured surface and knead for 5 mins until the dough is smooth, elastic and no longer sticky. Put the dough back in the bowl, cover with a tea towel and leave to rise for about 1 hr or until doubled in size.\nKnead the dough again briefly, then divide into 12 equal pieces. Roll out each piece to a 9cm round and put 1 tsp mincemeat in the centre. Gather up the edges of the dough to enclose the filling, pinching it well to seal. Shape into a ball between your hands and put on a baking sheet lined with baking paper, sealed side down, allowing space for the dough to rise. Cover with a tea towel and leave for about 30 mins. Heat the oven to 190C/170C fan/gas 5.\nBake the doughnuts for 10-12 mins until risen and golden. Mix the icing sugar with 2 tbsp cold water in a shallow bowl. Mix the caster sugar and cinnamon in another bowl. Roll each doughnut first in the sugar syrup, then into the caster sugar to coat all over. Leave to cool."}
{"text": "Mix the butter, orange zest and hazelnuts in a small bowl with some freshly ground black pepper. (This can be done 2-3 days ahead and kept covered in the fridge.)\nPut the sprouts into a pan of boiling salted water, bring back to the boil, cover and cook for 4-5 minutes. Pour in the peas and cook for a further 2 minutes. The sprouts should be only just cooked. Drain.\nPut the sprouts and peas back into the pan and toss with the flavoured butter so it melts in. Season with salt and pepper and tip into a warmed serving dish."}
{"text": "Tip the sugar, butter, dried fruit, whole cherries, ginger, orange zest and juice into a large pan. Pour over the rum, brandy or juice, then put on the heat and slowly bring to the boil, stirring frequently to melt the butter. Reduce the heat and bubble gently, uncovered for 10 mins, stirring every now and again to make sure the mixture doesn’t catch on the bottom of the pan. Set aside for 30 mins to cool.\nStir the nuts, eggs and ground almonds into the fruit, then sift in the flour, baking powder and spices. Stir everything together gently but thoroughly. Your batter is ready.\nHeat oven to 150C/130C fan/gas 2. Butter and line the base and sides of a 18cm square tin with baking paper. Spoon the cake mix into the tin and level the top with a spoon dipped into boiling water. Bake for 45 mins, then turn oven down to 140C/120C fan/gas 1 and cook for 1 hr more or until a skewer inserted comes out clean. Cool on a wire rack. Will keep well-wrapped in foil for 2 months or freeze for 1 year.\nCarefully cut the square cake in half and trim the edges so that you see the texture of the cake on all sides. Roll out each piece of marzipan on a surface dusted with icing sugar until the size of the top of each cake.\nGenerously brush the top of the cakes with jam, place jam-side down on top of the marzipan, then trim away the excess marzipan with a sharp knife.\nMake up the fondant icing to a spreading consistency, then spread on top of the cakes so that it slightly runs over the edges. Top with cherries and holly, then leave to set. Will keep in a plastic container in a cool place for 4-7 days."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Roll out the pastry and line a shallow 28cm flan tin. Trim off the edges, then line with baking paper and beans. Put on a baking sheet, bake for 10 mins. Remove the paper and beans, then bake for 5 mins more.\nCook the potatoes in boiling salted water for 6-8 mins until tender, then drain. Beat together the cream, eggs, dill, lime zest, salt and pepper. Scatter half the potatoes over the bottom of the pastry case, then put half the salmon strips in the gaps. Pour over half the egg mix, then arrange the remaining potatoes over the salmon pieces and put the remaining salmon in the gaps between. Pour over the rest of the egg mix.\nBake for 25 mins until the top is lightly coloured and firm to the touch. Cool for 10 mins before removing from the tin, then serve warm or at room temperature sprinkled with extra dill."}
{"text": "Preheat the oven to 180C/gas 4/fan 160C and lightly grease and line the base and sides of a deep 22-23cm round loose-based cake tin with Bake-o-Glide or baking parchment (see overleaf). Beat the butter, sugar, eggs, flour, ground almonds and spices until thoroughly mixed and creamy, preferably with an electric beater or in a food mixer.\nMeasure off 100g/4oz of the cake mixture, put in a bowl and set aside. Fold the fruit and rum into the remaining mixture, then gently stir in the marzipan. Spoon this mixture into the prepared cake tin and flatten with a spatula to make a smooth even surface, then make a slight dip in the centre of the cake. This simple trick will give the finished cake a nice flat top. Bake for 11⁄4 hours.\nWhile the cake is in the oven, make the fruit and nut topping. Mix all the nuts, cherries and syrup into the remaining cake mixture (see tip overleaf). Spoon the mixture on top of the part-cooked cake (once it has had its 11⁄4 hours), evenly distributing the mixture of nuts and cherries across the surface of the cake. Loosely cover the top of the tin with foil.\nReturn to the oven for 40 minutes more, then take off the foil and bake for another 10-15 minutes, so the nuts can turn golden. Keep an eye on them, so they don’t get too dark. To test the cake mixture is cooked, insert a fine skewer into the cake – if it comes out clean then it's ready. Cool in the tin then turn out, keeping the lining on, and wrap with foil. (The cake will keep for up to 2 weeks or can be frozen for up to 2 months.)\nTo serve, remove the cake from the foil and strip away the lining. Place on a board or serving plate and tie with a decorative ribbon."}
{"text": "Heat oven to 190C/170C fan/gas 5. Boil the potatoes for 3 mins to soften a little, then drain. When cool enough to handle, slice into 5mm pieces. Cook the onion in the butter in a pan until softened, about 5 mins, then pour over the wine, milk and cream and heat through. Place the potato slices into a large bowl, pour over the cream mixture, sage leaves and half the cheese. Carefully stir until the potato slices are coated.\nGrease a large baking dish (about 20 x 30cm) with a little butter, then tip the potatoes in. Smooth over the top, scatter over the remaining cheese and season with black pepper. Cover with foil and cook for 30 mins, then uncover and cook 30-40 mins more until a fork slides in easily and the top is golden brown."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line 2 muffin tins with 16 paper muffin cases. Whisk together 175ml boiling water with the cocoa powder in a medium-sized bowl until smooth. Allow the mixture to cool until it reaches room temperature (put it in the freezer to speed it up), then whisk it with the eggs and vanilla.\nIn an electric mixer, combine the flour, salt, bicarbonate of soda and sugar. Mix on a low speed for 30 secs, then add one-third of the cocoa liquid and softened butter. Keep mixing on a low speed, then turn up to medium high and beat for 1 min. Add the remaining liquid in 3 batches, beating each one for 30 secs. Scrape the sides and bottom of the bowl with a spatula and mix one more time. Fill the cupcake liners three-quarters full and bake for 20 mins, then remove and let them cool in the tin.\nTo make the frosting, beat the butter and cream cheese for 2-3 mins until creamy, then add the vanilla. While still mixing, pour in the sugar in 4 batches, beating each time to fully combine. Beat for a further min, then chill for 2 hrs.\nSwirl the frosting over the cooled cupcakes and decorate with silver balls or whatever you like."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Put the duck breasts and skin in a shallow dish, then place in the hot oven for 20 mins. Discard the shrivelled bit of skin that remains, then pour the duck fat into a bowl to cool. Reserve 6 bacon rashers, then roughly chop the remainder. Roughly chop the cooked duck meat.\nIn a food processor, blend the chopped bacon, pork and duck in batches to a coarse texture, then tip into a large bowl. Tear up the bread and soak in the milk for 5 mins. Squeeze out the bread and put in the food processor with the shallots, garlic and livers. Process to a coarse texture, then add to the bowl, mixing well.\nGrind the peppercorns, coriander seeds and cloves to a coarse powder using a pestle and mortar. Stir in the cinnamon. Add the spices to the meat along with 4 tbsp reserved duck fat, the Cognac, eggs and 2 tsp salt. Mix together very thoroughly – the best way is to use your hands.\nPress half the mixture into a 1.5-litre baking dish or similar. Scatter over the pistachios and cranberries, then cover with the remaining meat mixture. Arrange the reserved bacon rashers over the top, tucking in the ends. Cover the dish tightly with foil, then put in a roasting tin. Pour boiling water into the tin to come halfway up the sides of the dish.\nBake for 2 hrs, remove foil, then bake for 15 mins more to brown the top. Cool completely, then wrap in fresh foil and chill. For the best flavour, let the terrine chill and mature for at least 2 days before eating.\nTO FREEZE Make the terrine as stated, cool and then freeze. Defrost in the fridge before serving."}
{"text": "Boil down the chicken stock, red wine, port and balsamic vinegar by two-thirds. Meanwhile, cover the dates with boiling water, leave for 5 mins and then drain. Strain the reduced stock and return to the pan with the soaked dates. Simmer sauce for 3-5 mins, then check seasoning and keep warm."}
{"text": "Line a 1.2-litre pudding bowl with a double layer of cling film, leaving plenty overhanging, and make a space for the bowl in the freezer. Put the biscuits in a food processor and blitz until they resemble fine crumbs. Add the butter and 2 tbsp caramel, and blend until well mixed. Save about 3 tbsp for the top and tip the rest into the lined pudding bowl. Use the back of a spoon to press evenly over the base and up the sides of the bowl. Freeze for 30 mins.\nRemove the chocolate ice cream from the freezer and allow it to soften at room temperature for 10 mins. Remove the pudding bowl from the freezer too (the biscuits should be firm by now.) Spoon the ice cream into the biscuit- lined bowl, packing it into the base. Spoon over the remaining caramel, spreading it to the biscuit walls. Return to the freezer for 30 mins.\nRemove the caramel ice cream and allow it to soften for 10 mins. Meanwhile, tip 75g Maltesers into a bowl and lighty crush with the end of a rolling pin, leaving some chunky bits. Add the ice cream to the bowl and stir through the Malteser pieces – work quickly so the ice cream doesn’t melt too much. Remove the pudding bowl from the freezer and tip in the Malteser ice cream, spreading it to completely fill the bowl, then level the top. Scatter with the remaining biscuit crumbs. Return to the freezer for at least 4 hrs (or for up to 2 weeks).\nPut the cream in a pan and heat until steaming hot but not boiling. Put the chocolate in a large bowl and pour over the cream. Leave to stand for 1-2 mins, then stir to make a smooth ganache. Set aside to cool until the sauce thickens to a spreadable consistency (you can speed this up by putting it in the fridge, but remember to stir it every 5-10 mins or it will set around the edges).\nRemove the pudding bowl from the freezer. Turn it onto a plate and remove the bowl and cling film. Spread half the chocolate ganache all over the pudding and, as quickly as you can, stick the remaining Maltesers all over the surface – this is easiest if you start around the bottom and work your way up in layers. The chocolate ganache will start to set, so use a little more from the bowl to make the Maltesers stick. Once covered, return to the freezer for at least a further 4 hrs (or for up to 3 days), removing it 10 mins before serving. Top with a dusting of icing sugar and a sprig of holly, if you like."}
{"text": "Put the chicken in a large pot. Halve 1 onion, 1 celery stick and 1 carrot. Add to the pot with the herbs, peppercorns and a sprinkling of salt. Add water to come halfway up the chicken, bring to the boil, then cover tightly and simmer for 1½ hrs. Cool slightly, remove the chicken to a dish, then strain the stock into a bowl.\nWhen the chicken is cool enough to handle, strip the meat from the bones and tear into pieces with your hands.\nChop the remaining onion, and cut the celery and carrots into thick slices. Heat the butter in the same pot, add the onion and lardons, then gently fry for 5 mins until just starting to brown. Add the remaining veg, then fry for 2 mins. Stir in the flour, then cook for 1 min. Measure 900ml stock (if you don’t have enough, make it up with water), then gradually add to the pan, stirring. Cover, then simmer for 20-25 mins until vegetables are tender.\nReturn the chicken to the pan with the mustard and crème fraîche, then return to a simmer, stirring gently. Season and sprinkle with parsley."}
{"text": "Simmer the milk, butter, onion, cloves, peppercorns, garlic and herbs in a pan for 20 mins. Strain and return the liquid to the pan. Add the breadcrumbs and simmer for 3-4 mins. Stir in the cream or mascarpone. Add nutmeg, season and serve. Can be made up to 3 days in advance and heated up on the hob or microwave on Medium for 3 mins."}
{"text": "Put the syrup, sugar and milk into a saucepan, then bring to a simmer to dissolve. Leave to cool almost completely while you get on with everything else. Heat oven to 180C/fan 160C/gas 4.\nPut the butter, flour, bicarb, ground ginger and cinnamon into a food processor, then pulse until it forms fine crumbs. Generously butter a 1.4-litre pudding basin and sprinkle 1 tsp sugar into the bottom. Cut 3 of the ginger balls in half and put 5 halves, rounded-side down, into the bottom, like the points of a star. Cut one cheek from a pear, then slice through about 10 times, without cutting through the stalk end. Put this into the bottom of the bowl amongst the ginger, then press gently so that the pear fans out. Core, then thinly slice the remaining pear. Finely chop the rest of the ginger.\nTip the cooled syrup mix and egg into a food processor, then quickly whizz with the dry ingredients to a batter. Take out the blade, then stir in the chopped ginger and sliced pear. Scrape the mix into the basin, then bake for 1 hr 20 mins until risen and dark golden, and a skewer comes out clean. Whatever you do, don’t open the oven before 45 mins is up.\nTo finish, gently melt the syrup ingredients in a pan together until the sugar dissolves, then boil briefly. Turn the pudding out of its basin just before serving, spoon over the syrup and serve with custard."}
{"text": "Heat oven to 200C/fan 180C/gas 6 and roast the butternut squash with 1 tbsp oil for 25-30 mins until tender, then set aside.\nMeanwhile, heat remaining oil in a large pan and cook the onions and garlic for 10 mins until soft. Remove two-thirds, then add the mushrooms, chestnuts and pearl barley to the pan. Sizzle for a few mins, pour in the stock, then bring to the boil. Bubble fiercely for 30 mins until the barley is tender and sticky and there is no liquid left. Stir in the soy sauce, season and set aside.\nWhile the barley layer is cooking, make the other layers. Stir the zest, ricotta, soft cheese and a good amount of seasoning into the reserved onions until smooth. Take a third of the mixture and gently fold with the sage and roasted squash. For the final layer, boil the kettle, then tip half the spinach into a large colander. Pour over the boiling water to wilt, then repeat with the rest of the spinach. Tip the spinach onto a clean tea towel and squeeze out all the moisture you can. Roughly chop, then mix into the remaining ricotta mixture with the parsley.\nTo make the pie, brush a 900g loaf tin with a little oil. Make 3 long triplelayer strips of foil and lay these across the width of the tin to help you lift out the pie to serve. Tip flour and 3 tsp salt into the largest bowl you have and gently melt the butter, shortening and milk with 200ml water in a pan. Once melted, increase heat until bubbling fiercely, tip onto the flour, then quickly beat with a wooden spoon until combined. Don’t worry if some powdery bits remain. Once cool enough to handle, knead until it comes together, then tip onto your work surface. Set aside a third and roll the rest into a large rectangle – big enough to line the tin with a little overhanging.\nEase into the tin, pressing evenly into the corners and sides – you can be rough with it. Spoon in the spinach layer, smooth the surface, then repeat with the barley and finally the squash layer. Dome the squash mix slightly to give a rounded top. Roll out the remaining pastry to fit, brush the edges with some egg, then press the lid over the top. Trim the excess and crimp or pinch to seal, then decorate with pastry trimmings cut into leaves (add bay leaves, if using, when the pie has 30 mins left in the oven). Can be covered and chilled overnight.\nHeat oven to 200C/fan 180C/gas 6 and put a large baking sheet inside. Brush the surface of the pie with egg, lift onto the heated baking tray and bake for 30 mins, then reduce the heat to 180C/fan 160C/gas 4 and bake for a further 1 hr 30 mins until the pastry is golden brown and feels hard. Stand for 15-20 mins while you get the rest of the meal ready – the pie will stay warm. Gently tip out the pie, or use the foil strips to lift out carefully. Carry to the table and slice thickly to serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. Rinse the turkey then pat dry with kitchen paper. Weigh it to calculate the cooking time, allowing 20 mins per kg, plus 70 mins (or 90 mins when roasting a crown over 4kg). Sit the turkey on a board, very lightly rub all over with olive oil and season with pepper. Lay the pancetta or streaky bacon over the top of the turkey, slightly overlapping to cover it. Tuck the slices under the bird to secure at the bottom. Insert small rosemary sprigs haphazardly between the slices. Season with pepper. Tie the crown across in 2-3 places with butcher’s string, to hold the shape together. Put the onion wedges in the middle of a large roasting tin and sit the crown on top. Cover the turkey with a loose tent of foil, then roast following your calculated time.\nMake the stuffing. Heat 3 tbsp of the oil in a large frying pan. Tip in the onions and garlic, and fry for 5-8 mins until softened and starting to turn golden. Push the onions to one side of the pan, then add the pine nuts and continue to fry for 1 min more, stirring the nuts until golden. Remove from the heat and cool slightly. Stir in the remaining oil, all but a small handful of the Parmesan and the remaining stuffing ingredients. Season with salt and pepper. Loosely spoon stuffing mixture (don’t pack it down) into an oiled ovenproof dish, drizzle with a little extra olive oil, sprinkle with remaining Parmesan, then lay a sheet of baking parchment on top. Set aside. Can be made 1 day ahead and chilled.\nThirty mins before the end of the cooking time, remove the turkey and increase oven to 200C/180C fan/gas 6. If you are roasting potatoes put them in now. Roast the garlic. Remove the foil, place the garlic halves and lemon wedges around the turkey, then baste them and the turkey with the cooking juices. Return the tin to the oven and continue to roast for the final 30 mins. To test if cooked, pierce the fattest part of the crown with a skewer – the juices should run clear, not pink. If they are pink, continue to roast, checking at 10 min intervals.\nRemove the turkey, garlic and lemon from the oven, transfer to a warm serving platter and rest, covered loosely with foil, for 30 mins before carving. Meanwhile, increase oven to 220C/200C fan/gas 7. Put the stuffing in the oven and bake for 20 mins, then remove the paper and bake for a further 5 mins until the stuffing is golden.\nMake the gravy. Pour off any excess fat from the roasting tin but leave the juices and onions. Stir all the sticky bits from the bottom of the tin into the juices. Set tin over a medium heat, add the flour and cook, stirring continuously, for 2 mins. Pour in the Marsala and simmer for 2 mins. Pour in the stock, bring to the boil, then simmer for 5-10 mins or until reduced to your liking. Season with pepper if needed. Strain the gravy into a pan, warm through, then pour into a jug. Serve the turkey garnished with rosemary sprigs, surrounded with the roasted garlic and lemon, and accompanied by the gravy and stuffing."}
{"text": "Soak the raisins and currants in the brandy and lemon juice for 1 hr until plumped up, then drain and set the brandy aside. Mix all the ingredients together in the order given, then pour in the brandy when everything else is well mixed. Spoon and press into sterilised jars, to exclude any air (the easiest way to sterilise jars is to run them through a dishwasher on its hottest setting). Cover and leave for at least a fortnight. Will keep in the fridge for up to 6 months."}
{"text": "Set aside two handfuls of small cauliflower florets. Heat the butter in a large pan, add the shallots and gently fry until soft but not brown. Add the cauliflower, potatoes, milk and stock. Season and bring to the boil, then reduce the heat, cover and gently simmer for 15-20 mins until the vegetables are tender. Purée until smooth either with a stick blender or in a food processor (you will need to do this in batches). Return to the pan and add the cream. Warm through and add more seasoning if necessary.\nHeat the oil in a pan, add the reserved cauliflower florets and fry until brown and starting to soften. Add a splash of water, cover and cook for a further 1-2 mins until just tender. Tip the cauliflower into a bowl. Add the chorizo to the pan and fry quickly on each side until crisp. Drain on kitchen paper.\nServe the soup in bowls with a small pile of crisp cauliflower in the centre, topped with a couple of slices of chorizo and scattered with coriander."}
{"text": "Heat oven to 180C/160C fan/gas 4. Beat half the sugar and all the butter until pale, then add whole eggs, one by one, beating in well each time. Stir in the zest and a squeeze of lemon juice, then fold in flour. Check the batter’s consistency; it should softly drop off the end of a spoon. Add more lemon juice if it’s a bit stiff.\nLine a 12-hole bun tin with cake cases and put 1 large tbsp mix in each. Smooth then make a little dip in the centre. Spoon 1 tsp lemon curd into each dip and cover with 1 tbsp cake mix. Bake for 10 mins.\nMeanwhile, place the egg whites into a clean bowl, whisk until stiff peaks form, then whisk in the rest of the sugar a tbsp at a time. Keep whisking until the mixture looks glossy and has thickened a little, like shaving foam. Spoon the mixture into a freezer bag and snip off the end to leave a hole with a 1.5cm diameter.\nTake the cakes out of the oven – tops should be very pale and just firm – then pipe meringue all over the cakes. Return to the oven for 10-15 mins until the cakes are cooked through and meringue lightly browned. Can be made 1 day ahead."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Scrub the baking potatoes, then pat dry. Slice lengthways into three. Drizzle olive oil over a large baking sheet. Place the potatoes on the baking sheet, drizzle with olive oil, rub all over, then generously sprinkle with sea salt. Bake for 40-45 mins (longer for extra crispiness) turning halfway, until golden brown and tender."}
{"text": "Stir the vanilla into the condensed milk in a large bowl. Lightly whip the cream until it just holds its shape, then fold into the condensed milk using a metal spoon. Spoon into a 1-litre freezer-proof container and freeze for about 3 hrs, until softly frozen. This mix won’t crystallise at the edges like most ice creams.\nWorking quickly, ruffle up the mix, pour over the syrup and the crushed caramels, then give another quick swirl. Freeze for another 4 hrs or ideally overnight until firm. Will freeze for up to 1 month."}
{"text": "Tip all the ingredients into a pan, then cover with a lid. Place the pan on a low heat, stirring occasionally, for about 15 mins until the apples break down into a purée. Stir to knock out any lumps, then tip into a serving dish."}
{"text": "First, make the crunchy oats. Heat oven to 180C/fan 160C/gas 4. Melt the butter and honey in a large saucepan, then stir in the other ingredients until everything is well coated. Spread out on a baking sheet, then bake for 20 mins until crisp. Cool, crumble into pieces, then set aside. Can be stored in an airtight container for up to 3 days.\nFor the whisky cream, beat both pots of double cream with the mascarpone, icing sugar and whisky until it is smooth and holds soft peaks. In a separate bowl, stir a couple tbsps icing sugar into the raspberries to taste.\nTo assemble, spoon some raspberries in the bottom of a glass bowl, followed by a layer of cream and a layer of oats. Repeat 2-3 times, depending on your bowl size, saving the final layer of oats to scatter over before serving with a dusting of icing sugar."}
{"text": "Heat oven to 190C/170C fan/gas 5. Lightly grease a roughly 20 x 30cm shallow ovenproof dish. Put the butter in a large saucepan and place over a low heat until just melted. Remove the butter from the heat and stir in the sugar until well combined.\nWhisk the eggs together in a large bowl. Gradually add the eggs to the butter and sugar, beating well with a wooden spoon in between each addition. Sift the flour and cocoa powder on top of the egg mixture, then beat hard with a wooden spoon until thoroughly combined.\nPour into the prepared tin or dish and nestle the pears into the chocolate batter. Put the chocolate on a board and cut into chunky pieces roughly 1.5cm with a large knife. Scatter the chocolate pieces over the batter and sprinkle with almonds, if you like. Can be frozen at this stage.\nBake in the centre of the oven for 30 mins or until the mixture is crusty on the surface and lightly cooked inside. Do not allow to overcook, as the cake will become spongy rather than gooey in the centre. Serve warm with cream or ice cream"}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the squash in a roasting tin with the garlic, rosemary and thyme leaves. Drizzle with 2 tbsp oil and season well. Roast for 40 mins or until soft and starting to brown. Remove and squeeze the garlic out of its skin, mash and gently mix with the squash, than set aside to cool.\nHeat remaining oil in a small pan and fry the onion until soft and lightly golden. Add the mushroom and fry for 3-4 mins more. Remove from heat and set aside. In a large bowl, mix the chestnuts, herbs, cheese, and nutmeg. Stir in mushrooms and squash mixture, taking care not to break up the squash too much. Season well.\nRoll a third of the pastry into a rectangle measuring 12 x 30cm. Place on a baking tray and pierce all over with a fork, brush with beaten egg and bake for 10 mins until lightly golden and slightly risen.\nRoll out the remaining two-thirds to a rectangle slightly larger than the base then, using a sharp knife, slash diagonally. Pile the filling onto the partly-cooked base leaving a 1cm border. Brush the border with a little beaten egg and carefully lay the uncooked pastry on top, pressing down the edges to seal. Glaze top with a little more egg and bake for 30-35 mins until the pastry is golden, risen and cooked through."}
{"text": "For the filling, heat 2 tablespoons of oil in a large pan and fry the pork in small batches for 4-5 minutes until just browned, then remove with a slotted spoon and set aside. Add the onions to the pan and fry for 5-6 minutes until soft and golden. Return the pork to the pan and sprinkle in the flour. Cook for 1 minute, stirring well.\nAdd the celery, apricots, lemon and orange zest, apples, garlic, herbs and spices. Pour in the wine and stock and bring to simmering point, then cover and gently cook for 11⁄4 hours or until the pork is tender. Remove from the heat.\nMeanwhile, preheat the oven to 200C/Gas 6/fan oven 180C. Peel and cut the parsnips into 2.5cm/1in dice. Put the remaining oil in a roasting tin and put in the oven for 5 minutes until hot. Tip the parsnip chunks into the roasting tin and coat in the hot oil. Roast in the oven for 30 minutes until cooked through and golden brown. Drain and set aside. When the pork is tender, stir in the parsnips. Spoon into a 2 litre/31⁄2 pint ovenproof dish and leave to cool completely.\nFor the cobbler crust, sift the flour and season. Add the suet, butter and parsley and lightly mix in with a fork. Make a well in the centre, then add the lemon zest and juice and gently bring together to make a soft and pliable dough. If it is too dry, add a little cold water, but don’t knead the dough or it will become tough. Reduce the temperature to 180C/Gas 4/fan oven 160C.\nRoll out the dough on a lightly floured surface to about 5mm/1⁄4in thick. Cut the dough into rounds using a 7.5cm/3in pastry cutter. Re-roll the trimmings and cut out more rounds until all the dough is used up. Arrange the circles of dough so that they slightly overlap on top.\nBrush the dough with beaten egg and bake in the oven for 45 minutes until the crust is golden."}
{"text": "Heat the oven to 180C/160C fan/gas 4. Thoroughly brush a 1.5 litre bundt tin with melted butter.\nCream the butter and sugar together until light and fluffy. Stir in the almond extract.\nMix together the baking powder, flour and ground almonds. Beat in one egg at a time, adding a spoonful of the flour mixture in between. Repeat until all three eggs have been added, then fold in the remaining flour mixture and stir in the milk.\nSpoon half of the cake batter into a separate bowl and mix in the cocoa paste. Add the chocolate chips to the other half of the mixture. Add spoonfuls of each of the batters alternately to the tin and drag the handle of a teaspoon through the mixture to create a marbled effect.\nBake for around 40 minutes and then test the cake to see if a skewer inserted into the deepest part comes out clean. The cake will take 40 - 50 mins, depending on the proportions of your bundt tin.\nLet the cake cool in the tin for 10 minutes before turning out onto a cooling rack. Once cooled, dust the cake with a little icing sugar."}
{"text": "Heat oven to 200C/180C fan/gas 6. In a bowl, toss the beetroot and onion in 2 tbsp of the oil, the vinegar and sugar. Add the star anise and season well. Heat the rest of the oil in a large, ovenproof \n, then nestle in the veg so that they cover the surface of the pan. Cover with foil and cook in the oven for 45 mins.\nOn a well-floured surface, roll the pastry to a thickness of 0.5cm and cut out a circle the same size as your frying pan. Carefully take the pan out of the oven, remove the foil and wiggle the beets and onion around in the pan to make a compact layer. Put the pastry on top, tucking it in all around the edges, then return the pan to the oven and bake for 35 mins or until the pastry has puffed up and is a deep golden brown.\nSlide a palate knife around the edge of the tart, then put a plate on top of the pastry, serving side down. Flip the pan over to turn the tart out onto the plate – be careful not to burn yourself with the handle. Top with the orange zest and a sprinkle of sea salt, then serve with a peppery salad on the side."}
{"text": "Heat oven to 160C/140C fan/gas 3. Put the duck legs in a flameproof casserole set over a medium heat. Brown all over, then remove from the casserole and set aside. Pour off all but 1 tbsp of the fat, leave more fat in the pan if you are doubling or tripling (save the drained fat for your Christmas roasties). Add the carrots and onion to the casserole and cook for 5-10 mins or until starting to caramelise. Stir in the flour and cook for 1 min more. Return the duck along with the remaining ingredients. Bring to a simmer, then cover with a lid and put in the oven for 2 hrs.\nMeanwhile, prepare the gratin. Put the milk, cream, garlic and rosemary in a pan set over a low heat. Bring to a gentle simmer for 5 mins, then remove from the heat and leave to infuse for 30 mins. Grease 2 ramekins (about 8cm diameter, 5cm deep). Arrange the celeriac and potato slices in the ramekins, seasoning the layers as you go. Remove the garlic and rosemary from the milk, pour over the veg, then dot with butter. Cover tightly with foil and bake with the duck for 1½ hrs.\nOnce cooked, remove the duck and gratins from the oven. \n. Increase oven to 220C/200C fan/gas 7. Put a heavy can on top of each foil-wrapped gratin and stand for 15-20 mins, or chill like this until needed. Once pressed, turn the gratins out onto a baking tray, sprinkle with a little Parmesan and bake for 20 mins until golden.\nMeanwhile, remove the duck legs from the casserole, strain the cooking liquid into a clean pan and bring to a rapid boil. Reduce the sauce by half until thickened and glossy. Add the duck legs and heat through. Put a duck leg on each plate with a little sauce spooned over the top. Serve with the gratins and seasonal veg."}
{"text": "Bring the cream just to the boil in a pan. Turn off the heat and stir in the chocolate. Stir until melted, then add the peppermint. Cool, then chill until the mixture is solid, about 2-3 hrs.\nScoop out teaspoons of the mixture and roll into small walnut-size balls with your hands, then roll in icing sugar. "}
{"text": "heat oven to 220c/fan 200c/gas 7. Unroll a puff pastry, scatter over a couple of handfuls of grated Parmesan, then fold in half. On a lightly floured surface, roll out to the thickness of a £1 coin. Cut into 1cm strips, then twist the strips 3-4 times. Lay on a baking sheet, scatter over more cheese and bake for 12 mins, or until golden. Leave to cool, then keep in an airtight container for up to 2 days. As these cheese straws are very delicate, roll them in kitchen paper before packing into a plastic container."}
{"text": "Heat oven to 190C/170C fan/ gas 5. Toss the onion, beetroot, squash and garlic in a roasting tin with 2 tbsp olive oil, the thyme leaves, sumac and some seasoning. Roast for 45 mins until the vegetables are tender but still retain their shape, then stir in the lentils and half the chestnuts. Squeeze the garlic cloves from their skins, reserve half and squash the other two into the lentil mixture. Leave to cool completely.\nBring a large pan of salted water to the boil, tip in the kale, cook for 1 min until wilted, then drain and run under cold water until cool. Squeeze all the water from the kale, then put it in the small bowl of a food processor along with the reserved garlic cloves, chestnuts, the lemon juice, olive oil and some seasoning. Blitz to a thick pesto, and season to taste.\nOn a lightly floured surface, unravel the sheets of puff pastry. Cut each sheet into three widthways so that you have six strips in total then divide the kale pesto between these, followed by the roasted veg and lentils, heaping the mixture on top of the pesto and leaving one side free of filling so that it is easier to roll. Brush all the borders with half the milk, fold over the ends, then carefully roll the pastry lengthways to completely encase the filling into a roll. Place your six individual Wellingtons on a baking tray lined with baking parchment and chill for at least 1 hr, or cover with cling film and leave overnight. \nTo bake from chilled, heat oven to 190 C/170 C fan/gas 3 and line a baking tray with parchment.\nBrush the top of each Wellington with the remaining milk and sprinkle with a little sumac, then bake for 30 mins from chilled or 45 mins from frozen until crisp and golden. Scatter over extra thyme and some flaky sea salt and serve."}
{"text": "Heat the oven to 180C/160C fan/gas 4, butter and line the base of a 20cm x 20cm brownie tin with parchment paper. Melt the chocolate in the microwave or in a glass bowl over a pan of simmering water.\nMix the flour and cocoa powder together with the spices and a pinch of salt - set aside. Using an electric \n, beat the butter and sugar together until super light and fluffy then whisk in the egg and yolk.\nPour in melted chocolate, wine and flour mixture and whisk until just combined.\nPour the batter into tin and bake for 15 mins until just set, don’t worry if there is a slight wobble in the centre, it will set up as they cool. Put into the fridge to firm up."}
{"text": "Heat the butter in a pan, add the onions and bay leaves, then gently fry with the lid on for 10 mins until soft, but not coloured.\nAdd milk and cloves, then simmer gently, uncovered, for 30 mins, stirring occasionally.\nRemove bay and cloves, then tip everything into a processor and blitz with two-thirds of the bread until smooth. Chill for up to two days. To serve, tip the cream into a pan, add the sauce, then stir until mixed. Tear in the remaining bread. Add a little milk if necessary to thin the consistency. Season and serve warm."}
{"text": "Heat oven to 220C/200C fan /gas 7. Line a 23 x 33cm Swiss roll tin with baking parchment and oil lightly. Whisk the caster sugar and yolks in a bowl until pale and thick. Melt the chocolate with 4 tbsp cold water in a bowl set over a pan of simmering water. Stir in the sugar mix.\nWhisk egg whites to stiff peaks. Stir a spoonful into the chocolate, then fold in remaining using a large metal spoon. Pour batter into tin and bake for 12-14 mins until risen and just firm. Leave in tin until cold.\nLay a sheet of baking parchment on a board. With one bold movement, turn the cake onto the paper, then lift off the tin. Carefully peel away the lining paper.\nSpread the whipped cream all over the cake, then scatter over the berries with a dribble of Drambuie, if you like. Starting at the long side opposite you, use the paper to roll the cake towards you. Transfer to a serving dish.\nFor the buttercream, beat the butter, then sift in sugar and cocoa. Add milk and mix together. Spread over cake, use a fork to create a log effect, and chill until needed. Decorate, dust with icing sugar and serve."}
{"text": "Instead of soaking the ham overnight to get rid of excess salt, follow my short-cut method.Weigh the joint and calculate the poaching time, allowing 25 minutes for every 450g/1lb, and put the joint in a very large pan. Cover with cold water and bring to the boil, then drain off all the water.\nPour 600ml/1 pint of the cider into the pan and then pour in enough cold water to cover the joint. Add the onions, carrots, bay leaves, parsley stalks, cloves and peppercorns. Bring slowly to the boil, turn down the heat, then cover and simmer very gently for the calculated time. Allow the joint to cool in the stock (overnight is ideal).\nPreheat the oven to 180C/gas 4/ fan 160C. Lift the joint out of the stock, then strain the stock and measure 500ml/18fl oz. Strip the rind off the joint and score the fat in a diamond pattern. Put the joint in a heavy roasting tin (if it’s wibblywobbly, prop it up with a wad of scrunched-up foil), pour over the remaining cider and braise in the oven for 45 minutes to 1 hour, basting frequently until beginning to brown. If the pan becomes dry, splash in some cider or water to cover the bottom of the tin.\nMeanwhile, start the sauce. Put the milk, parsley stalks and bay leaves into a saucepan, bring to the boil and leave to infuse for as long as you have.\nRemove the joint from the oven and raise the temperature to 200C/gas 6/fan 180C. Put the orange halves around the joint. Melt the marmalade, brush it generously all over the gammon and oranges, then return to the oven for 10 minutes to glaze. Lift the gammon and oranges on to a serving dish, cover and keep warm while you finish the sauce.\nSprinkle the flour into the roasting tin and scrape and stir around to mix with the juices. Place on the hob and cook for a couple of minutes, stirring, to cook out the flour.Gradually pour in the measured stock and whisk well. Now add the strained infused milk and bring to the boil, then turn down the heat and simmer for 10 minutes. Strain into a clean saucepan, stir in the chopped parsley leaves and cream, then heat through gently and check the seasoning. Pour into a warm jug and serve with the joint."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Line the base of a 25cm springform tin with baking parchment. Mix the melted butter and biscuit crumbs until well blended, then press firmly onto the base of the tin. Bake for 10 mins.\nTurn oven temperature up to 240C/fan 220C/gas 9. Beat the cream cheese and sugar with an electric whisk until smooth and creamy, then whisk in the cocoa, vanilla, Tia Maria, eggs, soured cream and half the melted chocolate. Stir enough milk into the remaining chocolate to make a sauce consistency, then set aside until ready to decorate the cheesecake.\nPut a little melted butter on some kitchen paper and use it to butter the sides of the cake tin. Pour in the cheese mixture, then smooth the top. Bake for 10 mins, then turn the heat down to 110C/fan 90C/gas ¼ for 25-30 mins. The filling should be set, but with a wobble in the centre. Turn off the oven, open the door a crack, then leave the cheesecake to cool in the oven for 2 hrs. Chill until ready to serve.\nTo decorate the cheesecake, carefully remove it from the tin and strip the lining paper from the base. Lightly whip the cream until it just holds its shape, then swirl it on top and drizzle with the reserved chocolate sauce, rippling the sauce through the cream with the end of a spoon. Serve as is or pile with chocolate curls. To make the chocolate curls: run a swivel potato peeler firmly down the smooth back of a slab of chocolate so that curls of chocolate flake away from the bar."}
{"text": "If you have time the day before, salt the turkey. Make the salt mix by grinding the salt with the thyme leaves and pepper in a spice grinder or with a pestle and mortar. Sit the turkey in a roasting tin and season all over, inside and out, using about two-thirds of the salt. Leave the turkey in the tin, breast-side up, cover with cling film and put in the fridge for up to 24 hrs. If you don’t have time, or there is no room in the fridge, simply prepare the salt and season the turkey generously before roasting.\nTo make the bacon butter, gently cook the bacon in a dry frying pan for about 10 mins, stirring occasionally, until the fat has seeped into the pan and is sizzling gently, and the bacon is crisp. Take off the heat and leave to cool slightly. Scrape the bacon and the fat into a food processor with the butter and maple syrup. Blitz to combine, scraping down the sides of the processor from time to time. Roll up the butter in cling film to form a log and place in the fridge. Can be made a few days ahead or frozen for 1 month.\nRemove the turkey from the fridge an hour or so before you want to cook it. Remove the bacon butter from the fridge to soften up. Heat oven to 180C/160C fan/gas 4. Calculate your cooking time based on 40 mins per kg for the first 4kg of the turkey, plus 45 mins for every kg after that.\nGently push your fingers under the skin of the turkey, starting from the neck, until you can push your whole hand in down the length of the breast. Take care not to tear the skin. Use your hands to spread the bacon butter under the skin so that it covers the entire breast area, and there is butter in the crevice between the thigh and the main body. Pop a sprig of thyme under the skin of each breast, then smooth the skin over with your buttery hands. Place the onion, lemon, bay leaves and garlic in the cavity.\nCover the tin loosely with foil and roast for the calculated cooking time – 30 mins before the end of cooking, increase the oven temperature to 200C/180C fan/gas 6, remove the foil, baste the turkey and return to the oven. When the turkey is beautifully brown and cooked through, remove from the oven and leave to rest on a warm platter covered in foil for up to 1 hr.\nPour the fat away from the roasting tin, leaving just the juices. If your tin is flameproof, pour in the Sticky Port gravy (see 'Goes well with', right) to reheat with the juices; if not, tip them both into a saucepan and reheat. Serve the remaining salt mix as a seasoning alongside the rest of the meal."}
{"text": "Put 100g light muscovado sugar in a pan with 1 star anise, 1 cinnamon stick, 4 cloves and 150ml water. Bring slowly to the boil, stirring to dissolve the sugar.\nSimmer for 2 mins, then pour into a large jug and leave to cool. Add 1 lemon and 2 clementines, both thinly sliced, to the jug along with 150ml Cointreau and a 750ml bottle light red wine, such as a Beaujolais. Stir well, then cover and chill for at least 2 hrs or overnight if you can.\nServe chilled or over ice, with a twist of orange zest and a star anise. If you’d like to serve a traditional warm mulled wine, there’s no need to chill – simply warm through without boiling and serve in heatproof glasses."}
{"text": "Put the cream, milk, bay, a sprig of thyme, the garlic and ¼ tsp freshly grated nutmeg in a saucepan, and bring to the boil. Take the pan off the heat and leave to infuse for 10 mins. Heat oven to 180C/160C fan/gas 4.\nGrease a large baking dish with the butter, then layer up the butternut squash, adding seasoning and a few thyme leaves as you go. Pour over the infused cream, leaving the bay and thyme on the top.\nCover the dish with foil and bake for 30 mins. Uncover, press the squash as far under the level of the liquid as you can, then scatter with the cheese. Bake, uncovered, for 30 mins more until the butternut is tender and the whole dish is bubbling and golden. Let stand for 10 mins or so before serving."}
{"text": "Peel the carrots and trim off the ends. Cut in half lengthways, then cut on the diagonal into slices about ½cm thick. Place the carrots in a steamer basket and steam for 5-7 mins until softened, or place in a heatproof bowl with a little water and microwave on High for 3-5 mins.\nTo finish the dish, gently heat the butter in a frying pan. Tip in the caraway seeds and cook for 30 secs until they start sizzling. Add the carrots and stir into the butter until glossy and heated through, about 3 mins. Toss through the parsley and serve."}
{"text": "Heat the oil in a pan and sizzle the pancetta until crispy. Sprinkle over the sugar and splash in the vinegar. Stir the cabbage into the pan, then pour over the stock. Simmer it all for 10 mins until the cabbage is tender but still slightly crunchy."}
{"text": "Put the gelatine in a bowl of cold water to soak. Measure the custard powder into a large bowl, add 3 tbsp of the milk and mix to a paste. Heat the remaining milk and 100ml of the double cream in a small pan. When steaming, pour over the custard paste and whisk until smooth. Pour back into the pan and heat, whisking continuously until thick. Remove from heat. Squeeze excess water from the gelatine leaves and whisk these into the custard. Rinse the bowl, pour the custard back in, then cover the surface with cling film.\nGrease a 23cm springform tin and line with a double layer of cling film to cover the base and sides. Wrap the outside of the tin in foil – this will catch any jelly leaks. Blitz the biscuits to fine crumbs, add the butter, and blitz again. Tip the mixture into the base of the tin and push down firmly with a spoon.\nPut the cream cheese, sugar and vanilla into a large bowl, and mix together using an electric hand whisk until well combined. Give the custard a quick whisk to loosen it a little, then add to the cheesecake mixture and whisk to combine until smooth. Pour into the tin and level the surface. Tap the tin to knock out any air bubbles (it’s essential there are no gaps between the cheesecake and the cling film or the jelly will flood out in the next step). Chill for 4 hrs.\nMake up half the jelly following pack instructions, then leave to cool for 30 mins. Pour over the cheesecake, top with frozen berries and put in the fridge for 1 hr. Make up the remaining jelly 30 mins before removing the cheesecake from the fridge. Pour over the second layer of jelly and leave to set for 1 hr more.\nPut the remaining cream, icing sugar and Sherry (if using) in a bowl and whisk until softly whipped. Transfer to a piping bag. Remove the cheesecake from its tin, peel away the cling film.Place on a plate and pipe cream around the edge. Best served on the day, but will keep in the fridge for 3 days."}
{"text": "Start with the fruit. Pour the apple juice into a saucepan and bring to a simmer. Add the butter, let it melt, then take off the heat and add the syrup and rum. Put the mixed fruit and cranberries into a large bowl, pour over the hot rum mix, then cover tightly with cling film and leave overnight.\nThe next day, heat oven to 160C/140C fan/gas 3. Grease and double-line a 20cm round, deep cake tin with non-stick baking parchment. Beat the butter and sugar together until creamy and pale, then gradually beat in the eggs until light and fluffy. If the mix starts to split or look lumpy, add 1 tbsp of the flour and keep beating. Sift in the flour, spices and 1/4 tsp salt, and fold in using a large spoon. Fold in the orange zest, nuts, soaked fruit and soaking liquid.\nSpoon the batter into the tin, level the top, then make a slight dimple in the middle using the back of the spoon. Bake for 1 hr 30 mins, then reduce oven to 140C/120C fan/gas 1 and bake for a further 1 hr 45 mins or until it has risen, is a dark golden colour and a skewer inserted into the middle of the cake comes out clean. Put the tin on a cooling rack and leave until warm.\nTo feed the cake the first time, use a cocktail stick to poke all over the top of the warm cake. Stir together the rum and maple syrup, then slowly spoon over the cake. Cool completely, then remove the baking parchment, wrap loosely in clean baking parchment and store in an airtight tin. Feed the cake every week to 10 days until you decorate it.\nNow you're ready to cover and ice your cake. Sit the cake on a large flat plate or board and brush a thin layer of apricot jam over the top and sides.\nDust the work surface with icing sugar. Lightly knead the marzipan until pliable, then roll out in one direction, turning the marzipan 90 degrees every few rolls and keeping the pressure even. Keep it in a circular shape, reshaping it if needed as you go. When large enough (about 35cm across for a 20cm cake), lift over the cake. Smooth the top and sides with your palms and trim with a knife. If you have time, leave to dry overnight.\nClean the work surface and rolling pin. Using a pastry brush, lightly brush the sides with cooled boiled water or alcohol, then cover with the sugarpaste icing, rolling it in the same way. Lift onto the cake, then work your way gradually around, smoothing out any folds with your palms to avoid wrinkles forming. Polish the icing with the palms of your hands (or a proper cake smoother) for a smooth finish. Trim with a sharp knife.\nUsing the cutters, cut out shapes in the icing, pressing down as far as the marzipan, then removing the middles. To make teardrop and bird shapes, use a small sharp knife to cut points above and below or to the sides of the circles.\nMix the icing sugar and egg white to make a thick but flowing icing. Split it roughly between five pots – leave one white, then colour the others. Flood each shape with a different colour, then add some coloured balls and leave to set. A pair of craft tweezers will help if you want the balls to be in a design rather than just scattered over.\nAdd a dab of black colouring to the remaining white icing to make it grey, and add a little more icing sugar to thicken it. Spoon into the piping bag, snip off the end, then pipe on the strings, bows and stars or snowflakes. Tie the ribbon around the base of the cake and leave to dry."}
{"text": "For the filling, trim your turkey breasts: you want to create a long tube of meat in the middle of your Wellington, similar in shape to a fillet of beef. You can use the trimmings in the stuffing, so don’t worry about wastage. Once you have the correct shape, slice a pocket into the breasts deep enough so that the brie and cranberry sauce will stay inside, but don’t cut all the way through. Divide the cranberry sauce and brie between the two turkey breasts, then chill while you make the stuffing.\nFor the stuffing, heat the butter in a frying pan and gently cook the leek for about 5 mins. Meanwhile, finely chop the turkey trimmings and add to the pan with the gammon. Cook for about 5 mins, then remove and allow to cool slightly. Mix with the sausagemeat, sage and breadcrumbs, then season.\nRoll out the first block of pastry on a floured surface to about £1 thickness: you want a long thin shape that is about 5cm wider than turkey breast width and 5cm longer than length of turkey breasts placed end to end. Gently lift this onto a baking sheet and put the turkey breasts on top, followed by the stuffing. Roll out the second block of pastry, brush the edge of the bottom sheet with egg and lay the top one over. Trim edges to neaten, then crimp together. \nHeat oven to 200C/180C fan/gas 6. Brush the Wellington with more beaten egg and, with a sharp knife, score a criss-cross pattern, but don’t cut all the way through. Cook for 30 mins, then cover with foil and cook for 30-45 mins more. After 1 hr, check that the middle is hot by inserting a skewer for 5 secs – it should feel hot to the touch. Leave to rest for 15 mins, then slice to serve."}
{"text": "Unwrap the chocolates, place on a tray and pop in the freezer. Heat oven to 180C/160C fan/gas 4. Lightly grease and line the base and sides of a 21-22cm square tin with baking parchment.\nPut the butter, sugars and cocoa into your largest saucepan and gently melt together, stirring regularly so the mixture doesn’t catch. Once the sugar granules have just about disappeared, take off the heat, tip into a bowl and leave to cool for 5 mins.\nUse a whisk or wooden spoon to beat the eggs, one by one, into the mixture. When they’re completely incorporated and the mixture is smooth and shiny, stir in the flour, hazelnuts and liqueur. Tip the mixture into the prepared tin and bake for 35 mins.\nRemove the tin from the oven and use a cutlery knife to mark the top of the brownies into 16 squares (don’t cut through, it’s just as a guide). Use a teaspoon to push a little dent in the centre of each portion and add a frozen Ferrero Rocher chocolate into each dip. Return to the oven for 3 mins, then remove and leave to cool completely.\nOnce cool, cut into 16 squares. Will keep for 3 days in an airtight container."}
{"text": "Start with the fruit. Pour the apple juice into a saucepan and bring to a simmer. Add the butter, let it melt, then take off the heat and add the syrup and rum. Put the mixed fruit and cranberries into a large bowl, pour over the hot rum mix, then cover tightly with cling film and leave overnight.\nThe next day, heat oven to 160C/140C fan/gas 3. Grease and double-line a 20cm round, deep cake tin with non-stick baking parchment. Beat the butter and sugar together until creamy and pale, then gradually beat in the eggs until light and fluffy. If the mix starts to split or look lumpy, add 1 tbsp of the flour and keep beating. Sift in the flour, spices and 1/4 tsp salt, and fold in using a large spoon. Fold in the orange zest, nuts, soaked fruit and soaking liquid.\nSpoon the batter into the tin, level the top, then make a slight dimple in the middle using the back of the spoon. Bake for 1 hr 30 mins, then reduce oven to 140C/120C fan/gas 1 and bake for a further 1 hr 45 mins or until it has risen, is a dark golden colour and a skewer inserted into the middle of the cake comes out clean. Put the tin on a cooling rack and leave until warm.\nTo feed the cake the first time, use a cocktail stick to poke all over the top of the warm cake. Stir together the rum and maple syrup, then slowly spoon over the cake. Cool completely, then remove the baking parchment, wrap loosely in clean baking parchment and store in an airtight tin. Feed the cake every week to 10 days until you decorate it.\nNow you're ready to cover and ice your cake. Sit the cake on a large flat plate or board and brush a thin layer of apricot jam over the top.\nDust the work surface with icing sugar. Lightly knead the marzipan until pliable, then roll out in one direction, turning the marzipan 90 degrees every few rolls and keeping the pressure even. Keep it in a circular shape, reshaping it if needed as you go. When large enough (a 20cm circle to cover the top of the cake), lift onto the cake. Smooth the top with your palms and trim with a knife so flush with the cake. If you have time, leave to dry overnight.\nClean the work surface and rolling pin. Using a pastry brush, lightly brush the marzipan with cooled boiled water or alcohol, then cover with the sugarpaste icing, rolling it in the same way. Lift onto the cake, then work your way gradually over the icing, smoothing out any folds with your palms to avoid wrinkles forming. Polish the icing with the palms of your hands (or a proper cake smoother) for a smooth finish. Trim with a sharp knife.\nUse a straight-sided glass or jar to rub around the icing to make it flush with the cake. If not quite big enough, rub the top with the flat of your hands to spread a little, then use the glass or jar to smooth it.\nArrange the tea lights in a triangle on the top of the cake. Mark their positions by pressing down lightly into the icing, then cut out and remove three circles from the icing, going right down to the marzipan. Insert the candles.\nLoosely tie the ribbon around the middle of the cake, then drop a cinnamon stick at 12, 3, 6 and 9 o’clock between the ribbon and the cake. One by one, fill in the gaps with the remaining cinnamon sticks. When they are all upright, tighten and tie the ribbon in a knot – you may find a second pair of hands helpful for this bit.\nSeparate the bay into 3-leaf sprigs, then insert into the icing (I find the leaves look best if they all swirl around in the same direction). Add the rosemary, bending the stems a little to help if you need to, then fill in any gaps with single bay leaves. (Make sure that no leaves hang over or near where the candle flames will be). When ready to show off your cake, light the candles. Don’t leave the cake unattended."}
{"text": "Put flour, almonds, butter, orange zest and sugar in a food processor and whizz into crumbs. Add the egg yolk and a teaspoon of cold water and pulse to form a dough. Wrap in cling film and chill for 30 minutes.\nPreheat the oven to fan 180C/ conventional 200C/gas 6.Roll out the dough thinly and, with an 8-9cm plain cutter, stamp out 18 rounds – they need to be larger than the bun tin holes. Use to line one and a half 12-hole bun tins, pinching and fluting the dough edges above the level of the tins with your fingers.\nPut a heaped teaspoon of mincemeat in each case. Quickly knead the trimmings and roll out. Use a star cutter to make 18 stars.\nPut a star on top of each pie. Brush stars and pastry edges with egg white and dust lightly with caster sugar. (The pies can be frozen at this stage in the tins, then removed, packed into freezer bags and frozen for up to 3 months.) Bake the pies for 12-15 minutes (18-20 minutes from frozen) until the pastry is crisp and golden. Cool in the tins for 10 minutes before transferring to a wire rack. Dust with icing sugar before serving."}
{"text": "Get your equipment ready (see tips below). Break the chocolate in small pieces into a large heatproof bowl. Spoon in the syrup and pour in about a quarter of the cream. Stand the bowl over (not in) a pan of hot water over the lowest possible heat and leave until the chocolate has melted, about 15-20 minutes. Remove the bowl from the pan and stir to combine. Leave until barely warm – dip your little finger in to check.\nGet your cake tin ready. Do this while you are waiting for the chocolate to melt and cool so you’re not hanging around. Cut open the plastic folder along the bottom, then cut out a disc to fit in the bottom of the tin and 3 strips to line the sides. (See step 2).\nPour the rest of the cream into a very large bowl and tip in the coffee and cinnamon. Whip with a balloon whisk until the cream looks like step 3. When you shake the bowl the cream should wobble like a thick milkshake, and when you dribble some cream from the whisk, the trail it leaves in the cream below should disappear in 1-2 seconds.\nFold the two together. Pour the cooled chocolate into the bowl containing the cream. With the largest metal spoon you’ve got, fold the cream and chocolate together in a figure-of-eight motion. Don’t be nervous – keep going until they are evenly and smoothly mixed and the mixture has a soft, pillowy, downy texture – you will see and feel it thicken as you fold.\nSet the torte. Pour the chocolatey cream into the tin and level the surface with the back of the spoon. Put the tin in the fridge and leave to firm up. This can happen in under an hour, but you may need to leave it longer, depending on the coldness of your fridge (you can leave it overnight if this is more convenient).\nUnmould and serve. Unclip and remove the side of the tin, then remove the pieces of plastic around the sides. Invert a serving plate over the torte and turn the torte upside down on to it. Lift off the tin base and peel away the plastic. Dust all over with cocoa (including the plate if you wish to be fashionable) and serve in thin slices."}
{"text": "Start with the fruit. Pour the apple juice into a saucepan and bring to a simmer. Add the butter, let it melt, then take off the heat and add the syrup and rum. Put the mixed fruit and cranberries into a large bowl, pour over the hot rum mix, then cover tightly with cling film and leave overnight.\nThe next day, heat oven to 160C/140C fan/gas 3. Grease and double-line a 20cm round, deep cake tin with non-stick baking parchment. Beat the butter and sugar together until creamy and pale, then gradually beat in the eggs until light and fluffy. If the mix starts to split or look lumpy, add 1 tbsp of the flour and keep beating. Sift in the flour, spices and 1/4 tsp salt, and fold in using a large spoon. Fold in the orange zest, nuts, soaked fruit and soaking liquid.\nSpoon the batter into the tin, level the top, then make a slight dimple in the middle using the back of the spoon. Bake for 1 hr 30 mins, then reduce oven to 140C/120C fan/gas 1 and bake for a further 1 hr 45 mins or until it has risen, is a dark golden colour and a skewer inserted into the middle of the cake comes out clean. Put the tin on a cooling rack and leave until warm.\nTo feed the cake the first time, use a cocktail stick to poke all over the top of the warm cake. Stir together the rum and maple syrup, then slowly spoon over the cake. Cool completely, then remove the baking parchment, wrap loosely in clean baking parchment and store in an airtight tin. Feed the cake every week to 10 days until you decorate it.\nNow you're ready to cover and ice your cake. Sit the cake on a large flat plate or board and brush a thin layer of apricot jam over the top and sides.\nDust the work surface with icing sugar. Lightly knead the marzipan until pliable, then roll out in one direction, turning the marzipan 90 degrees every few rolls and keeping the pressure even. Keep it in a circular shape, reshaping it if needed as you go. When large enough (about 35cm across for a 20cm cake), lift over the cake. Smooth the top and sides with your palms and trim with a knife. If you have time, leave to dry overnight.\nClean the work surface and rolling pin. Using a pastry brush, lightly brush the sides with cooled boiled water or alcohol, then cover with the sugarpaste icing, rolling it in the same way. Lift onto the cake, then work your way gradually around, smoothing out any folds with your palms to avoid wrinkles forming. Polish the icing with the palms of your hands (or a proper cake smoother) for a smooth finish. Trim with a sharp knife.\nNow you're ready to decorate. Make the icing by mixing the egg white and sugar together until thick and smooth. Using a palette knife, spread a thin layer of icing all around the sides of the iced cake. Sit the cake on a large tray and, holding it at an angle, scatter on the sprinkles. You can use a palette knife to help, scooping them up and pressing them on. Leave to dry, then set aside.\nSit the cake topper on the jar’s lid, then invert the jar over it. If the figurine looks a little lost in the jar once closed, then glue in the milk bottle top as a booster. When you’re happy, glue the cake topper in place and leave to dry.\nUse the acrylic paint to paint some simple fir trees on the back of the jar (remember to have it upside down as you paint) and leave to dry.\nWhen ready, fill the jar three-quarters full with water, add the glycerine and dissolve. Spoon in the glitter, then screw on the lid and shake well. The glitter will clump a bit at first but then separate. Carefully top up with water if needed, then screw tightly and dry any drips, taking care not to damage your painted trees. Glue the ribbon onto the lid/base of your snow globe.\nUse a little of the leftover icing to attach the jelly beans to the top of the cake, leaving room for the snow globe. Sit the snow globe on top (you can press it into the icing a little if it seems wobbly) and shake whenever you feel like it!"}
{"text": "Butter the inside of a 1.2-litre pudding basin. If you’re steaming the pudding on the hob, boil the kettle and have a large saucepan with a lid and a heatproof saucer ready. Cut a sheet of foil and greaseproof paper, both about 30cm long, and butter the greaseproof.\nSpoon 3 tbsp syrup into the bottom of the basin. Lay 5 slices of clementine or satsuma in the bottom, overlapping like petals. In a bowl, beat the butter and sugar until creamy, then add eggs gradually, beating all the while, until light and fluffy. Add a spoonful of flour if the mix starts to split. Tip in the breadcrumbs and the rest of the flour, fold until combined, then add all remaining ingredients and fold again. Spoon mix on top of the fruit slices. Add remaining slices of clementine or satsuma against the side of the bowl as you go.\nTo cook on the hob, cover with greaseproof and foil and steam for 1½ hrs (see Know-how, below). To microwave, losely cover with cling film, pierce once, then cook on Medium for 12 mins. To check it’s done, poke a skewer into the pudding; it should come out clean.\nMake the syrup by heating the ingredients in a small pan. When the pudding is ready, turn out and serve drenched with syrup, or leave to cool and chill for up to 3 days. To reheat, re-cover with foil and greaseproof and steam for 30 mins, or cover with cling film and microwave on Medium for 5 mins until hot. Reheat sauce in the microwave or in a pan."}
{"text": "Heat oven to 200C/180C fan/gas 6. Rub the butter into the flour and icing sugar with your fingertips, or blend in a food processor, until the mixture comes together in a ball – you don’t need to add any liquid or chill it. Knead briefly, then cut into 12 equal pieces.\nTaking a piece of dough at a time, cut off two-thirds and press into the base and up the sides of a muffin tin hole. Repeat to make 12. Spoon the mincemeat into the pastry cases – it won’t completely fill them.\nNow take the 12 remaining smaller pieces of pastry. Roll each into a ball and flatten to make a disc for the mince pie lid. Add one to each pie and tuck the pastry that comes up the sides of the tin down to seal it. Prick the tops with a fork a few times. \nBake for 12-15 mins or until pale golden. Cool in the tins for about 10 mins, then give the pies a little twist to stop them from sticking. When cool, carefully remove from the tins. Dust with icing sugar when ready to serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. In a large frying pan, gently fry the onion in the oil until soft, about 8-10 mins. Stir in the pancetta, garlic and thyme, and cook until the pancetta is browned and crisp. Stir in the polenta and half the cheese and cook for a few mins – don’t worry if the polenta breaks up. \nAdd the cream and stock to the pan, mix thoroughly, then pour into an oiled baking dish. Sprinkle the remaining cheese over and bake for 40 mins or until browned on top. Allow to stand for 10 mins before serving."}
{"text": "Put the sugar, syrup, butter and a pinch of salt into a saucepan. Bubble for 1-2 mins, mixing to combine. Set aside to cool a little. Put the flour, bicarbonate of soda and spices in a bowl, add the warm syrup mixture and the egg, and stir to combine (it will feel a little soft now, but will firm up once chilled). Cover the bowl with cling film and chill for 30 mins. Heat oven to 200C/180C fan/gas 6 and line 2 baking trays with parchment.\nDust your work surface with a little flour, then roll out the dough to the thickness of a £1 coin. Cut out as many men and ladies as you can – you should be able to get about 16 by re-rolling the dough. Place on the trays, then bake for 10-12 mins until slightly risen and golden brown. While they are still warm, push a straw through the top of the gingerbread ladies, and just above where the legs meet on the gingerbread men, to make a hole for stringing up. Cool on a wire rack.\nTo decorate your snowmen, divide the icing sugar evenly between 2 bowls. Add enough water, a dribble at a time, until you have a very thick but pipeable icing. Add a few drops of brown food colouring to one bowl of icing brown for the reindeer and mix until evenly coloured. Spoon 2 tbsp of the brown icing into another bowl, then colour black using the black food colouring.\nTransfer roughly half the white icing to a piping bag fitted with a fine nozzle. Pipe the outline of a snowman onto the gingerbread lady biscuits, piping a little circle around the hole at the top too. Leave to set for 5 mins. Squeeze any leftover icing back into the bowl with the remaining white icing and add a little more water, a splash at a time, until runny but still fairly thick. Transfer back to the piping bag. When the snowman outlines are dry to the touch, pipe enough icing onto the biscuits to flood the surface. Tease the icing into all corners using a cocktail stick.\nUse half an orange jelly bean for the snowman’s nose and silver balls for the buttons. Transfer the brown and black icings to piping bags fitted with small nozzles (or snip off the corner of a sandwich bag), and pipe on brown twigs for arms and black dots as coal for eyes and a mouth. Finally, sprinkle the base of each snowman with a little edible glitter. Leave to dry for at least 2 hrs.\nTo decorate your reindeer, draw a reindeer outline on each gingerbread man biscuit using the brown icing (just as you did with the snowmen) – turn them upside down first so you can use the legs as the reindeer’s antlers. Leave to dry while you loosen the brown icing, as before.\nFill each reindeer with the runnier brown icing, being careful not to make the antlers too thick. Tease into the spaces using a cocktail stick. Sprinkle each antler with brown sugar and flick off any excess with the cocktail stick. Stick a red ball or Smartie on each biscuit for a nose, and 2 white chocolate chips for eyes. Use a little black icing to draw a pupil on each eye. Leave to dry for at least 2 hrs.\nWhen the biscuits are completely dry, thread and tie through a piece of string and hang. Eat the biscuits within 2 weeks."}
{"text": "Peel and grate the apple and set aside. Mix all the ingredients except the apple, whisky and bay leaves in the order they are listed.\nStir through the apple, then add the whisky once all the other ingredients are completely combined.\nPack the mincemeat into sterilised jars.\nTuck a bay leaf into each jar to scent the mincemeat, then seal. Leave for 2 weeks before using. Will keep for 6 months."}
{"text": "Place all the ingredients into a \n and pulse until smooth. Pour into glasses and serve topped with fresh mint."}
{"text": "Heat oven to 200C/180C fan/gas 6.\nUnwrap 250g camembert, brie or similar from its packaging, then place back into its box. Tie string around the box to secure. \nSlash the cheese a few times and top with 1 tbsp vermouth, dry white wine or kirsch, 2 thyme sprigs and a pinch of dried chilli flakes. \nBake on a baking tray for 20 mins until gooey. Serve with toasted bread or crackers for dipping."}
{"text": "Squeeze 1 clementine and put the juice in a pan with the cranberries, sugar and port. Cook for 5 mins until the cranberries start to soften and burst. Tear the other clementine into segments (remove the membrane if you have time) and cook along with the cranberries for 2 mins more. Store in fridge, or freezer for up to 2 months."}
{"text": "Put 750g frozen summer fruit in a pan with 200g caster sugar and 1 litre water and bring to a gentle simmer.\nCook for 2 mins, then scoop out 6 tbsp fruit and 150ml juice. Now carry on cooking the fruit in the pan for 5 mins.\nMeanwhile, soak 9 sheets leaf gelatine in cold water to soften it. If you have a \n, blitz the cooked fruit or mash with a potato masher, then strain through a sieve into a large bowl and push through the pulp so just the skins and seeds are left.\nSqueeze excess water from the gelatine, add to the hot fruit syrup and stir to dissolve. Cool, then chill until on the point of almost setting.\nMake the custard according to pack instructions with 75g custard powder, 1.2l milk and 50g caster sugar to create a really thick custard. Cover the surface with baking paper while it cools a little.\nPile 1½ - 2 cubed madeira cakes into a trifle bowl, spoon over the reserved juice and berries, then 4 tbsp sherry or cassis.\nPour over a thick layer of custard, pushing it against the side of the dish to seal in the cake below. Leave to cool and set with a skin – this makes a barrier for the jelly.\nWhen the custard is cold and set, and the jelly is on the point of setting, spoon the jelly over the custard and chill until ready to complete.\nWhip 300 - 450ml double cream with 1 tsp vanilla extract and 2 tbsp icing sugar until just holding its shape, then spoon round the bowl over the set jelly. Scatter with 2 crushed amaretti biscuits and chill until ready to serve."}
{"text": "Whizz the raspberries and icing sugar together in a food processor, then sieve, pressing through as much raspberry as you can with a wooden spoon. Line a 2lb loaf tin with cling film – it helps if you brush the tin with oil first to get the cling film to stick and stay in place. Pour in the raspberry sauce and freeze for 1 hr.\nQuickly dip the nougat bars in water – this should allow you to peel away the rice paper; don’t worry if you don’t get it all as it will disappear when melted. Put the bars into a pan with 200ml cream. Melt over a low heat, stirring constantly and using a wooden spoon to break up the nougat into smaller bits as it softens. After a while you should end up with a smooth, sticky, creamy mixture. Remove from the heat and set aside to cool a little. Whip the remaining cream in a large mixing bowl to stiff peaks.\nWhen the nougat is cooler, but still soft and sauce-like, fold it one-third at a time into the whipped cream. Scatter over the whole nuts and fold once to mix. Scrape into the loaf tin, cover with cling film and freeze overnight, or for up to a month.\nTransfer the loaf to the fridge 15 mins before you want to serve it. Unwrap and turn out onto a serving plate. Peel off the cling film, roughly chop a few extra pistachios and scatter over before slicing."}
{"text": "Sieve the flour and cocoa into a bowl. Put the butter in a saucepan and add 225ml water. Bring to a fast boil, then simmer until the butter has melted. Tip in the flour mixture and quickly beat with a wooden spoon until the mixture comes together to a smooth, shiny dough, and pulls away from the sides of the pan. Tip the dough into a bowl and spread it up the sides with your spoon to help it to cool down quickly (but don’t let it cool completely – it’s easier to incorporate the eggs while it’s still warm). Heat oven to 200C/180C fan/ gas 6 and line 2 baking sheets with baking parchment.\nWhile the dough is still warm, add the eggs a little at a time, beating well with a wooden spoon between each addition. You’re looking for a smooth consistency, that reluctantly falls off the spoon in a V shape (you may not need to use all the egg). If the mixture becomes too runny, you won’t be able to pipe it; if it’s too thick, it won’t puff up in the oven. When you’re happy with the consistency, spoon it into a disposable piping bag.\nSnip off the end of the piping bag to give you a 1cm opening. Holding the bag at a 90-degree angle to the baking tray, pipe balls of the dough, about the size of a walnut, over the 2 sheets – you should make 18-20 in total. Dip your finger in a little water and gently pat down any peaks on the top of the balls of dough. Place the 2 sheets in the oven and bake for 25-30 mins, swapping the trays over after 20 mins. The choux buns should be puffed up and crisp when cooked. Leave to cool completely.\nSpoon the caramel into a large bowl, add 1/2 tsp salt, mix well and taste – add a little more salt if you like. Add the cream and whisk until holding soft peaks (the cream can now be stored in the fridge for up to 1 day).\nSplit the choux buns in half, spoon a generous dollop of salted caramel cream into each and replace the lids. Melt the white and dark chocolates in 2 bowls suspended over pans of gently simmering water, or in the microwave. Transfer the dark chocolate to a piping bag and set aside to cool a little. Top each bun with a spoonful of white chocolate, stack the profiteroles on a plate or cake stand, then drizzle over the dark chocolate and sprinkle with chocolate sprinkles or edible glitter, if you like. Serve straight away."}
{"text": "Heat oven to 190C/170C fan/gas 5. Line 2 x 20cm sandwich tins with foil, then lightly oil the foil. Whizz the nuts in a processor until finely ground.\nWhisk the egg whites in a bowl until they form stiff peaks. Whisk in most of the sugar, a spoonful at a time, until the mixture is stiff and glossy. Stir the rest of the sugar into the nuts, then fold into the meringue with the vinegar. Divide between the tins and level the tops.\nBake for 40-45 mins until firm, then cool in the oven. When the meringues are cold, carefully peel off the foil.\nTo serve, whisk the cream, icing sugar and Baileys together until softly stiff. Put one of the meringues, top-side down, on a plate, then spread with the cream and scatter over the raspberries. Put the other meringue layer on top and dust generously with icing sugar."}
{"text": "Pulse the flour and butter in a food processor until you have fine crumbs. Add the egg yolk and water, and bring together into a ball. Do not knead. Roll the pastry in cling film and chill for at least 1 hr.\nMeanwhile, heat the butter in a pan, then add the leeks. Cook over a low heat for 20-25 mins until soft, stirring often. Season to taste. Stir in the flour, cook for 3-4 mins, stirring, then stir in the milk and cream. Once smooth, simmer for 15 mins to cook out the flour. Season well, then cool. If making ahead, cover the surface with cling film and chill for up to 2 days. Stir the eggs and egg yolks into the mix, along with the grated cheese and the mustard.\nHeat oven to 190C/170C fan/gas 5. Roll out the pastry on a floured surface to about 5mm/¼in thick, and gently lay it over a 23cm loose-bottomed tart tin. Using a small ball of pastry to help, gently press the pastry into the sides of the tin. Trim, leaving a slight overhang. Line the pastry with baking paper, fill with baking beans, then bake for 15 mins. Remove the beans and paper, and bake for 10 mins more or until golden and biscuity. Cool on a wire rack. Turn oven down to 180C/160C fan/gas 4.\nSpoon the leek mix into the case and smooth the top. Bake for 30 mins until set and golden. Rest the tart for 15-20 mins before you slice it, and serve warm. If making ahead, chill the tart. Once cooled, for up to 2 days, or freeze for a week. Defrost in fridge, then warm in the oven for 20 mins before serving."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line a roasting tin with a very generous length of double-thickness foil. Weigh the turkey to calculate the cooking time, allowing 40 mins per kg for the first 4kg, then 50 mins for every kg over that weight (a turkey this size should take 3½-4 hrs).\nPut the butter in a bowl and finely grate the zest from the orange on top. Add the chopped tarragon, garlic and seasoning and mix well. You can make this 3 days ahead.\nGently push your fingers under the turkey skin, starting from the neck end of the bird, easing the skin away from the breast and the top of the drumsticks. Now spread the flavoured butter under the skin, taking care not to tear it. You won’t be able to reach all the way down to the drumsticks, but you can ease the butter along by smoothing it through the skin. Quarter the orange and tuck into the turkey cavity with the onion and the bunch of tarragon (step-by-step). You can do this the night before.\nSeason the turkey with salt and pepper, then lift it onto the foil-lined roasting tin. Pour the wine into the cavity of the turkey, then bring up the sides of the foil and cover the top of the bird with a layer of foil. Roast according to your calculated time.\nThirty mins before the end of cooking time, remove the foil from the top of the turkey and add the potatoes to the oven.\nTo test if the turkey is cooked, pierce the fattest part of the thigh with a skewer – the juices that run out should be clear, not pink. If they are pink, continue to roast, checking at 10-min intervals.\nRemove the turkey, transfer to a warm serving platter and let it rest, covered loosely with the foil, for 30-40 mins before carving. Meanwhile, turn up the oven to 200C/180C fan/gas 6 and cook the potatoes for 30 mins more, with the stuffing and sausages. Serve the turkey decorated with herbs."}
{"text": "Put the rice in a bowl, cover with cold water and leave to soak for 1 hr. Meanwhile, heat 2 tbsp oil in a large pan, add the onion and cook for 10 mins, stirring now and then, until caramelised. While the onion cooks, whizz the ginger, garlic, coriander stalks, spices, lemon juice and zest to a paste in the small bowl of a food processor. Tip into the pan and fry for 5 mins more until aromatic. Scoop the paste and onion out of the pan and set aside, then heat 1 tbsp more oil. Add the sliced sprouts and cook for 8-10 mins, stirring, until softened. Add the paste back to the pan and cook everything together for 1 min more.\nWhen the rice has had its soaking time, drain and tip into a pan, cover with fresh water and season with salt. Simmer for 5 mins until just softening, then drain.\nHeat oven to 200C/180C fan/gas 6. Put the halved sprouts in a roasting tin with 1 tbsp oil and season well. Roast for 20-25 mins, shaking the pan now and then, until the edges are starting to brown and the sprouts are tender.\nMeanwhile, mix the rice in the pan with the sliced sprouts, the onion and paste. Add the pecans and all the cranberries, season and mix well. Heat the butter and remaining oil in the pan you cooked the rice in, then tip in the rice mixture and flatten the surface. Poke 3 steam holes in the rice with a wooden spoon, and turn the heat to almost its lowest setting. Cover the pan with a tea towel, then a lid, and cook for 20 mins until the rice is cooked through - if it is still a little firm to bite, re-cover and cook for a further 5 mins. To serve, tip the cooked rice onto a serving platter, mixing any crunchy bits from the bottom of the pan. Scatter over the roasted sprouts and coriander leaves, and serve with a pot of natural yogurt."}
{"text": "Heat oven to 190C/170C fan/gas 5. In a food processor, whizz together the flour, icing sugar and butter until they form fine crumbs (or rub in with your fingers). With the blades running, add the zest, then 3 tbsp orange juice. Process for a few secs until the mixture forms clumps. If you need to, add a few extra tsps orange juice to bring the pastry together.\nTip onto a very lightly floured surface, knead briefly until smooth, then chill in the fridge for 30 mins or until firm. The pastry can be made up to 3 days ahead or frozen for up to 1 month.\nLightly dust the work surface with flour, then roll out the pastry to approx £1 coin thickness. Cut out 12 x 8cm rounds with a fluted cutter and press into a 12-hole non-stick bun tin. Re-roll the trimmings to the same thickness and stamp out 12 x 5cm rounds for the tops. Spoon about 1 tbsp mincemeat into each base and press on the tops.\nBrush the tops with the egg, then bake for 15-20 mins until golden and crisp. Cool for a few mins, then lever out of the tins with a table knife and cool on a wire rack. Store in an airtight container for up to 1 week. Warm gently to serve, dusted with sifted icing sugar, if you like."}
{"text": "Tip the sugar, butter, dried fruit, whole cherries, ginger, orange zest and juice into a large pan. Pour over the rum, brandy or juice, then put on the heat and slowly bring to the boil, stirring frequently to melt the butter. Reduce the heat and bubble gently, uncovered for 10 mins, stirring every now and again to make sure the mixture doesn’t catch on the bottom of the pan. Set aside for 30 mins to cool.\nStir the nuts, eggs and ground almonds into the fruit, then sift in the flour, baking powder and spices. Stir everything together gently but thoroughly. Your batter is ready.\nHeat oven to 150C/130C fan/gas 2. Butter and line a 20cm round tin with baking paper. Spoon the cake mix into the tin and level the top with a spoon dipped into boiling water. Bake for 45 mins, then turn the oven down to 140C/120C fan/gas 1 and bake for 1 hr-1 hr 15 mins more or until a skewer inserted into the centre comes out clean. Cool on a wire rack. The un-iced cake will keep wrapped in foil for 2 months or will freeze for 1 year.\nTo decorate the cake, thickly roll out the ready-to-roll icing on a surface lightly dusted with icing sugar and stamp out ivy shapes with a cutter. Leave for a few hrs or overnight on baking paper to dry, then rub the surface of the leaves with some of the gold or silver lustre.\nBrush the top and sides of the fruit cake liberally with apricot jam, then drape the marzipan over the cake. Smooth over the surface with your hands to give a snug fit, then trim away the excess marzipan with a sharp knife. Lift the cake onto a serving plate.\nMake up the fondant icing to a spreading consistency, then swirl over the cake to a rough iced effect. Decorate with a cross of ribbon and the ivy leaves while the icing is still wet so that they stick in position, then leave to set."}
{"text": "Heat oven to 190C/170C fan/gas 5. Heat the oil in a large frying pan, then soften the onions, leek and celery for 15 mins with the pan covered. Put the sausagemeat into a bowl. Once the onion mix has cooled, tip onto the sausagemeat, add the sage, bread, egg and seasoning, then mix really well with your hands.\nSet aside 250g to stuff the turkey, then shape the rest into 16 balls, wrapping each with bacon. Sit these on a non-stick baking sheet, cover with foil, then bake for 15 mins. Uncover, then bake 30 mins more until the bacon is golden. Garnish with a sage sprig, if you like."}
{"text": "Grease a loaf tin, a 900g/2lb one is ideal but you can use one slightly smaller or bigger. Line with cling film, then cover just the base with one layer of smoked salmon slices, trimmed to fit neatly.\nWhizz the cream cheese, cream, lemon zest and juice together in a food processor to combine. Scrape out and stir in the dill and chives with some seasoning. Spread an 8th of the cream cheese mixture over as evenly as you can. Top with a layer of salmon slices. Repeat with the cream cheese and salmon - you should be able to do 7 layers of cream cheese (By starting with just an 8th of the mixture, it means as the tin widens you'll have enough to put a bit more as you go further up creating even layers.) Finish with a last layer of salmon (and treat yourself to a smoked salmon sarnie with any trimmings!) Cover with cling film, pressing down gently, then chill overnight.\nTo serve, turn onto a platter and gently peel off the cling film. Scatter with a few dill fronds and serve with lemon wedges and toast."}
{"text": "Peel, core and chop the apples, then put them in a large pan with the spices, sugar, citrus zests and juices. Bring to the boil then cover and simmer for about 10 mins until the apples start to soften. Add the cranberries, raisins and alcohol. Bringto the boil, stirring well, then reduce the heat and simmer for 20-30 mins, uncovered, until thickened. Stir in the apricots, nuts and tropical fruits. Remove from the heat, leave to cool, then pack into sterilised jars."}
{"text": "Heat 1 tbsp of the coconut oil in a large flameproof casserole dish over a medium heat. When melted and hot, add the onion, pepper and garlic. Cook, stirring regularly, for 3 -4 mins or until just starting to soften. Increase the heat to maximum and add the chicken thighs. Fry everything together for about 3 mins, stirring occasionally.\nSprinkle in the spices, squeeze in the tomato purée and fry, stirring almost constantly, for 1 min. Pour in the stock and bring to the boil. Reduce the heat to a simmer and partially cover with a lid. After 30 mins, add the dried apricots and chickpeas, and continue to simmer for a further 10 mins.\nWhile the tagine is bubbling away, heat the remaining 1/ 2 tbsp of coconut oil in a frying pan over a high heat. When melted, add the cumin seeds, toast for 10 secs, then add the shredded sprouts. Fry the sprouts over the high heat, stirring almost constantly, for 5 mins, by which time they should have softened and browned in places.\nServe the tagine in a large bowl, scatter over the fried sprouts, crumble over the feta and finish with the coriander."}
{"text": "Lift the cake onto the cake board or a plate and cover with jam, marzipan and – brushing with water around the sides of the cake only – ready-to-roll icing. Trim at the base.\nPress star cutters gently into the icing, stopping when you get to the marzipan. Pull the star shapes out with the cutter, or ease it out with the tip of a knife. Stamp out a couple of small stars from re-rolled trimmings of icing (from icing the cake) and sit them inside the large star-shaped spaces.\nSprinkle the gold balls into the gaps and tie the ribbon around the cake. Can be decorated up to a week ahead."}
