{"text": "Pile the lettuce, avocado, tomatoes and shallot into a bowl and toss together. Divide between 2 serving bowls, then top with the prawn cocktail. Lightly toss to mix the dressing into the salad, then eat with toast or crusty bread, if you like."}
{"text": "Check the fish for bones and, if needed, remove with tweezers. To make the cure, put the lemongrass, 125g sugar, the salt, lime juice, zest of 1 lime, 1 tbsp rice vinegar, 1 garlic clove, half of the coriander and dill, including stems, into a \n. Blitz until the lemongrass is finely chopped, then stir in a quarter of the sliced chillies. \nCross two large pieces of cling film in a \n and spoon on a third of the cure, then top with the fish. Cover the fish with the rest of the cure. Wrap tightly and leave for 36-48 hrs, then scrape off the cure, rinse the fish in cold water and pat dry. The fillet will feel firm.\nOn the day of serving, start the other elements of the recipe. Shave the turnips into very thin slices using a mandoline, then plunge them into iced water with a dash of the vinegar. Leave for an hour, then drain well. Thinly slice the onion and mix with the turnip slices, 2 tbsp vinegar, 2 tsp sugar and a pinch of salt. Cover and steep for at least 1 hr, or chill for a few hrs.\nFinely chop the remaining dill leaves and stir most of them into the crème fraîche with the remaining lime zest and a little seasoning, then chill.\nFor the dressing, stir together the remaining 2 tbsp sugar, 2 tbsp vinegar, another quarter of the sliced chillies and the crushed garlic and leave until the sugar dissolves. \nSlice the fish into approx 20 slices, taking the \n down to the skin, then easing the blade underneath each piece to remove it.\nWhen ready to serve, spoon and swoosh the dill crème fraîche down the middle of each plate, then top with overlapping salmon slices. Add 3 prawns per serving. Lift the salad from its juices and mound to one side. Scatter with a little extra dill and the remaining sliced chillies, then drizzle the dressing over the fish and prawns (or let your guests do that bit at the table)."}
{"text": "Peel potatoes and cut into even-size pieces (Ivy House used Marfona and allowed 4 pieces per person).\nPut potatoes in boiling salted water. Bring back to the boil and simmer for 10 mins.\nMeanwhile, melt lard in a thick roasting pan in the oven at 220C/fan 200/gas 7. (Ivy House tried both goose fat and butcher’s beef dripping, but found neither as successful as good old lard.)\nDrain the potatoes and put back in the saucepan with a couple of tbsp of semolina. Cover the pan and shake it to rough up the potatoes.\nRemove the baking tray from the oven and put the potatoes in the lard, turning to coat each one in the melted lard.\nReturn the tray to the oven and roast for 40 mins, turning the potatoes 2-3 times as necessary.\nRemove tray from the oven and put the potatoes in a serving dish. Return the dish of potatoes to the hot oven for 10 mins to dry any fat off. Serve straight away – roast potatoes wait for no man!"}
{"text": "First make the dip by mixing together the yogurt and mint with a little seasoning, then chill until ready to serve.\nTip the lamb mince into a big bowl with the spices, chilli, herbs, Worcestershire sauce and egg. Season, then get your hands in and mix well. Divide the mixture into 16. Shape into burgers, pushing a cube of cheese into the centre of each and sealing in. Chill until just before your guests arrive.\nHeat oven to 200C/fan 180C/gas 6 and heat the oil in a frying pan. Fry the burgers for 1-2 mins until brown on each side, then transfer to a baking tray. Put in the oven for 5-10 mins until cooked through and piping hot. Pile onto a big plate and serve with the dip on the side."}
{"text": "Mix canned tuna (drained) with cooked new potatoes, red onion, capers and a handful of rocket or watercress, and toss with a bought fat-free dressing."}
{"text": "Arrange a Jaffa Cake (a good low-fat choice) with a scoop of orange or mango sorbet, and drizzle with a little bought raspberry sauce."}
{"text": "Start by butterflying the prawns. Using a small serrated knife, cut down the back of the prawns through the shells and the flesh from the heads to the tails, cutting just far enough that you can open it up, then remove the black entrails. Once all the prawns are butterflied, set aside.\nCombine all the salsa ingredients in a bowl with some seasoning. Ideally leave the salsa at room temperature for 30 mins so that the flavours can infuse.\nMix all the seasoning ingredients together, along with 1 tsp fine salt and 1/ 2 tsp cracked pepper, in a bowl. Brush the prawns inside and out with the melted butter, then toss in the spice mix. Heat two large frying pans over a high heat, tip in the prawns and cook for 4-6 mins until they have just turned pink and the insides are opaque. Serve on a board with the salsa and lime wedges."}
{"text": "First make the butter. Put the wine and shallot into a pan, then bring to the boil and simmer until nearly dry. Tip into a bowl to cool, mix all the ingredients together, roll into a log, using cling film or foil, then chill to harden. Can be frozen for up to 1 month.\nSnap away the claws from the lobster. Using a large chef’s knife, cut the lobster in half and wash the head cavity under cold water, then dry with kitchen paper. Lay the lobsters, cut side up, on a baking tray. Crack the claws and remove the claw meat. Divide claw meat between the head cavities. This can be done the day before and the lobster kept in the fridge ready for grilling.\nHeat grill to high. Slice the butter into thin rounds and lay it along the lobsters so all the meat is covered. Grill for 5-8 mins until the butter is bubbling and starting to brown. Put the lobsters on plates, pouring any butter from the tray over them. Serve with new potatoes and some dressed salad leaves."}
{"text": "Put all the ingredients, except the sugar, into a large pan and stir well. Bring slowly to the boil, then reduce the heat, cover and simmer for 10 mins, until the plums are tender.\nStir in the sugar plus 2 tsp salt and keep stirring until it has dissolved. Boil the chutney for 20-30 mins, uncovered, stirring occasionally to prevent it catching on the bottom, until it is thick and pulpy.\nPot into sterilised jars (see Know-how, below), seal, label and store for at least 2 weeks before eating. Will keep for up to 6 months in a cool dark place."}
{"text": "The first thing to do is to make a thick white sauce that will be the base of the turnover filling. Bring the milk to a simmer, then add the butter and flour paste. Whisk the paste into the simmering milk and allow it to boil for 3-4 mins, whisking gently all the time to prevent it from catching. You should now have a very thick white sauce. Cool the sauce in a bowl. Fry the mushrooms in the oil for 3-5 mins until golden, then leave to cool.\nPlace the ham, cheese and mushrooms into a bowl, then gradually add the white sauce until everything is well coated. Finally, add the herbs.\nRoll out the pastry on a floured surface to about the thickness of a £1 coin and cut out 4 saucer-size rounds (about 18cm wide), re-rolling the trimmings if you need to. Brush the edges of each round with beaten egg. Spoon the mixture onto 1 side of each round, then fold over and seal the edges well. The turnovers can now be frozen for up to 1 month. Brush the turnover with the remaining egg, then chill for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Place the turnovers on a baking sheet and bake for about 35 mins until puffed up and golden. Leave to cool slightly and enjoy warm."}
{"text": "Tip all the chopped ingredients into a bowl, add the olive oil along with the lime zest and juice and mix well. Set aside for 30 minutes to allow the flavours to mingle.\nTo make fragrant Thai prawns, remove heads and peel shells from 20 raw king prawns but leave tail sections on. Toss in the marinade and cook on a really hot barbecue for 45 seconds on each side until they turn from grey-blue to pink."}
{"text": "Using a small, sharp kitchen knife, stab through the fatty side of the pork loin to make about 30 fairly deep, randomly spaced incisions. Insert a sliver of garlic into each stab mark, pushing the garlic well into the meat and smoothing over the fat to close up the entry points. Reserve a few slivers to push in cuts made on the flesh-side of the joint.\nPut 5 tablespoons of the olive oil, the juice of the lemon, tbsp of fennel seeds and the leaves stripped from 4 oregano sprigs in a large non-reactive dish (a non-porous dish, such as glass or stainless steel, which won’t react with acidic foods and alter the flavour). Grind in plenty of black pepper, then swish everything into a sludge with one clean hand. Put the joint into the dish and massage the marinade into every nook and cranny. Leave the pork to marinade for 6-24 hours in a cool place or the fridge.\nWhen you are ready to start cooking, preheat the oven to 170C/Gas 4/fan oven 150C. Put the 300g of shallots in a heatproof bowl and cover with boiling water. Leave for 2 minutes to loosen the skins, then tip the shallots into a large sieve or colander and rinse under cold water. Trim off the root end, then peel the shallots, breaking any large ones into their natural segments. Halve the 4 celeriac wedges, then cut into large, bite-sized chunks.\nHeat the remaining oil in a large frying pan over a medium heat. Toss in the 130g pack of pancetta and fry for 2-3 minutes until slightly frazzled. Transfer the cubes to a large casserole big enough to take the pork, using a slotted spoon so the fat drains back into the pan. Throw the shallots and celeriac into the frying pan and sauté them for 3-4 minutes until coloured, turning frequently. Transfer them to the casserole, again draining off the oil.\nPull the frying pan to one side. Quickly scrape off any excess marinade from the pork loin, then season the meat with fine sea salt. Replace the frying pan over a medium-high heat and brown the pork on all sides, including the ends. Place the loin on the vegetables in the casserole. Stuff the remaining 4 sprigs of oregano around it.\nPour off and discard all the fat in the frying pan, raise the heat and pour in the 600ml of wine. Bring to the boil, scraping up all the tasty bits from the bottom of the pan. Let the wine bubble and reduce for 3 minutes, then pour into the casserole.\nPlace the casserole over a high heat and bring the juices up to a bubble. Immediately put the lid on the casserole and transfer it to the oven. Cook the loin for 1 hour 45 minutes, turning it halfway through. Remove the casserole from the oven and leave the pork to rest in a warm place for 15-30 minutes, still covered, before carving."}
{"text": "Heat oven to 160C/140C fan/gas 3. Fit the gammon, quite snugly, in a big, deep roasting tin or casserole. Reserve 150ml of the pineapple juice, then pour the rest over the gammon, plus enough water to fill the tin about three-quarters full. Cover tightly with a few sheets of foil, then put in the oven and bake for 4 hrs. About halfway through, check the liquid levels and turn the gammon.\nRemove the gammon and pour off the liquid. Cut away the rind and most of the fat, leaving just a thin layer of fat on the joints.\nWhizz the reserved pineapple juice, allspice, treacle, ginger, ketchup, sweet chilli and honey together to combine to a purée. Spoon all over the gammon and set aside until ready to serve (or, if you’ve made at home before taking to the host’s house, cover and chill for up to 48 hrs).\nTo serve, heat oven to 200C/180C fan/ gas 6. Roast for 30 mins until hot and sticky, then loosely break into large chunks to serve."}
{"text": "Mix the soft cheese with 2 tbsp basil pesto. Take the pack grissini (bread sticks) and halve each one. Cut the prosciutto into strips and wrap around the end of each grissini. Serve alongside the pesto dip. Scatter the pine nuts over dip and drizzle with extra virgin olive oil before serving."}
{"text": "First make the cake: heat oven to 160C/fan 140C/gas 3. Lightly butter a Swiss roll tin and line the base with non-stick baking parchment. Put the whole eggs, egg yolks and caster sugar in a bowl and whisk with an electric hand whisk for 8-10 mins until light and fluffy. Meanwhile, melt the chocolate and butter in a bowl over a pan of almost simmering water, stirring occasionally.\nWhen the whisked egg mixture is light and fluffy, gently fold in the flour with a large metal spoon or the whisk blades, taking care not to lose too much volume. Beat a small amount of the egg mixture into the melted chocolate, then gently fold the chocolate into the remaining egg mixture. Pour into the prepared tin, then tilt the tin from side to side until even and the corners are filled. Bake for 10 mins until firm, then leave to cool completely.\nLine a 1-litre freezer-proof pudding basin with cling film. Cut a small circle of sponge cake to fit the base then cut triangular pieces to line the sides. Fill any gaps with trimmings and save the remaining sponge for later. Place the bowl in the freezer to firm up the sponge.\nMake the ice cream: slice the vanilla pod in half lengthways and remove the seeds. Put the milk, vanilla seeds and pod, orange zest, caster sugar and cream into a medium pan and bring to the boil. Meanwhile, whisk the egg yolks together in a large bowl. Pour the hot cream mixture slowly on to the eggs, whisking all the time. Return the mix to a clean pan and stir constantly over a gentle heat for about 5 mins until the mixture has just thickened. Pass through a sieve and leave to cool for 30 mins. Churn in an ice-cream machine (or make by hand, see 'Try' below). Add the marmalade and continue to churn for another 10 mins until thick.\nScoop the ice cream into the cake-lined bowl, leaving a central indent for the sorbet layer. Sit a small bowl in the top of the ice cream to make a smooth indent for the sorbet later to sit in. Freeze for at least 1 hr, until just firm.\nFill the centre of the bombe with orange sorbet, cover the entire base of the bowl with a layer of sponge, cover with cling film and return to the freezer until needed, or at least 8 hrs ahead. This can be done well in advance and that’s all the really hard work done.\n, grate the chocolate into a bowl and add the golden syrup, butter and warm water. Melt over a pan of just simmering water until melted, stirring occasionally.\nAbout 20 mins before serving, heat oven to 230C/fan 210C/gas 8. Whisk the egg whites and a pinch of salt in a large clean bowl until stiff but not dry. Whisk in the sugar, a little at a time, bringing it back to stiff peaks before each addition. Turn the bombe out onto an ovenproof serving dish and remove the cling film. Spoon the meringue all over the bombe to completely seal it. Using the back of the spoon or a palette knife, pull the meringue into dramatic swirls. Bake for 10-15 mins or until golden. Reheat the chocolate sauce over a pan as before or in a microwaveable bowl for 1 min on Low, stirring halfway through. Take the Chocolate orange bombe Alaska to the table immediately and serve sliced, drizzled with the hot chocolate sauce."}
{"text": "Remove the hard core from the dried figs. Cut a pocket in each with the point of a knife, then stuff each pocket with ½ tsp dolcelatte cheese.\nCut the prosciutto in half lengthways, then wrap up each stuffed fig into a little parcel. Serve scattered with a small handful chopped parsley if you have it."}
{"text": "Heat the oil in a saucepan, add the onions and fry gently for 10 minutes until they are softened and lightly coloured. Add the parsnips and stir well.\nTo make the curry, stir in the curry paste, then add the tomatoes with a little salt, and stir well. Add 1½ canfuls of water and bring to the boil. Reduce the heat, cover and simmer for 15-20 minutes, until the parsnips are just tender.\nTo finish, stir in the turkey chunks, cover the pan again and simmer for a further 5 minutes until the turkey is heated through. Remove from the heat. (The curry can now be cooled and frozen for up to 2 months.) Lightly swirl in the yogurt and serve with basmati rice."}
{"text": "Melt a knob of butter in a frying pan. Once sizzling, add the mushrooms and fry for just a min or two before adding the spinach. Cook on a high heat for about 1 min, allowing the leaves to wilt and soften. Drain the leaves and mushrooms in a sieve or small colander set over a bowl, pressing them gently in the sieve to release the juices (the juices will provide the base for the sauce, so don’t discard them). Keep warm to one side.\nHeat the oil in a separate clean frying pan. When very hot, add the scallops. Sauté for a couple of mins without disturbing them at all, then add a knob of butter to the pan. Turn the scallops, season with salt and pepper, then baste with the sizzling butter. Continue to cook for a further couple of mins until the scallops are ready.\nWhile sautéing the scallops, return the saved spinach juices to the pan the spinach and mushrooms were cooked in, then whisk in the remaining knob of butter to create the sauce. Season with salt and pepper and a grating of nutmeg.\nNow finish in style: Arrange spinach and mushrooms on plates or in bowls, sit the scallops on top, then spoon the nutmeg spinach sauce around."}
{"text": "To make the pastry, rub the butter into the flour until the mixture resembles fine breadcrumbs. Add the icing sugar and orange zest. Spoon in 4 tbsp water, mixing with a knife until the dough starts to come together. Knead lightly, flatten into a disc, wrap in cling film and chill for at least 30 mins.\nHeat oven to 180C/fan 160C/gas 4. On a lightly floured work surface, roll the pastry out to a 2-3mm thickness. Using a 9-10cm fluted cutter, stamp out discs from the pastry. Re-roll any trimmings and stamp out more discs until the pastry is used up. Line two 8-hole muffin tins with the pastry discs, then fill each pastry shell with 1 heaped tsp mincemeat and spread out to smooth. Can be frozen, uncooked, in trays for up to 1 month.\nCombine the crumble ingredients in a small bowl, then sprinkle a little over the top of each mince pie. Bake on the middle shelf of the oven for about 20 mins until the pastry is cooked and golden brown. Cool in the tins for 5 mins, then serve with brandy butter or crème fraîche."}
{"text": "Heat the oil in a wok. Add the ginger and garlic, then stir-fry briefly until just coloured. Add the prawns and the whites of the spring onions, and cook for a further 3 mins. Pour in the beaten egg, let it set for a couple of secs, then break it up and stir well to scramble. Add the cooked rice and stir-fry everything together for 10 mins. Add the rest of the spring onions, rice wine and soy, then toss everything together well. Serve immediately."}
{"text": "Heat a large non-stick frying pan, then brown the sausages for 3-5 mins over a high heat. Drain the beans, then add to the pan with the chopped tomatoes, herbs and sugar. Season well and bring to the boil. Simmer for 10 mins until the sausages are cooked through and the sauce has thickened, coating the beans."}
{"text": "Heat oven to 200C/180C fan/gas 6. Roll out the puff pastry to a large rectangle. Spread the goat’s cheese over the pastry. Roughly chop the peppers and walnut pieces, then sprinkle over the cheese. Roll up one edge of the pastry into the centre, then repeat with the opposite edge to meet in the middle. Cut into 20 slices, place on a baking tray and bake for 10-12 mins until golden."}
{"text": "Put the vinegar, 300ml water, sugar and spices in a very large pan. Heat, stirring, until the sugar dissolves then add the rest of the ingredients with a tsp of salt.\nBring back to a simmer then simmer uncovered for 2 1/2 hours until darkened, thick and chutney-like.\nTo sterilise the jars, wash thoroughly in very hot soapy water. Rinse in very hot water then put on a baking sheet in a 140C/fan 120C/gas 1 oven until completely dry.\nPour the chutney into the sterilised jars while still hot, seal and leave in a cool dark place for at least 3 weeks before opening."}
{"text": "The day before, use a very sharp knife to score the skin of the pork in a criss-cross fashion at 1cm intervals. (Ask your butcher to do this if you prefer.) Combine the garlic, paprika, oil, lemon juice and 1 tsp salt in a mixing bowl. Rub this marinade all over the pork, cover and leave in the fridge for 12-24 hrs.\nThe next day, heat oven to 220C/ 200C fan/gas 7. Put the potatoes in a roasting tin to make a trivet for the meat, trimming them flat if you need to. Sit the pork on top, then pour any marinade plus ½ a cup of water over the pork. Cook for 30 mins to start the crackling crisping up. Now turn down the oven to 150C/130C fan/gas 2, cover the tin with foil and cook for 3½ hrs. Remove from the oven and leave to rest for 30 mins. Serve with apple sauce, see below."}
{"text": "Rub the butter, flour and parmesan together in a bowl until the mixture has the consistency of fine breadcrumbs. Add the egg mix and quickly bring it all together into a dough. Knead lightly a few times with floured hands until smooth. Shape into a flat ball, cover in cling film and chill for at least 1 hr.\nHeat oven to 200C/fan 180C/gas 6. Roll the pastry out to the thickness of a £1 coin and line eight 10cm x 3cm tartlet tins. Fill with greaseproof paper and baking beans, and bake for 7-10 mins until the pastry feels dry. Remove beans and paper, then bake for 2-3 mins, until lightly golden. Leave to cool.\nReduce oven to 180C/fan 160C/gas 4. Heat the olive oil in a frying pan and fry the onion for 3 mins until softened, but not coloured. Add the garlic and bacon, and cook for 2-3 mins. Allow to cool slightly. Meanwhile, whisk the eggs and cream with the chives, then fold in the onion, bacon and mussels. Season to taste. Set the cases on a baking sheet. Spoon the mix in and scatter the brie over the top, pushing into the mix here and there. Bake for 12-15 mins until the filling is just firm and golden. Serve warm with dressed leaves."}
{"text": "Heat oven to 200C/fan 180C/gas 6, then toss the potato chunks with the oil and some seasoning on a baking sheet. Roast for 20-30 mins until golden and crisp on the outside, then leave to cool.\nTo serve, mix the mayonnaise with the lemon juice. Pile a scrunched up piece of ham on each potato, then top with a blob of the lemony mayo. Arrange on a platter with the watercress, then serve."}
{"text": "Take four 200ml soufflé dishes and brush them completely with softened butter. Chill the dishes for 5 mins, then, as an insurance policy so the soufflé doesn’t stick to the dish, apply a second coat as before. Tip a little grated chocolate into each dish, roll the dish around tilting it as you do so it is evenly lined all round.\nFor the crème patisserie, mix the flour, sugar and cornflour. Put egg yolk and whole egg into a bowl, stir, then beat in half of the flour mixture to give a smooth paste. Tip in the rest of the flour mixture and mix well.\nPour the milk and cream into a pan and bring just to the boil. Remove from the heat. Add the chocolate and beat until it is melted and smooth with no lumps.\nGradually stir hot chocolate mix into paste. Return to pan. Cook, stirring, over a medium-low heat for 5 mins to a smooth, thick paste. Remove from the heat. Leave until cold, beating occasionally with a wire whisk.\nMake the ganache: slowly warm the cream in a pan. Just before it boils, take off the heat and add chocolate. Beat constantly to a velvety texture, gradually sprinkling in the cocoa as it dissolves. Allow to cool.\nHeat oven to 190C/fan 170C/gas 5. Whisk the egg whites to soft peaks with an electric whisk. Sprinkle in the sugar as you are mixing. Keep whisking to give stiff, firm peaks to give volume to the soufflés.\nMix crème patisserie and ganache in a large bowl. Stir in 2 tbsp of egg white. Carefully fold in a third of the rest, cutting through the mixture. Fold in another third (take care not to lose the volume); fold in the rest.\nSpoon the mixture into the dishes to fill them by three-quarters, then gently press a spoon in to make sure it fills all the gaps. Fill the dishes to the top with the mixture, then bang each dish on to the surface so the mixture fills the sides.\nTake a palette knife and pull it across the top of each dish so the mixture is completely flat. Take a little time to wipe any splashes off the outside of each dish, or they will burn on while cooking.\nSo mixture won’t stick to the top of the mould, and to give a straight finish, go around the top edge of the mixture with your finger. Sprinkle a little grated chocolate in the centre, then bake the soufflés for 15-17 mins.\nThe soufflés should have risen by about two thirds of their original height and jiggle when moved, but be set on top. To serve, make a small dip with a spoon in the centre of each, then pour in single cream or add a spoonful of ice cream."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Heat 1 tbsp oil in a large pan, then fry mushrooms for 4-5 mins, stirring occasionally, until lightly browned. Remove with a slotted spoon, then set aside. Add remaining oil to the pan, then fry the celery, onion and garlic over a low heat, stirring occasionally, for 5-6 mins. Add wine, stock and thyme and bring to the boil. Simmer for 30 mins.\nAdd the port and redcurrant jelly. Bring back to the boil, then boil for 10 mins until reduced by half and thick and syrupy. Season to taste, discard the thyme and stir in the mushrooms. Simmer for 5 mins.\nMeanwhile, pull the tops off the brioche and reserve, then pick out dough from the centre to leave a thick shell. (Process remaining dough to make breadcrumbs, then freeze for future use.) Place rolls on a baking sheet, then bake for 5-7 mins until hot and crisp.\nSpoon the mushroom mixture into the brioche rolls, then garnish with the flat-leaf parsley. Serve immediately with any remaining gravy, potato wedges and green beans."}
{"text": "Pour the chicken stock into a large pan and bring to the boil. Add the rice and turkey, bring back to the boil and simmer for 12-15 mins until the stock has been absorbed and rice is tender.\nMeanwhile, put the spinach in a colander and pour over a kettle of hot water to lightly wilt. Keep the spinach and carrots separate, but dress both with the sesame oil and seeds.\nCover the cooked rice with a lid and leave to sit for a couple of mins. Meanwhile, heat vegetable oil in a non-stick pan set over a high heat. Fry eggs so the white crisps up nicely round the edges.\nSpoon the rice into large bowls and arrange the spinach and carrots on top. Finish each with a fried egg and a dollop of chilli sauce. Serve immediately."}
{"text": "Put the beef, bacon, carrots, onions, celery, garlic, thyme, bay leaf and orange zest into a large shallow bowl. Pour in the port, cover with cling film and leave in the fridge to marinate overnight.\nMeanwhile, for the beetroot, pour the wine into a saucepan, then add the vinegar, sugar, fennel, garlic, ginger and chilli and bring to the boil. Reduce the heat and simmer for 30 minutes. Cut the beetroot into wedges and put in a large bowl. Pour the hot wine mixture over the beetroot. Allow to cool, then cover and leave in the fridge to marinate overnight.\nDrain the meat and vegetable mixture, reserving the marinating liquid. Separate the meat from the vegetables as best you can and set the vegetables aside. Heat the oil in a large casserole dish or saucepan and fry the beef pieces in batches over a high heat for 3-4 minutes until just browned. Remove with a slotted spoon and set aside.\nAdd the reserved vegetable mixture to the casserole and cook for 3-4 minutes until the onion is softened. Add the flour and cook for 1 minute, stirring continuously. Return the beef to the pan with the reserved marinade and the stock and season well. Bring to simmering point, cover and gently cook for 11⁄2 hours until the beef is tender.\nCarefully remove all the beef and vegetables from the pan, using a slotted spoon, and set aside. Drain the marinade from the beetroot and add it to the cooking juices in the pan. Bring to the boil and simmer for 5-6 minutes until the sauce has slightly thickened and has a coating consistency. Return the meat and vegetables to the sauce, then stir in the beetroot. Heat through for 2-3 minutes and serve."}
{"text": "Combine the Pimm’s and brandy with the apple juice in a jug filled with ice, cinnamon sticks and a sliced apple and orange."}
{"text": "Warm the blinis following the pack instructions. Mix together the crème fraîche and mustard and spoon onto the blinis. Fold the beef on top then add the cornichons. Arrange the blinis on a platter, grind over some black pepper and serve."}
{"text": "Put 100g cranberries in a saucepan with the redcurrant jelly and sugar. Simmer for 5 mins, then leave to cool. Meanwhile, put a pan of water on to simmer and butter a 1.4 litre/2½ pint basin. Butter a large sheet of baking paper, sit on a same-size sheet of foil and fold a leat in the middle. Beat all the sponge ingredients together, then stir in the remaining cranberries. Spoon a third of the cranberry and redcurrant mix into the bowl, then spoon the sponge mix on top.\nCover with the paper and foil, tie with string and steam, lid on, for 1½ hrs. To serve, reheat the cranberry mix and pour over the top of the turned-out pudding. Can be made up to 2 days ahead and re-steamed for 30 mins or microwaved for 5 mins on High. 3 To make the custard, put the chocolate into a microwave-proof bowl, add the custard and heat according to pack instructions, stirring every 30 secs until the chocolate has melted."}
{"text": "Soak the gelatine in cold water to soften it. Heat the orange juice in the microwave for 1 min. Squeeze the excess water from the gelatine, add to the hot juice and stir to dissolve. Set aside to cool.\nPut the egg yolks, sugar and orange zest into a bowl and whisk over a pan of hot water for 10 mins until thick and foamy. Remove from the heat and continue whisking until completely cool.\nFold the gelatine, orange mix and liqueur, if using, into the egg yolk mixture. In separate bowls, whisk the egg whites and cream until both are softly stiff, then gently fold into the orange mix. Spoon into 8 cocktail glasses and chill until set. Will keep, covered, for 2 days.\nA couple of hrs before serving, make the caramel oranges. Heat the sugar in pan with 2 tbsp water. When the sugar has dissolved, turn up the heat and cook until pale golden. Add the oranges (take care as the sugar will splutter) and swirl them round the pan to coat them in the caramel. Allow to cool. Spoon a couple of orange segments and some caramel juice on top of each mousse and serve with crisp biscuits on the side."}
{"text": "Quarter, core, then thinly slice the apple into a bowl with the lemon juice and 1 tbsp water. Toss well, as this stops the apples going brown.\nHeat grill to high, then line your grill rack with foil. Put the cheeses rind-side down on the foil, then set aside for a moment.\nDrain 2 tbsp of the juice from the apple bowl into another small bowl and discard the rest. Add the cranberry sauce, oil and honey with some seasoning, and whisk to form a dressing. Grill the cheeses for 4 mins, then scatter the nuts on and around the cheeses and return to the grill to cook for a few mins more – but take care that the nuts don’t burn.\nArrange the apple, chicory and radish sprouts or watercress on 6 plates, then carefully top with the hot melted cheese. Scatter over the nuts, spoon over the dressing and serve straight away."}
{"text": "Put the cream in a small pan, then bring just to the boil. Put chocolates in separate bowls, then divide the butter between each. Tip half of the cream over each bowl of chocolate. Leave for about 1 min then stir until melted and smooth. Allow to cool.\nDivide the shortbread, fruit and orange zest between the bowls, stir, then chill for at least 4 hrs until firm.\nUsing a teaspoon, scoop out the mixtures and form into small truffles. Sift the icing sugar onto a plate and roll the white chocolate truffles in it. Do the same with the cocoa and the dark chocolate truffles, then chill until needed. Can be made up to a day ahead."}
{"text": "Heat oven to 200C/180C fan/gas 6. Place the chipolatas in a roasting tin with vegetable oil and cook for 15 mins. Mix cranberry sauce with ground ginger and 1 tbsp water. Pour over the sausages and return to the oven for a further 5 mins or until sticky and golden."}
{"text": "Pour the port into a large pan with 600ml water, add the sugar and cinnamon, then heat until the sugar dissolves. Add the pears, bring to the boil, then cover and simmer for 20-30 mins until tender all the way through. They are ready when a cocktail stick can be easily pushed through each one. Depending on the size of your pan, you may need to cook the pears in 2 batches using the same port syrup, or turn the pears several times as they cook so they become an even colour. Let the pears cool in their syrup, preferably overnight to allow the syrup to really stain them. Will keep for 3 days in the fridge.\nCheck the consistency of the syrup. If it is very thin, boil it in a pan to reduce the amount and concentrate the flavour.\nTo serve, whip the cream with the sugar and vanilla until it holds its shape, then fold in the meringue. Sprinkle with the cinnamon. Arrange the pears in a shallow dish and spoon over the syrup. Allow guests to help themselves to both pears and cream."}
{"text": "Place the fish fillets in a large, wide saucepan and pour over the milk. Add the onion wedges and bay leaves, tucking them in around the fish. Bring to a very gentle simmer, then cover with a lid and remove from the heat immediately. Leave to stand and infuse for 10 mins or until the fish is just cooked. Drain the fish in a colander over a large jug to reserve the infused milk, then tip the fish into a bowl. Set aside.\nMeanwhile, make the topping. Put the potatoes in a large saucepan of cold water, bring to the boil, then simmer for 15 mins or until the potatoes are soft but not falling apart. Drain well, return to the pan and mash with the butter, half the cheese and the crème fraîche until smooth. Season to taste and set aside.\nTo finish the filling, melt the butter in a medium saucepan and stir in the flour. Cook for a few secs, then gradually add the infused milk, stirring over a medium heat for 3 mins until the sauce is smooth and thick. Stir in the spinach and wine or vermouth, if using, and cook for 2 mins more. Remove from the heat and stir in the dill. Season to taste.\nHeat oven to 200C/180C fan/gas 6. Spoon a third of the sauce into the base of a 3-litre shallow rectangular dish. Scatter half the fish fillets over the sauce, breaking them into chunky pieces and discarding the skin, any stray bones, onion and bay leaves as you go. Pour over another third of the sauce, then top with more fish. Continue the layers once more, finishing with sauce.\nSpoon the potato over the fish mixture, starting at the edges. Swirl the potato with the back of a spoon and sprinkle over the remaining cheese. Place the dish on a baking tray and bake in the centre of the oven for 45 mins or until the potato is golden and the filling is bubbling."}
{"text": "Cover the cake with marzipan and white icing. (See step 5 for more information).\nKnead the ready-to-roll icing, then split into three balls. Leave one ball white, and knead a little green colouring into the other two to give two different shades of green. Roll out each ball to about 5mm thick on a work surface lightly dusted with icing sugar. Stamp out about 15 tree shapes using tree cutters, then leave to dry for a few hours or overnight.\nOnce firm, lift half of the trees onto a cooling rack. Combine the 200g icing sugar and egg white to make an icing, then drizzle it over the trees with a teaspoon. Scatter with edible sparkles and leave to dry again until solid.\nPut a little icing on the back of each tree and press the trees around the edge of the cake, overlapping some to give a 3-D effect. Scatter the sweets over the top of the cake to finish. Can be iced up to a week ahead.\nTo cover a cake with marzipan, first brush the cake all over with a thin layer of warmed apricot jam. Dust the work surface with icing sugar, then roll out the marzipan evenly until you have a 5mm- 1cm thick round, about 40cm across for a 20cm cake. Lift over the cake, using a rolling pin to help, then smooth with your hands and trim off the excess. Leave to dry overnight or for a few hours. Lightly brush the marzipan all over with cooled, boiled water. Roll the icing out as you did the marzipan, then smooth with your hands, trim off the excess and leave to dry."}
{"text": "Cut the rye bread into 18 squares in total. Mix the mustard and mayonnaise and spread a little on each square of rye. Cut the salt beef into 18 pieces and the cornichons in half. Top each rye square with a piece of beef and a cornichon half."}
{"text": "A few hours before you want to cook the pork, remove it from the fridge and dry the skin thoroughly. Leave unwrapped in a cool place to slowly come to room temperature while you make the stuffing.\nPut a large saucepan over a medium heat and add the butter. When it begins to sizzle, add the leeks and cook until they are soft and most of their liquid has evaporated. Stir in the apricots and thyme, season well and transfer to a bowl to cool. When the mixture is cold, stir in the breadcrumbs. Taste and season again if required.\nWhen you are ready to cook the pork, heat oven to 220C/200C fan/gas 7. Spoon the stuffing into the pocket your butcher has left for you. Wipe any stuffing from the skin, put the pork in a roasting tin and season the skin well with salt. Put the celery, onion and carrot in the tin around the pork, place in the oven and cook for 30 mins.\nReduce heat to 140C/120C fan/ gas 1 and cook the pork for a further 2 hrs 30 mins. Transfer the pork to a warm serving dish to rest while you finish the gravy.\nTip out any fat from the roasting tin and reserve for another dish. Put the roasting tin on a medium heat, add the white wine or cider and, using a wooden spatula, scrape the caramelised juices from the bottom of the pan and allow them to dissolve. Let the juices reduce by half.\nAdd the stock and simmer for 5 mins. Add the flour and butter, mashed together, and whisk them into the gravy. Taste for seasoning, then strain into a warmed jug. If your pork skin has not crackled, put under a hot grill for a few mins, turning every 30 secs or so, until bubbled and crackling."}
{"text": "In a medium-sized bowl, mix the soured cream, mayonnaise, blue cheese, white wine vinegar, Worcestershire sauce and some seasoning. Pour into a serving bowl and use as a dip for the celery sticks."}
{"text": " together the vinegar, honey, orange zest and juice and olive oil. Season to taste, then set aside. \nThinly slice the bottom third of each chicory heart, then separate the leaves. Put in a bowl and mix with the salad dressing. To serve, scatter over the pumpkin seeds and parmesan shavings."}
{"text": "Soak citrus peel, raisins, pine nuts and cherries in the sherry or brandy overnight until plump. Measure 140g/5oz of the fl our in a large mixing bowl and mix with the yeast. Tip the remaining flour and salt into a separate bowl and set aside. Heat the milk until just warm, make a well in the centre of the flour mix, and gradually add the milk to form a batter, beating until smooth. Cover with a tea towel and leave for 20 mins, until frothy.\nIn another bowl, beat butter, sugar and zests until light and fluffy. Add the eggs, a little at a time, beating well after each addition. Don’t worry if it curdles, this won’t affect the final cake. Stir the mix into the batter, along with the remaining flour, to make a dough. Turn out onto a floured surface and knead for 5 mins, until smooth and elastic. Knead in the fruit mix, a bit at a time, kneading after each addition until evenly distributed. This bit is messy, but dust the dough and your hands with flour as you work.\nPop the dough into a clean bowl and cover. Leave for 2 hrs, until doubled in size. Butter a large baking sheet. Knead the dough again briefly, then shape into a sausage, about 50cm long. Curl onto the baking sheet to make a ring, pinching the ends to join. Tuck the trinket under the cake, cover and leave for 1 hr, until doubled in size. Heat oven to 190C/fan 170C/gas 5.\nSlice the candied fruits and crush the sugar lumps into small pieces (put them in a cup and use the end of a rolling pin). Brush the top of the ring with egg and decorate with candied fruits and sugar. Bake for 45 mins, then transfer to a wire rack and brush the top with jam. Leave to cool before cutting."}
{"text": "Fry the chorizo in the olive oil with the crushed potatoes, garlic and rosemary. Allow the chorizo to form a crust before turning.\nMeanwhile, fry the eggs the way you like them. Mix the potatoes with the parsley and a light dusting of smoked paprika. Serve the eggs on top of the potatoes with a further dusting of paprika, if you like."}
{"text": "Put the sugar, the orange zest, juice and chunks, cinnamon and nutmeg in a pan with 300ml/1⁄2pt water and bring to the boil. Simmer for 10 mins to infuse the spices, then add the wine and apple slices and bring to a simmer. Serve in heatproof glasses."}
{"text": "Butter a 1 litre pudding basin. Mix the breadcrumbs, golden syrup and ginger syrup and place in the bottom of the basin.\nTo prepare the steamer, put a small, upturned saucer or trivet into a large saucepan big enough to fit the pudding basin. Put the kettle on.\nIn a large bowl, beat the butter and sugar until pale and creamy. Add the beaten eggs, vanilla and lemon zest, then sieve the flour and ginger into the mixture. Fold everything together with a big spoon or spatula. Fill the pudding basin with the sponge mixture.\nCut out large sheets of greaseproof paper and foil, big enough to fit over the basin with a 2in overhang. Sit greaseproof on foil, fold a pleat into the middle, then butter the greaseproof. Put, butter-side down, over the pudding, and tie tightly under the rim with string. Sit the basin in the saucepan, add enough water from the kettle to come halfway up the basin sides, cover with a lid and simmer gently for 1 hr 45 mins.\nMeanwhile, candy your clementine slices by pouring 100ml water from the kettle over the sugar in a small frying pan. Heat until melted, then add the clementine slices and bubble until they are shiny and sticky with sugar. Lift out with tongs and set aside on baking parchment to dry.\nCheck the pudding is cooked by inserting a metal skewer – there should be no raw mixture on the skewer, but you may find a little sticky syrup from the bottom.\nFor the topping, put the syrups in a small pan and bubble to thicken for a few mins, then stir in the ginger chunks and a few clementine slices. Turn the pudding out onto a serving plate and spoon over some syrupy ginger topping. Serve with crème fraîche and custard."}
{"text": "Set your \n to medium. Place the gammon joint in and cover with the cola. Add 1 chopped carrot, 1 quartered onion, 1 chopped celery stick, 1 cinnamon stick, ½ tbsp peppercorns and 1 bay leaf.\nCook for 5½ hrs on low until the gammon is tender but still holding its shape, topping up with boiling water if necessary to keep the gammon fully covered.\nCarefully pour the liquid away, then let the ham cool a little while you heat the oven to 190C/170C fan/gas 5. Lift the ham into a \n, then cut away the skin leaving behind an even layer of fat. Score the fat all over in a criss-cross pattern.\nMix the maple syrup, mustard, vinegar and ground cloves or five-spice in a jug. Pour half over the fat, roast for 15 mins, then pour over the rest and return to the oven for another 30 mins.\nRemove from the oven and allow to rest for 10 mins, then spoon more glaze over the top. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Heat a non-stick frying pan over a medium-high heat, add the onions, thyme leaves, mustard seeds and 1 tbsp water, and cook for 10-15 mins. If the onions start to catch, add a splash more water. Once the onions are soft, add the vinegar and bubble for 1 min.\nMeanwhile, bring the stock to the boil in a medium pan. Add the celeriac and parsnips, and simmer for 6 mins, stirring occasionally. Layer the vegetables with the onions in a large ovenproof dish. Pour over enough stock to come halfway up the vegetables, then bake for 30 mins until golden and cooked through."}
{"text": "Shred the fennel thinly. Place in cold water for 1 hr until crisp, then drain and pat dry. Meanwhile, bring a large pan of water to the boil, then blanch the shredded cabbage, white cabbage first, in boiling water for 2 mins. Drain, then cool quickly under cold running water. Shake dry.\nSlice the celeriac thinly, then cut into sticks. Blanch in boiling water with half the lemon juice for 2 mins, then drain and cool under cold water. The veg can be prepared up to 2 days ahead and kept bagged in the fridge.\nWhen ready to serve, core and thinly slice the apple and toss with the remaining lemon juice. Beat together the mayonnaise, oil, vinegar and mustard and season to taste. Mix all the vegetables with the apple, parsley and spring onions in a big bowl, then mix in the dressing. Mound into a serving bowl and sprinkle with the seed and nut mix, if using."}
{"text": "Heat the oil in a large saucepan and tip in the shallots, garlic, carrot, celery, leeks and bacon. Cook over a medium heat for 5-7 minutes, stirring occasionally, until softened but not browned.\nPour in the stock, then add the bay leaves and oregano or marjoram. Season and bring to the boil, then cover the pan and simmer gently for 15 minutes. Tip in the beans, cover again and simmer for a further 5 minutes.\nPour the soup into a freezer container and leave it to cool completely, then seal, label and freeze for up to a month.\nDefrost the soup at room temperature for 3 hours, (or overnight).\nTip into a saucepan, reheat gently until bubbling, and simmer for 5 minutes. Taste for seasoning. Swirl in the chopped parsley, ladle into warm bowls and top each with a drizzle of olive oil and a parsley sprig."}
{"text": "A day ahead, put the raisins in a small bowl, pour over enough brandy to cover, then leave to soak for 1 hr. Pour the wine and port into a small, deep saucepan, tip in the shallots and garlic, then simmer until reduced by two-thirds – about 10 mins. Remove from the heat and pass through a fine sieve, pressing to extract all the juices. Allow to cool. Melt the 200g butter, then leave to cool slightly.\nIn a food processor, blend the chicken livers until smooth, then add the wine reduction followed by the eggs, the cooled melted butter, 1 tsp salt and ½ tsp black pepper. Pass through a fine sieve into a jug, stir in the nuts, then set aside. Heat oven to 160C/140C fan/gas 3.\nDrain the raisins, then divide them between 6 x 125ml ramekins. Pour the chicken liver mixture over, leaving a small space at the top of each one. Stand the ramekins in a small roasting tin (or similar ovenproof dish with sides to make a bain-marie) then pour in enough hot water to reach two-thirds of the way up the sides. Cover with foil and bake for 35-40 mins. To check when cooked, push a fine knife blade into the centre and, if it comes out hot and clean, the pâté is ready. If not, continue to cook, but don’t overcook or let them soufflé up or the texture of the pâté will be grainy.\nRemove from the bain-marie, then pour a thin layer of clarified butter over each dish to seal. Scatter over a few extra raisins and pistachios to garnish as the butter is setting. Leave to cool, then refrigerate for up to 3 days.\nTo serve, put each ramekin on a plate with toasted walnut bread and a few dressed salad leaves."}
{"text": "Trim the tops off the mini meringues. Softly whip the double cream with the icing sugar and divide this between the meringues. Top each with ½ tsp sweetened chestnut purée and dust with icing sugar before serving."}
{"text": "Mix the Martini and gin together and chill or store in a bottle if making ahead. If you have room in your fridge or freezer, chill your Champagne glasses, too.\nWhen your guests are due to arrive, spoon ½ tsp icing sugar into 8 Champagne glasses. Pour over the Martini mixture, mix with a spoon and add the frozen raspberries. Top up with the sparkling wine just before serving."}
{"text": "Flake the hot-smoked salmon into a bowl, discarding the skin. Add the horseradish, lemon juice, soft cheese, finely snipped chives and some seasoning and beat well until combined to a rough mousse texture.\nLay 2 sheets of cling film overlapping on your work surface, then lay the sliced smoked salmon out to make a rectangle about 20 x 50cm. Dollop the hot-smoked salmon mix over and gently spread over evenly. Use the edge of the cling film to roll the long side of the rectangle into itself, then roll up like a Swiss roll. Wrap in the film, twisting the ends like a cracker to secure and hold the shape. Freeze for up to a month.\nTransfer the roll from the freezer to the fridge the day before you want to serve it. While still semi-frozen, cut into thick slices, lay on a tray, then leave to defrost completely in the fridge. Serve with leaves mixed with chives and a little dressing, and some melba toast."}
{"text": "Whisk together the grapefruit zest and juice, oil, vinegar, sugar and dill to make a dressing. Mix half with the prawns and allow to marinate for 10 mins.\nJust before serving, gently toss the cucumber, shallots, frisée and rocket with the remaining dressing. Add a pile to each of 6 starter plates, along with the prawns and grapefruit segments. Scatter over the pomegranate seeds and serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. Break the cauliflower into florets, drizzle with oil and toss with the paprika. Spread out in a roasting tin and roast for 40 mins until just tender. Allow to cool slightly.\nMeanwhile, rinse the rice and lentils, then put them in a saucepan with twice their volume of water. Cover and bring to the boil, reduce to a simmer and cook for 25-30 mins. Drain and rinse under cold water.\nTo make the dressing, whisk together all the ingredients. Season and pour over the rice mixture while slightly warm, then stir in the cauliflower, raisins and parsley."}
{"text": "Toss onion in 2 tbsp oil with thyme and seasoning; roast for 25-30 mins. Remove from oven, melt in crème fraîche, Add nutmeg, cloves and seasoning. Toss in bread and walnuts. Drizzle over remaining oil. Return to oven for 40 mins, until bread chunks are crisp. Toss through the parsley and serve."}
{"text": "Select 4 slices of salmon and use to line four ramekins, allowing the slices to drape over the edges. Finely chop the remainder and put in a bowl. Trim the fronds from the fennel and finely chop. Add the chopped fronds to the chopped salmon along with the crème fraîche, 1 tbsp lemon juice and seasoning. Mix well, then divide between the lined ramekins. Fold over any overhanging salmon and cover with cling film. Chill until ready to serve.\nHalve, quarter and core the fennel, then shred as finely as you can. Put in a bowl with the remaining lemon juice, 3 tbsp walnut oil and seasoning. Put a few lettuce leaves on each plate and scatter over the dressed fennel. Invert the salmon onto the plates, then scatter over the chopped walnuts. Drizzle with the remaining oil, season with black pepper and serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the potatoes on a baking tray and bake for 50 mins until really soft. Leave to cool.\nScoop the potato flesh into a food processor, discarding the skins. Add the oil, paprika, vinegar, coriander or parsley and some seasoning and whizz to a smooth paste. Transfer to a bowl, cover with cling film and chill until needed. The dip will keep for 2 days in the fridge – just bring to room temperature before serving.\nCook the chorizo in a small frying pan for 10 mins until cooked through. Drain on kitchen paper. Scatter extra coriander or parsley over the dip and serve with the chorizo and chicory leaves for dipping."}
{"text": "Mix the lamb with the cumin, coriander, garam masala and cinnamon. For the tzatziki, mix the Greek yogurt, shallot, garlic, mint, cucumber and honey. Sprinkle with pomegranate seeds. Cook the lamb under a hot grill for 8 mins, turning halfway. Thread each piece onto a cocktail stick. serve with tzatziki."}
{"text": "Heat oven to 180C/fan 160C/gas 6 and line the base of a 20cm square shallow baking tin with baking parchment. Melt 100g dark chocolate, all of the milk chocolate and the butter in a heatproof bowl over a pan of simmering water. Remove from the heat, then stir in the sugars. Cool a little while you prepare the rest of the ingredients.\nStir the eggs into the chocolate mixture, followed by the flour, walnuts and a pinch of salt until really well combined. Pour the mixture into the prepared tin, then bake for 25-30 mins until an inserted skewer comes out with sticky crumbs. Cool in the tin.\nFor the dip, gently melt the remaining chocolate as above, then stir into the yogurt and chill. To serve, cut the brownies into chunks, then spoon the dip into small bowls."}
{"text": "Heat oven to 160C/140C fan/gas 3. Heat the oil in an ovenproof pan (one with a tight-fitting lid) or flameproof casserole dish over a high heat. Cut the ox cheek into 4 large chunks, then season well and toss in the flour and mustard powder. Place the pieces of meat in the hot oil – they should sizzle – and brown the meat all over. Add the onion to the pan and continue cooking until softened and starting to caramelise. Add the thyme, stock cube, porcini and some seasoning. Pour 450ml water into the pan, stirring to scrape any meaty bits off the bottom. Cover with a lid and place in the oven to cook for 3 hrs, turning the meat over in the liquid once while cooking, and topping up with a splash of water if the pan looks dry.\nWhile the meat cooks, melt the butter in a pan. Add the garlic, stir for 1 min but don’t brown, then add the mushrooms and cook for 10-12 mins until the pan is dry and the mushrooms are turning golden. Season and set aside.\nWhen their cooking time is up, scoop the ox cheeks out of the liquid and use 2 forks to shred the meat – discard any bits of fat or sinew. Strain the cooking liquid. Add 3-4 tbsp of the liquid back to the meat, along with the cooked mushrooms. Cool, then chill the meat mixture and the cooking liquid for 3 hrs, or up to 48 hrs.\nRoll out the pastry on a floured surface to the thickness of a £1 coin. Cut out 2 x 12cm circles and 2 x 15cm circles – use 2 plates to cut around if you can. Arrange the prosciutto in pairs on top of the smaller circles of pastry, in a cross shape. Split the meat mixture in half and mount each portion on top of the prosciutto. Fold the prosciutto over the meat to encase it, then flip the little parcel of meat over, so the smooth side is facing up on top of the pastry. Brush the edge of each pastry circle with a little beaten egg, then place the larger circles of pastry on top. Use your hands to create a domed centre, then crimp the edges with a fork (or your fingers) to seal in the meat. Score the pastry in a criss-cross pattern, then brush all over with beaten egg.\nUse any pastry scraps to cut out a heart for each pie, stick this on top and brush with egg too. Poke a steam hole on either side of each heart. Place each Wellington on a square of baking parchment and chill for at least 30 mins, or up to 24 hrs.\nHeat oven to 200C/180C fan/gas 6 and put a baking tray in the oven to heat up. Slide the Wellingtons on their parchment onto the hot tray and bake for 30 mins. Meanwhile, reheat the cooking liquid, add the cream and peppercorns, and keep warm until ready to eat. Serve each Wellington with green veg and the peppercorn gravy for pouring over."}
{"text": "Melt the butter in a large non-stick frying pan, add the onions and cook for 20 mins, stirring now and then, until they are soft and golden brown. Season, stir in the thyme leaves, then transfer to a plate to cool.\nHeat oven to 200C/180C fan/gas 6 with a large baking sheet inside. Roll out the pastry on a lightly floured surface until large enough to line a 25cm loose-bottomed tart tin, with a little overhang of pastry all the way round the top. This will stop the pastry shrinking in the oven later. If there is more overhang than you need, trim off the excess with scissors. Gently press the pastry into the sides of the tin and prick the base with a fork. Chill for 15 mins.\nLine the pastry case with a sheet of baking parchment and fill with ceramic baking beans. Bake for 15 mins on the hot baking sheet (this helps to prevent a soggy bottom). Carefully remove the parchment and beans, then return to the oven for 10 mins more until the pastry looks cooked like shortbread, but is not too brown.\nMeanwhile, put the bacon in the pan you cooked the onions in (there’s no need to wash it first or add any oil) and fry for 10 mins until golden. Lift from the pan onto kitchen paper to remove any excess fat. Beat the cream, milk and eggs with seasoning and nutmeg, then stir in the bacon and half the cheese.\nRemove the pastry case from the oven and reduce heat to 190C/170C fan/gas 5. Spoon the caramelised onions evenly over the base of the pastry case. Pour in the bacon mixture, then scatter with the remaining cheese, the thyme sprigs and a little nutmeg. Bake for 25-30 mins until golden and the filling is just set with a slight wobble in the centre.\nTrim the excess pastry and leave to settle for 10 mins, then remove from the tin and slice."}
{"text": "Heat oven to 180C/160C fan/gas 4. Spread the nuts on a baking tray and roast for 15 mins. Tip the hot nuts into a bowl and toss with the butter, salt and paprika to taste, until coated. Tip the nuts back onto the tray and roast for 2 mins more to dry the coating onto them. Cool and store in an airtight container. The nuts will keep for 3 days."}
{"text": "Boil the potatoes in salted water until tender, about 15 mins. Drain, replace the lid on the pan, then shake to break the potatoes up a bit. Add the beans, cream, butter and 2 tbsp truffle oil, then mash together well. Season liberally with salt, pepper and a good pinch of grated nutmeg, and drizzle with the remaining truffle oil."}
{"text": "Put the ginger, garlic, chilli, coriander stalks (or root) and shrimp into a food processor and whizz to a paste.\nHeat a wok, add the oil, then add the paste. Fry until fragrant. Add the pork, stir well and fry for 5 mins until cooked through. Stir in the fish sauce and the palm sugar, then cook for a good 10 mins more, until the meat becomes sticky, dark and caramelised. Can be made up to 2 days ahead, then reheated. Cool a little, top each pineapple slice with a teaspoon of the sticky pork and devour."}
{"text": "Heat oven to 200C/fan 180C/gas 6 and grease an 18 x 28cm baking tray with melted butter. Brush a sheet of filo pastry with melted butter and lay buttered side up in the tray. Repeat with 4 more sheets, brushing each layer with melted butter. In a large bowl, mix all of the dried fruit, brown sugar, spices and honey together. Spoon a third of the filling into the tray in an even layer. Cover with 3 buttered sheets of filo. Continue until you have 3 layers of fruit, sandwiched and topped with 3 sheets of buttered filo.\nBrush the top with melted butter, then, using a sharp knife, carefully cut into diamond shapes. Sprinkle with a little water (to prevent the corners curling) and bake for 30 mins until golden brown.\nWarm the zest, honey and 2 tbsp water in a pan, then pour over the still-warm pastry. Leave to cool in the tray before loosening the pieces and arranging on a plate to serve."}
{"text": "Preheat the oven to 220C/gas 7/fan 200C. Score the duck breasts on their skin side with a very sharp knife, then press the cracked pepper on to the skin and sprinkle with the salt. Heat a heavy-based frying pan until it is very hot, then put the breasts skin-side down in the hot pan, without added fat. Cook for 5-6 minutes until the skin is crisp, then turn and cook on the other side for 2 minutes. Transfer the duck breasts, skin-side up, to a baking tray, pour the fat into a bowl and wipe the frying pan clean. Roast the duck for 8-10 minutes, depending on thickness.\nWhile the duck is roasting, prepare the vegetables. Cook the potatoes in boiling salted water for 10 minutes. Remove the duck breasts from the oven and set aside to rest for about 10 minutes. After the potatoes have cooked for 10 minutes, tip in the broad beans and cook for 1 minute, then add the peas and cook for 3-4 minutes until all the vegetables are tender. Drain well.\nHeat half the duck fat in the frying pan until hot, and cook the bacon until browned, about 4 minutes. Toss in the garlic and veg until piping hot and glossy. Pour in the vinegar, let it bubble, then stir in the parsley, and season with salt and pepper. Serve with the duck."}
{"text": "Heat the oil in a large pan, add the onion and fry for 5 mins. Add the garlic and squash, and cook for 5 mins more. Pour in the Madeira and stock, stir in the chopped sage, then cover and simmer for 20 mins until the squash is tender.\nBlitz with a hand blender or in a food processor until completely smooth. Allow to cool in the pan, then chill until ready to serve. Will keep for 2 days or freeze for 3 months. To make the crispy sage, heat some oil (a depth of about 2cm) in a small pan, then drop in the sage leaves until they are crisp – you will need to do this in batches. Drain on kitchen paper. Will keep for several hours.\nJust before serving, reheat the soup in a pan. The texture should be quite thick and velvety, but thin it with a little stock if it is too thick.\nFor the apple croutons, heat the oil in a large pan, add the apple and fry until starting to soften. Sprinkle with the sugar and stir until lightly caramelised.\nTo serve, ladle the soup into small bowls and top with the apple, sage and a grinding of black pepper."}
{"text": "Fry the chopped onion in olive oil until soft. Add soft brown sugar, wine vinegar and Cajun seasoning. Cook for 1 min then add the mixed beans and chopped tomatoes with garlic. Simmer for 10-15 mins until the sauce has thickened then season.\nScatter handful grated cheddar onto tortilla chips. Microwave on High for 1 min until cheese has melted. Serve alongside the dip (top with some chopped avocado if you like). Make ahead and reheat dip before guests arrive."}
{"text": "Tip the wine and sugar into a bowl and whisk together. Gradually whisk in the cream until it starts to thicken and just hold its shape.\nPour into a rigid container and freeze until firm, about 3-4 hours. Serve in scoops with seasonal summer fruits splashed with a little more sweet wine."}
{"text": "Cut the pear quarters into thin slices and toss in a bowl with the lime juice to help protect their natural colour. Blend the crème fraîche with half the stilton, ginger syrup to taste, and enough water (3-4 tbsp) to give a smooth, thick coating consistency. (Don’t add too much water or it may separate.)\nScatter the pear slices over six serving plates and follow with the walnuts, dates and remaining cheese. Can be prepared to this stage up to an hour ahead.\nDrizzle each salad with a little of the dressing and some walnut oil. Season with a grinding of pepper – you shouldn’t need salt, as the cheese is salty. Mix the salad leaves and watercress very lightly with just a bit more dressing – some leaves should be touched by the dressing, some untouched. Gently pile the leaves on top of each salad."}
{"text": "Up to a day ahead, coarsely grate the cucumber into a bowl then squeeze it with your hands to remove as much juice as possible.\nIn a food processor, whizz the yogurt, mint and coriander together until well blended. Tip into a bowl and stir in the cucumber. Cover with cling film and chill until you are ready to serve.\nTo serve, preheat the oven to 200C/gas 6/fan 180C. Cut the naan into long triangles and arrange on 2 large baking sheets. Brush them with oil on one side and sprinkle over a little paprika and salt. Bake for 8-10 minutes until crisp and golden. Season the raita with up to 1 teaspoon of salt (see tip) and lemon juice to taste. Serve on a platter with fresh tomato chutney and dippers."}
{"text": "Whizz the flour, egg, yogurt and 2 tbsp water together in a food processor to form a smooth batter. tip into a bowl, then stir in the chillies, spring onions, coriander and sesame seeds. Cover and chill until required.\nTo make the tzatziki, mix the yogurt, cucumber and mint together, season to taste, then chill.\nHeat a small frying pan with a splash of oil, wiping out excess oil with kitchen paper. fry the pancake mixture a dessertspoonful at a time, for 1 min on each side, until lightly browned. tip onto a plate and keep warm. pile onto a large platter, top with a dollop of tzatziki and some extra sliced spring onions and serve warm."}
{"text": "Halve each apple through the circumference and dig out the core with a dessert spoon from both halves, leaving bowl-shaped hollows behind.\nMix together all the remaining ingredients except for the orange juice and fill the apples with the mixture. Fit them into a microwaveable dish and pour the orange juice on top. Cover and cook on Medium (500w) for 5-7 mins until soft. Cool for a few mins before serving with the yogurt or fromage frais."}
{"text": "Tip all the ingredients for the salt mix into a food processor and whizz until everything is combined and the spices are completely ground.\nStroke your hand along the salmon fillet to check for any stray bones. If you find any, pull them out with a pair of tweezers or small pliers.\nTo skin the salmon fillet, lay the fish skin-side down with the tail end closest to you. Insert your knife at an angle at the tail end and cut through the flesh to the skin. Turn the blade so it’s almost flat against the skin, then take hold of the skin with the other hand. Pull and wiggle the skin towards you so as to cut the fillet away. Halfway through removing the skin, hold the knife firmly and flip the fillet over. Gently lift the fillet away from the skin and discard the skin. Trim away the thinner part, plus any fat around the edges, so that the fillet has an even shape.\nScatter about a third of the salt mix onto a large tray in a line about the size of the salmon fillet. Lay the salmon, skinned-side down, over the salt and pack the rest of the salt on top. Cover with cling film, put another tray on top and weigh it down with a few cans or an empty casserole dish. Leave in the fridge overnight or for at least 10 hrs.\nUnder cold running water, wash the salt mix off the salmon fillet, then dry with kitchen paper. Finely chop the dill. Lay the salmon on a board and cover with the dill, pressing it down to pack it onto the salmon.\nIf serving as a plated starter, use a sharp carving knife to cut the salmon straight down into fine slices, allowing 6 slices for each plate.\nTo make the horseradish cream, whisk together the cream and crème fraîche. Add the horseradish, lemon juice and seasoning, then continue to whisk until thick. Dress the salad leaves in a little olive oil. You are now ready to plate up.\nArrange a neat pile of baby salad leaves in the centre of each plate. Curl slices of the salmon into bow shapes around the leaves. Continue all the way around the plate in a petal fashion. Use 2 teaspoons to make small quenelles of horseradish cream and spoon each into each bowl."}
{"text": "Make the Hot toddy cake (see link, right) in a loose-bottom tin, holding back about 2 tbsp of the mix for later. While it bakes, bake the fruit and nut topping. Melt the butter and golden syrup together, then toss with the nuts, dried fruit and seeds. Set aside; the butter mix will start to cool and thicken.\nTake the cake out of the oven 30 mins before the end of cooking, then gently spread over the remaining cake mix with the back of a spoon. The cake will still be quite soft but will take the weight, don’t worry about it sinking. Scatter the fruit and nut mix over the top in an even layer. Bake for the remaining 30 mins until the cake is cooked and the nuts golden. Test for doneness by poking a skewer through the topping and into the cake. If it’s underdone, but the nuts are golden, just cover with foil and give it another 10 mins; then test again.\nLeave the cake to cool completely in the tin, so that the nutty topping firms up. Loosen any obviously sticky edges, then push the cake out of the tin from the bottom. Transfer to a cake board or plate and fix the ribbon around the base before serving. Can be kept in an airtight tin for up to a week."}
{"text": "Preheat the oven to fan 90C/ conventional 110C/gas 1⁄4 and cover a baking sheet with baking parchment. Tip the egg whites into a large bowl, sprinkle in the coffee powder and whisk until the whites are stiff. Add half the caster sugar and whisk in well, then tip in the remaining sugar and the chopped hazelnuts and whisk until blended and standing in stiff peaks.\nSpread the meringue mixture to a depth of about 2cm on the baking parchment (any shape will do as you’re going to break it up later). Bake for 3 hours until crisp right through. Remove and cool.\nCut out a 28cm circle of baking parchment and make 10cm cuts towards the centre all the way round. Use this to line the bottom and sides of a loose-bottomed 20cm round cake tin.\nPour the cream from both cartons into a bowl and whip until it just holds its shape. Break the meringue into smallish pieces with your hands. Set aside about a third of the meringue for the top of the cake, and mix the rest into the cream. Spread out about a third of the cream mixture in the bottom of the tin and cover with half the frozen berries. Repeat these layers once more, then cover with the remaining cream mixture and top with the reserved meringue. Cover the cake with cling film and compress evenly with a small plate that fits inside the tin. Wrap in foil, label and freeze for up to a month.\nMake the sauce. Put the cream and golden syrup in a small pan with 3 tbsp water. Heat until just bubbling, then turn the heat down to low and add the chocolate and butter. Heat gently, stirring occasionally, until the chocolate melts and the mixture becomes smooth and glossy. Pour into a freezer container, cool, seal, label and freeze for up to a month.\n transfer the cake and the chocolate sauce from the freezer to the fridge 8 hours before you plan to serve. After 2-3 hours, take out the cake. Unwrap it and carefully balance the cake tin on a jam jar or can, then push down on the sides of the tin to release. Peel away the baking parchment from the sides. Now lift the cake off the base of the tin, discarding the parchment underneath (a wide palette knife or fish slice will help here) and stand the cake on a serving plate. Return to the fridge for 5 hours before serving with the chocolate sauce.\nTo warm the chocolate sauce, pour it into a heatproof bowl over a pan with a little hot water in the bottom and heat gently, stirring occasionally, until warm, smooth and glossy."}
{"text": "Heat oven to 160C/140C fan/gas 3. Grease and line the base and sides of a deep 20cm cake tin with baking parchment. Put the honey, sugar and butter in a medium saucepan and cook over a medium heat until fully melted. Remove from the heat and allow to cool. Put the flour and spices in a large bowl and mix everything together.\nOnce the liquid ingredients have cooled, whisk in the eggs. Pour over the dry ingredients, whisking them together to form a smooth batter – be careful not to overmix as this can lead to a dry cake. Pour into the prepared tin and bake for 50-55 mins or until risen and a skewer inserted into the middle of the cake comes out clean. Allow the cake to cool in the pan for 20 mins before turning out onto a wire rack to cool completely.\nOnce cooled, use a large serrated knife to slice the cake into 3 layers. Spread the jam across the 2 bottom cake layers, then reassemble the cake and set aside while you make the glaze. Put the cream, chocolate and honey in a medium pan and cook over a low-medium heat until the chocolate is melted and you have a smooth, pourable mixture. Put the cake on a wire rack set over a parchment-lined baking tray and pour over the glaze, making sure to cover the entire cake. Use a fish slice to carefully transfer the cake to a serving plate and allow the glaze to set. To decorate, dust with a little edible gold powder, if you like. Uniced, this cake will keep for up to 5 days. "}
{"text": "For a 1.2 litre terrine, cut a strip of greaseproof paper as long as the tin and wide enough to cover the bottom and come up both long sides, with about 7.5cm to spare. Put the paper in the tin as if to line it, then draw a line across the paper on both sides where it meets the bottom edge, and the top edge, of the tin. Take the paper out of the tin and draw two lines at equal intervals between the bottom and top edge lines you have already drawn. (This will help you make each layer exactly the same depth when filling the tin.) Lightly grease the paper and use to line the tin.\nWhip a third of the cream to just soft peak stage, then chill. Melt the milk chocolate in a heatproof bowl set over a pan of simmering water or microwave on High for 2 mins. Whisk 2 egg yolks and 25g/1oz sugar in a heatproof bowl over a pan of simmering water with a hand-held electric blender for about 2-3 mins until the mixture has at least doubled in volume. Once you have reached this stage, remove the bowl from the heat and keep whisking, adding the melted chocolate – this not only incorporates the chocolate, but also cools the mixture more quickly. Leave to cool for a few minutes, then carefully fold in the whipped cream.\nQuickly whisk two egg whites into soft peaks, making sure the bowl and whisk are spotless to ensure the maximum volume is obtained. Using a large metal spoon, carefully fold the egg white into the chocolate mixture so you don’t knock out too much air.\nPour mixture into the terrine, filling it to first mark (any extra can be frozen), then freeze for 20-30 mins before starting the white chocolate mixture. Repeat process with white chocolate, then the plain; cover with plastic film and freeze completely. To guarantee a good set, make terrine at least 8-10 hrs or up to 2 days before.\nDip the tin briefly in a large bowl of hot water. Put a chopping board or flat plate on top and invert the mousse. Gently remove the paper and open freeze for about 10 mins to re-set. To decorate, pipe an outline of melted plain chocolate in a teardrop shape onto each plate. Dust the plates lightly with icing sugar, then carefully fill the teardrop with cream. Slice the mousse, wiping the knife after each cut, and put a slice on each plate. Decorate with chocolate curls and serve at once."}
{"text": "Toss the onions with the red pepper and the oil, then fry in a frying pan for 5-8 mins over a high heat until lightly charred and softened. Remove from the pan and set aside.\nPut the chilli, garlic and ginger in the pan with half the vinegar. Bring to the boil then simmer for 2-3 mins. Add the onions and pepper plus the remaining vinegar, all the sugar, spice and 1 tsp salt.\nBring to the boil then bubble away for about 5 mins until thickened. Add redcurrants and simmer for about 5 mins more, or until they have burst, but still have some shape and the liquid is syrupy.\nRemove and pour into a large heatproof jar. Cover and seal while hot. Keeps in the fridge for up to 3 weeks."}
{"text": "Mix the ingredients for the dressing. It will keep in the fridge overnight, although the flavours will get hotter as the chilli sits in the liquid.\nTo serve, arrange the salmon on plates – it works out at about 3 slices per person. Mix the avocado, cucumber and coriander, then pile or scatter on top. Spoon over a little of the dressing and serve."}
{"text": "Put the cumin seeds in a dry frying pan set over a lowish heat. Cook for a few minutes, tossing in the pan, until they smell fragrant and have darkened slightly. Grind them in a spice or coffee grinder.\nPut the carrots in a saucepan and cover with cold water. Add a few pinches of salt, then bring to the boil. Turn the heat to low and cook very gently for 3-4 minutes. Drain.\nWhisk the oil, lemon juice and sugar, then stir in the garlic and 1⁄4 tsp salt. Stir in the cumin and paprika. Mix well with the carrots, then leave to cool, stirring occasionally. Toss in the coriander and lemon zest. Serve at room temperature."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Butter a 23cm-round ring tin. Combine the flour, muscovado sugar and butter in a bowl, then rub in with your fingers until crumbly and completely blended. Stir in the grated orange zest and ground ginger.\nScatter half the nuts and half the chopped stem ginger into the bottom of the ring tin. Break up the rest of the nuts into small pieces and stir into the crumb mix with the rest of the stem ginger. Measure out 100g/4oz of the crumb mix and spoon it into the tin over the nuts. Stir the bicarbonate of soda into the rest of the crumb mixture. Mix the soured cream and egg together, then stir it into the remaining crumb mixture. The mixture will be very soft. Pour this batter over the crumbs (it will come quite high in the tin).\nBake for 35-40 mins or until risen and a skewer inserted in the centre comes out clean. Let the cake sit for 10 mins, then take it out of the tin and leave to cool on a wire rack.\nCool the cake completely, then wrap it in foil and freeze for up to 2 months.\nWhen ready to use, thaw for about 2 hrs at room temperature. Serve in slim slices with dollops of Cointreau cream, orange segments and a drizzle of syrup from the jar of stem ginger."}
{"text": "Put some Martini glasses (or champagne flutes) into the freezer. Mix the clementine juice, vodka and Cointreau in a jug, then chill for 1 hr (or up to 1 day). Thinly slice the 2 clementines to use as a garnish.\nTo serve, put a clementine slice into each frosty glass. Fill almost halfway with the chilled jug mixture, then open the bottle of fizz and top up the glasses."}
{"text": "Put the pork in a bowl and add 1 tbsp each of the soy sauce and rice wine. Toss to combine, then cover and chill for 1 hr, or overnight if time permits.\nTo make the pickled chillies, put the chilli, shallot and rice vinegar in a small bowl with a big pinch of salt, and let stand for 1 hr or more.\nHeat the vegetable oil in a heavy- based saucepan over a medium heat, add the garlic and ginger, and sauté for 2-3 mins or until golden. Add the pork and all the remaining ingredients, and bring to the boil. Reduce the heat to low, cover and simmer for 45 mins. Remove the lid from the pan to allow the liquid to reduce, and cook for a further 45 mins or until the meat falls apart.\nServe scattered with the sesame seeds and spring onions, with steamed rice and the pickled chillies on the side."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Place spinach in a pan and stir over a high heat until wilted. Strain, squeeze out as much liquid as possible, then roughly chop.\nHeat oil in a frying pan, sauté shallot until softened. Add walnuts, then fry for 2-3 mins. Remove from heat, stir in spinach, cheese, nutmeg, cream and seasoning.\nMix walnut oil with butter. Brush a thin coating on a piece of pastry. Place another piece on top with corners at a different angle, brush with the butter and repeat with one more piece. Place a spoonful of spinach mix in the centre, bring up corners of pastry and pinch in the middle to form a parcel. Repeat to make remaining parcels, then transfer to a greased baking tray. Brush parcels with remaining butter and oil. Bake for 20 mins until golden."}
{"text": "Heat oven to 190C/170C fan/gas 5. Arrange the rhubarb pieces in a large roasting tin. Sprinkle over the sugar, orange zest and juice, grenadine and 150ml water. Cover with foil and bake for 25-30 mins until tender but not mushy. Scoop the rhubarb out of the tin into a sieve and reserve any juices, then leave to cool completely. Tip the rest of the liquid into a saucepan, along with the collected juices, and bring to the boil. Simmer for 15-20 mins or until reduced and syrupy. Leave to cool completely.\nTo make the crumble topping, rub the butter into the flour until the mixture resembles fine crumbs, then stir through the demerara sugar, almonds and oats. Tip onto a baking tray lined with parchment and bake for 15 mins, shaking the tray every so often, until golden brown, then cool.\nMix the Disaronno and orange juice together in a shallow dish. Dip each sponge into the liquid, leaving it for about 15 secs on each side, then arrange them in the base of a large trifle dish. Tip the mascarpone into a bowl and whisk until soft and smooth, then add the custard, a little at a time, and mix until combined. Arrange half the rhubarb pieces on top of the sponges, discarding the orange zest. Drizzle over 2 tbsp of the rhubarb syrup and top with half the custard mix. Follow with another layer of rhubarb, 1 tbsp of the syrup, and the remaining custard.\nWhip the cream and 2 tbsp sugar to soft peaks and dollop over the custard. Drizzle over the remaining rhubarb syrup, along with a scattering of the crumble topping. Tip any extra crumble into a bowl and pass around the table."}
{"text": "To make the relish, put the sugar and vinegar in a small saucepan with a pinch of salt. Bring to the boil and simmer for 5 mins until syrupy. Remove from the heat and cool completely. When cool, add the chilli flakes, cucumber, peanuts and shallot, and stir together. Set aside.\nPut the ginger, coriander, shallots, chilli, lime zest and half the prawns in a food processor and blitz until fine. Add the remaining prawns and the fish sauce and pulse again, this time keeping the mixture chunky. Season well with black pepper, then form into 18 flat cakes.\nHeat the grill to high. Brush both sides of the cakes with a tiny bit of vegetable oil and place on a baking sheet. Cook for 2 mins on one side, turn over and brush with the sugar water. Cook for another 2-3 mins or until opaque and slightly browned at the edges. Serve the cakes with the lettuce leaves, herbs and the cucumber relish."}
{"text": "To make the pastry: put the flour and cinnamon into the bowl of a food processor. Add the butter and pulse until it looks like very fine breadcrumbs. Sprinkle in the sugar and 3 tbsp cold water, and pulse until the mixture starts to clump together, about 30 secs. Tip the mixture onto a board and gently squeeze the pastry until it comes together into a ball – add water if it feels dry. Wrap the pastry in cling film and chill for 30 mins.\nHeat oven to 190C/fan 170C/gas 5. Roll the pastry on a lightly floured surface to the thickness of £1 coin. Using a 7cm cutter, cut out 10-12 discs and use to line a 12-hole bun tin with them. Use a 6cm cutter for the lids, or use a 6cm star cutter to make star shapes. Chill both.\nMake the mincemeat: put all the ingredients into a food processor and pulse on and off until evenly chopped. Spoon 1-2 tsp into each tart, dampen the edge of the pastry bottom with water and sit a smaller pastry disc or star on top. Using scissors, snip a hole in the lid, if you’ve made round tops. Bake for 12-15 mins until golden brown. Lift onto a wire rack to cool and dredge with icing sugar."}
{"text": "Heat oven to 150C/130C fan/gas 2. Melt the butter in a large heavy-based frying pan. Add all the vegetables (or do this in 2 batches if necessary rather than overcrowd the pan) and a little sea salt and freshly ground black pepper, then sweat them on a medium heat for 5 mins.\nTransfer the veg to a large roasting tin, pour in 150ml water, cover with foil, then roast for about 2 hrs or until meltingly tender but still holding their shape. Taste and correct the seasoning."}
{"text": "Rinse the scallops in cold water then pat dry with kitchen paper. With scissors, snip off the corals (the orange part) as closely as you can to the plump white scallop, and reserve. Scrub the scallop shells thoroughly and dry them.\nRemove the crusts from the bread and discard. Break the bread into smallish pieces, then pulse in the food processor to make into fine breadcrumbs. Tip into a large non-stick frying pan and toast the breadcrumbs over a moderate heat, stirring every now and then. When they are evenly browned, set aside.\nBrush any crumbs from the pan with kitchen paper then add the olive oil. When hot, add the scallops but not the corals. Fry over a moderate heat for 3 minutes on each side, then add the corals, chopped parsley and garlic and fry a further minute. If you have shelled your own scallops and saved some of their sweet juice, strain it through muslin to remove any sand then add it to the pan now and let it bubble over a high heat. Season to taste with salt and pepper, add the lemon juice and mix well.\nSpoon three scallops and their corals with some of the pan juices onto each of the cleaned shells, then scatter with the dry toasted breadcrumbs. Serve with the lemon wedges."}
{"text": "Heat oven to 200C/180C fan/gas 6 and line a baking sheet with baking parchment. Put the butter in a bowl and beat it with electric beaters until soft and creamy. Beat in the sugar, then the egg and vanilla, and finally the flour to make a dough. If the dough feels sticky, add a little flour and knead it in. Chill for 20 mins in the fridge.\nRoll the dough to about the thickness of a £1 coin on a lightly floured surface. Cut out snowflake shapes using a biscuit cutter, then re-roll the off-cuts and repeat.\nBake for 8-10 mins or until the edges are just beginning to brown. Leave to cool for 5 mins before trying to move them. Cool completely.\nRoll out the fondant icing to the thickness of a 50p piece. Use the same cutter to stamp out the icing. If you have smaller cutter you can stamp out holes in the middles of some of them. Brush each biscuit with a tiny amount of honey and press an icing snowflake on top.\nMix the icing sugar with enough water to make a pipeable icing, and spoon it into a piping bag fitted with a straight piping nozzle. Pipe patterns onto the snowflakes and add silver balls and sprinkles as you decorate. Leave to dry completely."}
{"text": "Melt the butter in a pan, then fry the onions and bacon together for 10 mins until the onions are soft and bacon has started to colour. Add the cabbage or sprouts to the pan with a good grinding of black pepper. Stir well, then add a splash of water and cook, covered, for 5 mins more until tender.\nTip the potatoes and cooked veg into the pan, then mash really well. Mix in the eggs, then season to taste. Turn onto a floured surface, flatten out, then cut into squares about the size of a scone. Roll each piece into a cigar shape about 10cm long and the width of a £2 coin. Cool.\nRoll each croquette in the flour, then in the egg and finally in the breadcrumbs. Put onto a tray and chill for at least 1 hr.\nHeat oven to 190C/170C fan/gas 5. Heat a 5mm depth of oil in a large frying pan; then, once a crumb turns golden within a few secs, shallow-fry the croquettes in 2 batches for 2 mins each side, turning carefully. Drain on kitchen paper and transfer to a baking sheet lined with baking paper. Bake for 15 mins or, if making ahead, cover and chill for up to 2 days. To reheat, give them 15 mins in the oven at 190C/fan 170C/gas 5 until hot through and crisp on the outside."}
{"text": "Gently mix the mackerel flakes with the crème fraîche, lemon juice, half the herbs and some pepper (but no salt – smoked mackerel is salty enough). Chill until ready to serve.\nSpoon a generous amount of the mixture into each leaf, then arrange on plates. Sprinkle each ‘scoop’ with the remaining fresh herbs and a pinch of the lemon zest, then serve."}
{"text": "Mix together all the fruit in a large bowl with the guava juice, then chill until ready to serve. At the last minute, pour over the ginger beer and serve with small cups or bowls on the side for spooning the drinks and fruit into."}
{"text": "Season the lamb well. Heat the oil in a frying pan and fry three fillets over a high heat for 5 minutes until seared on the outside. Remove from the pan and repeat with the other 3 fillets. Set aside until cold.\nUnravel the whole pack of pastry on a floured surface and cut into four rectangles. Cut the half pack to make two rectangles. Roll out each piece to make the rectangles 2.5cm larger all round.\nPosition one rectangle with a short side facing you, brush with egg yolk and sprinkle with a sixth of the chopped sage. Put a lamb fillet on the pastry close to the end facing you, then fold the long sides in to cover the ends of the meat; brush these with more egg yolk.\nFreeze the lamb parcels on a tray until solid for 4 hours, then pack in a freezer container. Seal, label and freeze for up to a month.\nTo make the sauce, melt the redcurrant jelly in a pan over a gentle heat, add the port and rosemary and boil uncovered for 10-12 minutes until syrupy. Cool for 5 minutes, strain into a freezer container, then leave until completely cold. Seal, label and freeze for up to a month.\n defrost the lamb seam-side down on a wire rack for 3 hours at room temperature. Defrost the sauce at room temperature.\nPreheat the oven to fan 200C/ conventional 220C/gas 7. Put the parcels seam-side down on a nonstick baking sheet, brush with egg yolk, then snip four incisions in the top of each. Bake for 25 minutes until golden. Remove from the oven and rest them for 5-10 minutes. Reheat the sauce in a pan.\nSlice each parcel and serve with the sauce and watercress salad."}
{"text": "Remove redcurrants from stems, wash and put in a pan with 2 tbsp water. Bring to the boil, lower the heat, cover and simmer for 5 mins until softened. Push through a sieve to make a purée. Stir in the elderflower cordial and set to one side to cool.\nPut the caster sugar in a pan with 300ml/½pt water and leave over a low heat for 5 mins until the sugar dissolves. Raise heat and boil for 10 mins.\nTip redcurrant mixture into syrup and mix. Return to the boil, turn down and simmer for 2 mins. Cool, pour into a container and freeze for 3-4 hrs until frozen. Scoop into glasses and top with redcurrants."}
