{"text": "Tip the fruit and peel into a bowl with the orange juice and zest and 150ml of the brandy. Stir well, then leave in a warm place for 2 hrs for the fruit to plump up.\nHeat oven to 170C/150C fan/gas 4. Brush a 900g loaf tin with the melted butter, then line with baking parchment. Beat the muscovado sugar and butter until light and fluffy, then add the eggs one at a time. Mix in the fruit and the rest of the ingredients except for the remaining brandy and icing sugar. Spoon the mixture into the loaf tin, put the tin in a deep tray and bake for 1 hr 15 mins-1 hr 30 mins or until a skewer prodded in comes out clean. Remove from the oven and immediately pour over the brandy (this makes it easier for the cake to soak it up). Leave to cool, then dust with icing sugar, if using."}
{"text": "Preheat the oven to fan 160C/ conventional 180C/gas 4. Weigh the ham and calculate the cooking time at 25 minutes per 500g. Scatter the onion, ginger, thyme and cloves over the base of a large, deep roasting tin. Put the soaked ham on top and add water to 3-5cm deep. Cover the whole ham and tin with two or three layers of foil (making a tent over the ham to allow the steam to circulate), sealing the foil around the edges of the tin. Bake for 1½ hours, then reduce the oven to fan 140C/conventional 160C/gas 3 for the remaining 2 hours 40 minutes of the cooking time. When the ham is cooked, remove it from the oven. Leave to rest for 30 minutes.\nNow make the glaze. Put the sugar and 100ml/3½⁄2fl oz water in a medium pan. Heat gently until the sugar melts, add the fresh ginger and simmer for 3-4 minutes. Add the kumquats and cook for a few more minutes, just until they soften. Scoop out and reserve the kumquats, discard the ginger and add the stem ginger strips. Bring to the boil, then turn down the heat and let the mixture bubble for 3-5 minutes until thick and reduced by just under half. Remove from the heat and set aside.\nLine a clean roasting tin with foil and oil it. Unwrap the ham and put it in the foil-lined tin. Cut off the skin, leaving a layer of fat all over. Using a sharp knife, score the fat into a diamond criss-cross pattern. Turn up the oven to fan 200C/conventional 220C/gas 7.\nRub ground ginger over ham, then brush over all but a couple of spoonfuls of the glaze, distributing stem ginger strips. Scatter over kumquat slices, studding cloves through some to secure. Drizzle over remaining glaze. Roast for another 20 minutes or until golden and sticky and kumquats start to colour. Serve garnished with halved kumquats and sprigs of bay leaves. If serving hot, allow to rest for 15-20 minutes before carving."}
{"text": "Pop your soaked (see tip, below) or ready-to-use joint in a large stock pot or preserving pan and nestle the vegetables, bay leaves and peppercorns around it. Pour over enough water to cover the gammon and bring to a simmer. Cover with a lid and cook for 21⁄2 hrs, turning once, topping up with boiling water if it needs it, and skimming off any impurities.\nHeat oven to 190C/170C fan/gas 5. Remove the joint from the poaching liquid and place in a roasting tin (you can use the strained poaching liquid for soups). Pat it dry with some kitchen paper and leave to cool a little until you can handle it. Remove the ties around the gammon and carefully trim away the skin, leaving an even layer of fat. Score all over in a diamond pattern and stud with cloves.\nPop the glaze ingredients in a small saucepan and cook for a couple of mins to thicken and dissolve the membrillo. Brush half the mixture over the gammon, then bake for 15 mins. Brush on another layer and bake for another 15 mins or until golden and sticky. Rest for 15 mins before slicing, or eat cold over the next few days."}
{"text": "For the cake, melt the chocolate and butter together, then cool. Meanwhile, heat oven to 150C/130C fan/gas 2 and butter and line the base and sides of a 23cm springform tin with baking paper.\nWhisk the sugar and egg yolks until very pale and thick, about 5 mins. Fold in the chocolate mix using a large metal spoon. Put the egg whites and a pinch of salt into another bowl and, with clean beaters, whisk until you have medium peaks. Fold this gently but thoroughly into the chocolate mix with your metal spoon, then spoon into the tin and bake for 1½ hrs until risen all over. Insert a skewer into the middle of the tin to test; it should come out with just a few damp crumbs but no wet mix. The cake will sink once it cools. Can be frozen up to 1 month ahead.\nWhile the cake cooks, put the pears, vanilla pod and 1 litre water into a saucepan. Weigh the pears down under the surface with a small plate, then simmer for 20 mins, covered, until tender. Leave to cool in the liquid if you have time. Cut each pear into 6 long slices, then remove the stalk and the core. Can be cooked up to a week ahead and kept chilled in some of their poaching liquid.\nFor the mascarpone layer, half-fill a medium saucepan with water, then bring to a simmer. Put the yolks, sugar and 6 tbsp of the Marsala into a large bowl, sit it over the just-simmering water, then whisk for 5 mins until the mixture is thick and holds a trail for a few secs. Put the mascarpone into a bowl, beat with 2 tbsp more Marsala to loosen, then whisk in the egg mix in 2 batches, until smooth, thick and light. Can be made ahead and kept in the fridge. Keep no longer than 2 days in total.\nYou’re now ready to assemble the trifle. Cut the cake in half – it will be squidgy, so don’t worry if it breaks up. Spoon some of the mascarpone layer into the bottom of a dish, then top with a few pears and a sprinkling of grated chocolate. Put half of the cake on top, then sprinkle with a little of the remaining Marsala and coffee. Spoon more of the mascarpone over, then top with more pears and more chocolate. Top this with the next piece of cake, spoon over more Marsala and coffee, then spoon the remaining mascarpone mix over the top. Finish with the remaining pears. Chill for at least 2 hrs, or up to 2 days. When ready to serve, scatter with the last of the grated chocolate."}
{"text": "Up to two days before, salt the turkey. If you have a spice grinder or minichopper, tip in all the ingredients for the salt mix and grind to make a wet salt. If you are using a pestle and mortar, grind the herbs and pepper together, then add the salt and orange zest, and grind well again. Set aside. Carefully rinse the turkey and pat dry with kitchen paper. Sit the turkey in its roasting tin and use the salt mix to season the turkey generously all over. Put the turkey breast-side up in the tin, cover with cling film and leave in the fridge for up to 2 days. (This can be done a day ahead but the longer you leave it, the more the flavour of the salt rub will permeate the bird.)\nTo make the clementine & bay butter, mash all the ingredients together in a bowl with some seasoning and set aside. Can be made 2 days ahead or frozen for up to a month.\nRemove the turkey from the fridge 1 hr before you want to cook it and rinse off all the salt really well. Pat it dry, rinse out the roasting tin, then sit the turkey back in the tin and leave at room temperature for about 1 hr, uncovered.\nHeat oven to 180C/160C fan/gas 4. Calculate a cooking time of 40 mins per kg for the first 4kg of the turkey, then 45 mins for every kg after that. Rub the turkey all over with most of the butter – no need to season. If you haven’t used the neck for the Make-ahead gravy (see 'goes well with'), then add the neck to the tin with the onion. Cover the tin loosely with foil and roast for the calculated cooking time. For the final 30 mins, remove the foil, baste the turkey, scatter with the reserved thyme and orange zest, and increase the oven temp to 200C/180C fan/gas 6. (Now is the time to pop in the stuffings and roast potatoes, if you are doing them.) When the turkey is beautifully brown and cooked through, remove from the oven and leave to rest on a warm platter covered loosely with foil and a tea towel.\nIf you've made our Make-ahead gravy (see 'goes well with'), you can add the roasting juices to that. To make your gravy fresh, pour off most of the fat but leave the juices in the tin and put it on a low heat. Stir in the flour to a paste. Pour in the sherry and sizzle for 1 min, then gradually add 850ml water and simmer until you have a thick gravy – make sure to scrape up the sides of the tin to release any bits. Sieve the gravy into a saucepan and reheat to serve – the gravy probably won’t need extra seasoning as the turkey juices will be salty enough."}
{"text": "Mix the flour, baking powder, bicarbonate of soda, sugar, mixed spice and salt in a \n. \n the buttermilk, oil, vanilla extract and 75ml water with the eggs until smooth. Pour the wet ingredients into the dry and whisk until well combined. Scoop about a third of the cake mixture into a tin. If using, mix the food colouring into the remaining batter and divide this between the other tins. Bake for 25-30 mins, or until the cakes have risen and a skewer inserted into the centre comes out clean.\nCool in the tins for 10 mins, then turn out onto a \n, peel off the parchment and cool.\nMeanwhile, for the chocolate drip, melt the white chocolate in a bowl set over a pan of lightly simmering water or in the microwave in short bursts. Pour into a disposable \n and set aside to firm up a little – you want it to be pourable but not too runny.\n \nRemove the cake from the fridge. If you like, you can use an edible gold spray to cover the surface in a thin layer of shimmer. When the white chocolate is the correct consistency, snip off the end of the piping bag and pipe drizzles down the side of the cake. Fill in the top with the remaining chocolate. Top with our \n, or your choice of decorations."}
{"text": "First, make some shavings from the bar of chocolate by dragging a large knife over the surface. You only need a little – enough to top the sundaes. Set the shavings aside and break the remaining chocolate into a saucepan. Add the remaining sauce ingredients and heat gently, stirring, until the chocolate melts and you have a smooth glossy sauce.\nCrumble the cake or pudding into sundae glasses and drizzle over the alcohol or pear juice. Top with the pear quarters and ice cream. Drizzle over the chocolate sauce and top with the hazelnuts and chocolate shavings."}
{"text": "Mix together all the base ingredients in a large mixing bowl. Grease 8 individual pudding basins or darioles with a little butter, then line the bases with circles of baking parchment.\nStir your choice of dried fruits, spices and liquid, plus nuts if you are using, into the base mixture. If you’re tailoring your puddings for each guest, then weigh out 225g/8oz base mixture per pud, before adding the extras (see brackets after ingredients for individual pud quantities).\nHeat oven to 160C/140C fan/gas 4 and boil the kettle. Fill each basin or dariole with pud mixture. Grease a large sheet of foil, then stick a large sheet of baking parchment on top. Cut it into 8 squares, large enough to cover the puds with overhang, and make a small pleat in each. Cover the puddings by scrunching foil round the edges to completely seal. stick a name label, written in biro, on top of each pud to help identify them when serving. sit the puds in a big roasting tin, pour hot water from the kettle into the tin until nearly halfway up the puds, then cook for 1 hr. Cool, then store in an airtight container somewhere cool and dark, for up to 2 weeks.\nTo serve, turn oven to 180C/160C fan/ gas 5 after the Christmas dinner has come out, and put the puds back into a roasting tin with hot water, as above. Cook for 40 mins, then turn off oven and leave them there if you’re still eating. Carefully turn out onto serving plates, running a knife round the edge to help release, then dust with a little icing sugar and top with holly, if you like."}
{"text": "Heat oven to 200C/180C fan/gas 6. Line a 24 x 32cm Swiss roll tin with baking parchment so it hangs over the edges, then butter well. Whisk the eggs and sugar together with an electric \n for 3-4 mins or until pale and thick.\nFold the flour, baking powder and vanilla seeds into the egg mixture with a large metal spoon until there are no pockets of flour visible. Gently spread into your tin and bake in the oven for 12-15 mins or until lightly golden and springy to the touch.\nRemove from the oven, allow to cool for 1-2 mins or until cool enough to handle, then carefully roll up the sponge lengthways while it’s still warm (keeping the baking parchment attached). Leave to cool completely in its rolled-up shape.\nTo make the icing, beat the butter and icing sugar until smooth, then mix in the caramel spread. Set aside. Whip the cream to soft peaks.\nCarefully unroll the sponge, then turn it so one long edge is towards you. Dot lumps of the caramel spread and caramel icing over the sponge (don’t use too much – you need the rest to ice the cake), keeping the last centimeter at the end furthest from you clean, as the filling will spread as it rolls. Spread the cream over the top using a palette knife. Using the parchment, roll up the sponge.\nCut one end off a few centimeters in at an angle to make a branch. Put the roll on a plate or board and add the branch so it fits on snugly. Use the remaining icing to ice the cake, making bark lines in the icing using a fork. Dust with icing sugar and decorate with the redcurrants and mint to serve."}
{"text": "Put your chosen dried fruit mixture into a large bowl with your choice of alcohol or tea, citrus zest and juice. Mix well, cover and leave overnight.\nHeat oven to 160C/140C fan/gas 3. Butter and double-line a deep cake tin – 20cm round or 18cm square – with enough baking parchment to come about 2.5cm above the top of the tin. Wrap the outside of the tin with a few sheets of newspaper, securing with staples or string.\nBeat the butter, sugar and vanilla until creamy, then beat in the eggs one by one. Tip in the flour, mixed spice, soaked dried fruit and any liquid from the bowl, plus your chosen nuts, if using. Stir everything together, then scrape into the cake tin. Using the back of your spoon, make a slight dent in the centre of the mixture, then bake for 1½ hrs.\nReduce oven to 140C/120C fan/gas 1, loosely cover the top of the cake with a double sheet of foil or baking parchment, and bake for another 45 mins-1 hr or until a skewer poked right to the bottom comes out clean. Cool in the tin, then lift out and wrap in greaseproof paper or baking parchment. "}
{"text": "Heat oven to 160C/fan 140C/gas 3. Blitz the dates in a food processor until chopped a little, then add the walnuts, carrot, apple, golden syrup and brandy. Pulse a few times until coarsely chopped, but still chunky. Tip in the butter, eggs and sugar and pulse a few times to combine. Finally, add the flour and bicarbonate soda, and keep tapping the pulse button just until everything comes together. Butter and line the base of a 1.5-litre pudding basin with greaseproof paper. Tip the mix in, smooth the top and bake for 1 hr 20 mins –1 hr 30 mins or until a skewer inserted into the pudding comes out almost clean.\nTo make the sauce, tip the sugar into a frying pan and put over a medium heat. Cook until bubbling and golden. Swirl in the walnuts and, when completely coated, use a slotted spoon to lift them out onto a tray lined with greaseproof paper. Leave to harden; this is the praline. Carefully add the butter and cream to the caramel residue in the pan, return to the heat, bring to a simmer and stir together to make a toffee sauce.\nTo serve, break the praline into shards. Turn out the pudding, spoon over some sauce and decorate with the praline. Serve with the remaining sauce."}
{"text": "Heat oven to 170C/150C fan/gas 5. Grease and line a roughly 1.3-litre ovenproof pudding basin with 4 strips of baking parchment, criss-crossing the bowl like spokes of a wheel. Beat the cream cheese, mascarpone, vanilla, eggs and sugar with an electric mixer until combined and light. Fold in the flour, Christmas pud and stem ginger, then spoon into the prepared tin. Carefully put in the oven.\nCheck after 1 hr – it should be set with a slight wobble; you may need to give it 10 mins more. Remove and allow to cool slightly (it will puff up, then sink a little). Brush with 1 tbsp ginger syrup, then arrange the ginger loaf cake on top, pressing to form a base. Brush with 1 tbsp more syrup, then place a saucer on top to press down. Chill for at least 4 hrs (or up to 2 days).\nTo make the sauce, bubble together all the ingredients plus 3 tbsp ginger syrup in a saucepan until syrupy. Turn the cheesecake out onto a serving plate and serve with the hot ginger sauce."}
{"text": "First, prepare the fruit. In a large mixing bowl, combine the dried fruit, cherries, almonds and apple with the alcohol and the orange juice and zest. Cover with cling film and leave for at least a few hours, or overnight if you can.\nNext, prepare the mandarin. Put it in a pan, cover with cold water, then cover the surface with a scrunched-up piece of baking parchment. Bring to the boil and cook for 30 mins or until completely tender when poked with a cocktail stick. Remove the mandarin from the water, keeping 300ml of the cooking liquid in the pan. Set aside the mandarin.\nAdd the sugar to the cooking liquid in the pan and heat gently to dissolve. Poke several holes in the mandarin, then add to the syrup along with the liqueur. Cover with the parchment again and simmer for 45 mins, turning the mandarin halfway through. By the end of cooking it will be a little translucent and have a dark orange colour. Leave to cool in the syrup (overnight is fine).\nTo make the pudding, grease a 1.5-litre pudding basin, then scatter over the 2 tbsp sugar. In a large bowl, combine the dry ingredients and a pinch of salt. Coarsely grate the butter, and fold into the fruit with the dry ingredients, followed by the eggs.\nFill the basin one-third full with the fruit mix, then nestle the mandarin into it. Pack the rest of the mix around and on top of the mandarin and smooth over. (If you’re not using the mandarin, just press it all in as you’ll have more room).\nTear off a sheet of foil and a sheet of baking parchment, both about 30cm long. Butter the baking parchment and use to cover the foil. Fold a 3cm pleat in the middle of the sheets, then put over the pudding, buttered baking parchment-side down. Tie with string under the lip of the basin, making a handle as you go. Trim the parchment and foil to about 5cm, then tuck the foil around the parchment to seal.\nTo cook the pudding, sit it on a heatproof saucer in a very large saucepan, and pour in just-boiled water to come halfway up the side of the basin. Cover and steam for 6 hrs, topping up the water occasionally. Alternatively, place in a slow cooker, pour hot water halfway up the side of the basin and cook on High for 8 1/2 hrs. Leave the pudding to cool, and leave in a cool, dark place to mature. To reheat, steam in a pan for 1 hr or remove the foil and parchment, cover with cling film and microwave on Medium for 10 mins. Cut the pudding with a sharp serrated knife, so that the mandarin stays in place and everyone gets a piece. Serve with cream or brandy butter."}
{"text": "Heat oven to 180C/160C fan/gas 4. Rub a little butter over the base and sides of two 20cm cake tins (use cake tins rather than sandwich tins as the higher sides work better), then line the base and sides with baking parchment. Melt 150g butter with 100g of the chocolate in a bowl set over a small saucepan of gently simmering water – make sure the base of the bowl doesn’t touch the water. Stir the butter and chocolate every min or so until it has melted. Set aside to cool a little.\nMeanwhile, measure 250g flour, 2 tsp baking powder, ½ tsp bicarb and 250g sugar in a large bowl. Make a well in the middle and add 150g yogurt, 2 tsp vanilla extract, half the orange zest and juice, 3 eggs and 2 tbsp milk. \n everything together, then stir in the melted butter and chocolate.\nWhen the cake mixture is smooth (this makes a very wet pourable batter), divide it equally between the two cake tins. Bake on the middle shelf for 25-30 mins, they will look golden and evenly risen when cooked. Check they are done by pushing a skewer into the centre of the cakes – it should come out clean. If there is any wet cake mixture on the skewer, return the cake to the oven for a few more mins, then check again.\nLeave the cakes to cool in their tins for 5 mins, then transfer to a cooling rack. Wash out the tins and repeat steps 1 and 2, to make two more sponges in total. \nTo make the compote, simmer the cranberries and sugar in a small pan for 4-5 mins until jammy, then leave to cool.\nFor the icing, melt the chocolate, either in 20-30 secs bursts in a microwave or in a bowl over simmering water. Set aside to cool a little. Roughly mash the butter and icing sugar together, then beat until smooth with an \n or mixer. Add the chocolate and cream cheese and beat again until smooth.\nTo assemble the cake, place one sponge on a cake board the same size as the sponge, then sandwich the other sponges on top with a little icing and the cranberry compote. Use the cake with the neatest edge, flipped upside down, on top to give your cake a good shape.\nPile about half the remaining icing on top of the cake and use a palette knife to spread it thinly over the top and down the sides of the cake. This is a crumb coat, it catches any crumbs, ensuring the final layer looks clean and professional. Chill the cake for 10-20 mins to firm up the icing or leave it somewhere cool for longer. Spread the remaining icing over the top and sides of the cakes, giving it nice sharp edges. We’ve left some of the cake exposed for the ‘naked’ cake look, or cover it completely if you like. \nTo decorate the cake: dot the top with \n that you've either bought or made yourself, edible snowflake decorations and gold leaf, if you like.\nSee our guide to \n for details on this design along with more decorating ideas."}
{"text": "Melt the apricot jam, then sieve and brush a little all over the fruitcake (see Apricot & almond fruitcake recipe to the right) or any 23cm cake. On a clean surface lightly dusted with a little sifted icing sugar, roll out the marzipan into a circle large enough to cover the cake – use a piece of kitchen string to help you check. Lift up the marzipan by hanging it over your rolling pin, then drape over the cake. Gently pat and smooth the marzipan down the sides of the cake, then trim any excess from the bottom.\nRepeat everything again with 900g of the ready-to-roll regal icing, firstly brushing the marzipan with more apricot jam. Trim the base as neatly as you can, then hide any rough bits by tying a pretty ribbon round the base. Dye the remaining 100g regal icing with a little red food colouring, then thinly roll out and stamp or cut out a few ‘H’ shapes. Dribble a little water into 50g sifted icing sugar to make a paste. Dot a little on the backs of the ‘H’ shapes and some round sweets, and stick around the top of the cake to make evenly spaced Ho, Ho, Hos."}
{"text": "Remove all the fat from inside the bird and use a skewer to prick the goose skin all over, especially under the wings. If you have time to spare (although this isn’t essential), sit the goose in a sink, then slowly and carefully pour over 3 kettles of boiling water. Dry with kitchen paper, then leave for 1 hr or so to dry completely. This will help the skin to crisp.\nHeat oven to 200C/180C fan/gas 6. Season the goose cavity with salt and pepper and stuff with the oranges, bay leaves and the thyme. Rub the breast and legs with 2 tbsp oil and season generously with salt. Lay the carrots in the middle of a very large roasting tin. Sit the bird the right way up on top of the carrots. In a bowl, toss the parsnips and turnips with the rest of the oil and bay leaves, then scatter around the goose. Cover the tin with a large piece of foil, scrunching it up at the sides so it’s a tight fit. Place the goose in the oven for 1½ hrs.\nTake the goose out of the oven. Remove the foil and carefully use a baster to suck out most of the fat from the tin into a bowl. Lightly baste the goose and turn the parsnips. Re-cover with foil and roast for another 1½ hrs. Suck the fat from the pan again and baste, then increase the heat to 220C/200C fan/gas 7. Return to the oven without any foil to brown for a final 30-40 mins until golden brown. Remove the goose from the oven and transfer to a large board or platter to rest in a warm-ish place for 30 mins. Scoop the vegetables out into another roasting tin and keep warm in a low oven. Keep the goose tin to finish making the gravy in.\nTo make the gravy, remove the oranges from the goose using tongs. Pour off all the fat from the roasting tin into a bowl (it’s great used for roasting potatoes). Scatter the sugar into the tin and stir to scrape off any tasty brown bits. Splash in the vinegar, simmer down until practically dry, then stir in the jelly to dissolve, bubble and cook down. Finally, add the stock and squeeze in the juice from the oranges. Bring everything to the boil, then strain into a jug or small saucepan to reheat later.\nPeel and halve the pears. Use a teaspoon to scoop out the cores, then cut the pears into quarters. In a bowl, toss the pears in the icing sugar until completely coated. Heat a large frying pan over a high flame and add the pears to the pan. Cook for 1 min or so, tossing constantly, until the pears are really well caramelised and slightly burnt around the edges.\nServe the goose on a platter surrounded by watercress and pear wedges. Serve the slow-roasted vegetables in a separate bowl and the gravy in a gravy boat."}
{"text": "Tip the peppers, chillies (with seeds), ginger and garlic into a food processor, then whizz until very finely chopped. Scrape into a heavy-bottomed pan with the tomatoes, sugar and vinegar, then bring everything to the boil. Skim off any scum that comes to the surface, then turn the heat down to a simmer and cook for about 50 mins, stirring occasionally.\nOnce the jam is becoming sticky, continue cooking for 10-15 mins more, stirring frequently so that it doesn’t catch and burn. It should now look like thick, bubbling lava. Cool slightly, transfer to sterilised jars, then leave to cool completely. Keeps for 3 months in a cool, dark cupboard – refrigerate once opened."}
{"text": "Heat oven to 220C/fan 200C/gas 7.\nSit the \n on a \n, \n with \n and season with pepper, then roast for 15 mins for medium-rare or 20 mins for medium. When the beef is \n, remove from the oven to cool, then chill in the fridge for about 20 mins.\nWhile the beef is cooling, \n \n as finely as possible so they have the texture of coarse breadcrumbs. You can use a \n to do this, but make sure you pulse-chop the mushrooms so they don’t become a slurry.\nHeat \n and \n in a \n and fry the mushrooms on a medium heat, with \n, for about 10 mins stirring often, until you have a softened mixture.\nSeason the mushroom mixture, pour over \n and cook for about 10 mins until all the wine has been absorbed. The mixture should hold its shape when stirred.\nRemove the mushroom duxelle from the pan to cool and discard the thyme.\nOverlap two pieces of cling film over a large \n. Lay \n on the cling film, slightly overlapping, in a double row.\nSpread half the duxelles over the prosciutto, then sit the fillet on it and spread the remaining duxelles over.\nUse the cling film’s edges to draw the prosciutto around the fillet, then roll it into a sausage shape, twisting the ends of cling film to tighten it as you go.\nChill the fillet while you roll out the pastry.\nDust your work surface with \n. \n \n to a 18 x 30cm strip and place on a \n.\nRoll out the \n to about 28 x 36cm.\nUnravel the fillet from the cling film and sit it in the centre of the smaller strip of pastry.\nBeat the \n and \n the pastry’s edges, and the top and sides of the wrapped fillet.\nUsing a rolling pin, carefully lift and drape the larger piece of pastry over the fillet, pressing well into the sides.\nTrim the joins to about a 4cm rim. Seal the rim with the edge of a fork or spoon handle.\nGlaze all over with more egg yolk and, using the back of a knife, mark the beef Wellington with long diagonal lines taking care not to cut into the pastry.\nChill for at least 30 mins and up to 24 hrs. Heat oven to 200C/fan 180C/gas 6.\nBrush the Wellington with a little more egg yolk and cook until golden and crisp – 20-25 mins for medium-rare beef, 30 mins for medium. Allow to stand for 10 mins before serving in thick slices."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Line 2 baking sheets with baking paper. Put the flour, baking powder, spice and sugar in a large bowl, then mix well. Stir in the eggs and zest until the mixture starts forming clumps, then bring the dough together with your hands – it will seem dry at first but keep kneading until no floury patches remain. Add the fruit and nuts, then work them in until evenly distributed.\nTurn the dough out onto a lightly floured surface and divide into 4 pieces. With lightly floured hands, roll each piece into a sausage about 30cm long. Place 2 on each tray, well spaced apart. Bake for 25-30 mins until the dough has risen and spread and feels firm. It should still look pale. Remove from the oven, transfer to a wire rack for a few mins until cool enough to handle, then turn down the oven to 140C/fan 120C/gas 1.\nUsing a bread knife, cut into slices about 1cm thick on the diagonal, then lay the slices flat on the baking sheets. The biscuits can be cooled and frozen flat on the sheet at this point, then bagged and frozen for up to 2 months. Bake for another 15 mins (20 mins if from frozen), turn over, then bake again for another 15 mins until dry and golden. Tip onto a wire rack to cool completely, then store in an airtight tin for up to one month, or pack into boxes or cellophane bags if giving as gifts straightaway."}
{"text": "Line base and sides of a deep, 22-23cm loose-bottomed round tin with baking parchment. Mix the biscuits, melted butter and 2 tbsp of the sugar, then press into base. Chill while you make the filling.\nDivide cream cheese and cream evenly between 2 bowls. Add the white chocolate to one, and the milk chocolate, malt and remaining 3 tbsp sugar to the other. Beat each with an electric whisk until smooth.\nSpread the milk chocolate mixture evenly in the tin. Wipe round the edge to give a smooth edge. Spoon the white chocolate mix over the top and gently smooth. Decorate with Maltesers and chill for at least 5 hrs until firm."}
{"text": "Put a \n in the oven (one big enough to take the potatoes in a single layer) and heat oven to 200C/fan 180C/gas 6.\n the 1kg potatoes and cut each into 4 even-sized pieces if they are medium size, 2-3 if smaller (5cm pieces).\nDrop the potatoes into a large \n and pour in enough water to barely cover them.\nAdd salt, then wait for the water to boil. As soon as the water reaches a full rolling boil, lower the heat, put your timer on and simmer the potatoes uncovered, reasonably vigorously, for 2 mins.\nMeanwhile, put 100g duck or goose fat or 100ml olive oil into the hot roasting tin and heat it in the oven for a few mins, so it’s really hot.\nDrain the potatoes in a colander then shake the \n back and forth a few times to fluff up the outsides.\nSprinkle with 2 tsp flour and give another shake or two so they are evenly and thinly coated. \nCarefully put the potatoes into the hot fat – they will sizzle as they go in – then turn and roll them around so they are coated all over.\nSpread them in a single layer making sure they have plenty of room.\nRoast the potatoes for 15 mins, then take them out of the oven and turn them over.\nRoast for another 15 mins and turn them over again. Put them back in the oven for another 10-20 mins, or however long it takes to get them really golden and crisp. The colouring will be uneven, which is what you want.\nScatter with Maldon salt and serve straight away."}
{"text": "Line the base of a deep, round 20cm loose-bottomed cake tin with a circle of baking parchment. Line the sides with one long strip that comes just above the sides of the tin – staple or paper clip where the strip overlaps to hold it in place.\nCrush the biscuits in a plastic bag or bowl with the end of a rolling pin. Stir into the melted butter, then evenly press into the bottom of the tin. Chill for 10 mins.\nReserve 2 tbsp of the caramel. Stir the sea salt into the remainder and spoon into the centre of the biscuit base. Gently spread so the base is evenly covered but a visible 1-2cm border of biscuit remains around the edge. Chill for 20 mins while you make the chocolate layer.\nGently melt the chocolate in a large heatproof bowl over a pan of barely simmering water. Stir 1 tbsp of the cream into the reserved caramel, then cover and chill until ready to decorate. Once the chocolate has melted, turn off the heat but leave the bowl where it is, and gradually stir in the remaining cream until you have a smooth, shiny, thick chocolate sauce. Sift in the icing sugar and stir in with the vanilla extract. Lift off the heat and let the mixture cool for 10 mins.\nLadle or pour the chocolate mixture around the edge of the torte first, so it fills the biscuit border, sealing the caramel in the centre. Then ladle or pour in the rest and gently shake to smooth the surface. Chill for at least 5 hrs or up to 24 hours until firm.\nRemove the torte from the tin, then carefully peel off the strip of paper and transfer to a serving plate. Dot the chocolates on top. Spoon the reserved caramel-cream mixture into a small food or freezer bag. Snip off the tiniest tip of the corner to make a very small opening, then squiggle lines of caramel over the top. Chill until ready to serve. Scatter with a pinch or two of sea salt before serving, then thinly slice. Eat with a drizzle of single cream, if you like."}
{"text": "Mix the butter, sugar and vanilla extract with a wooden spoon. stir in the flour, then tip in the pistachios and cranberries – you might need to get your hands in at this stage to bring the mix together as a dough. Halve the dough and shape each half into a log about 5cm across. Wrap in cling film, then chill for 1 hr or freeze for up to 3 months.\nHeat oven to 180C/160C fan/gas 4. slice the logs into 1cm-thick rounds, place on a baking tray lined with baking parchment and bake for 12-15 mins. Cool completely on the tray."}
{"text": "Place 375g plain flour and 260g softened unsalted butter in a \n and rub together to a crumb consistency.\nAdd 125g caster sugar and 1 large beaten egg, and \n together.\nTip out onto a lightly floured surface and fold until the pastry comes together, be careful not to over mix.\nWrap the pastry in cling film and chill for 10 mins.\nScoop the large jar of mincemeat into a bowl and add 2 segmented satsumas, 1 finely chopped apple and \n of 1 lemon.\nHeat oven to 220C/200C fan/gas 7.\n out the pastry to 3mm thick.\nUsing a round cutter (about 10cm), cut out 16 bases and place them into muffin trays. Put 1½ tbsp mincemeat mixture into each. \n the edge of each pie with a little beaten egg.\nRe-roll out the pastry to cut 7cm lids and press them on top to seal. Glaze with the beaten egg, sprinkle with the extra caster sugar, then make a small cut in the tops.\nBake the mince pies for 15-20 mins until golden brown. Leave to cool before releasing them from the muffin trays and dusting with a little more icing sugar before serving."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Butter and line the bottom of a deep, round 20cm cake tin with greaseproof paper. Beat the first seven ingredients together in a large bowl (electric hand- beaters are best for this), until pale and thick. Using a large metal spoon, gently fold in the fruit until evenly combined.\nSpoon the batter into the tin and bake for 50 mins-1 hr or until the cake is dark golden, springy to the touch and has shrunk away from the tin slightly. A skewer inserted into the centre will come out clean when it’s ready. Cool completely before decorating. Will keep, wrapped in an airtight container or iced, for up to a week, or can be frozen un-iced for up to a month – defrost fully before decorating."}
{"text": "Place all ingredients except cranberries in a large heavy-based saucepan, then gently heat, stirring, until the sugar dissolves. Bring to the boil, then reduce heat and simmer, uncovered, for about 50 mins, stirring regularly until the apples and onions are tender, the mixture has thickened and no watery juice remains.\nAdd the cranberries, then cook for a further 10 mins or so until just softened but not burst.\nSpoon the hot chutney into sterilised jars and seal (see instructions below). Store unopened in a cool, dark place. The chutney will keep for up to 6 months. Chill on opening."}
{"text": "Put the onion, cloves, bay leaf, peppercorns and a pinch of salt in a saucepan with the milk. Heat gently until it just comes to the boil, then remove from the heat and leave to infuse for 20 mins.\nPut the ciabatta in a food processor and process into chunky crumbs. Strain the milk into a clean pan, discarding the onion and spices. Stir in the ciabatta crumbs and bring to a simmer, then cook gently for 2 mins. Remove from the heat and stir in the butter, cream and nutmeg. Check and adjust the seasoning if necessary."}
{"text": "Preheat the oven to fan 180C/ conventional 200C/gas 6. Dry fry the seeds briefly in a small pan over a medium heat until toasty – don’t let them burn. Grind coarsely using a pestle and mortar (or a bowl and the end of a rolling pin), then mix in the paprika, cinnamon, 1⁄2 tsp salt and 4 tbsp oil. Tip the squash into a roasting tin, pour over the spiced oil and toss. Roast for 20 minutes.\nMeanwhile, heat 2 tbsp of oil in a frying pan, add the shallots and cook, stirring, until they start to brown. Stir in the ginger and 100g/4oz each almonds and pistachios.When brown, toss in the cranberries, 2 tbsp honey, and the spinach so it wilts. Take off the heat and stir into the squash, when it comes out of the oven. Set aside.\nIn a food processor, whizz the chickpeas with the garlic, cumin, remaining oil, lemon juice, 2 tbsp water and salt and pepper to make houmous. Stir in the coriander.\nMelt the butter in a small pan. Put a loose-bottomed 28cm quiche tin on a baking sheet and brush with some butter. Keeping the filo covered with a damp cloth so it doesn’t dry out, lay one sheet over half of the tin so that it hangs over the edge by about 10cm. Lay another sheet on the other side, so it overlaps the first in the centre and hangs over the opposite edge. Brush with butter. Lay two more filo sheets in the opposite direction in the same way and brush with more butter.\nBuild up two more layers in this way, so you use a total of eight sheets of filo. Pile half the squash mixture in the centre of the pastry. Spread over the houmous and then the rest of the squash mixture.One at a time, bring the edge of each filo sheet up to the centre to cover the filling, creating voluptuous folds as you go. Brush carefully with more butter. (If making a day ahead, cover now with cling film and chill. To reheat, remove the pie from the fridge, heat the oven, then bake for 35-40 minutes.)\nBake for 30-35 minutes, until crisp and golden. Just before the pie is ready, reheat any remaining butter in the pan, tip in the rest of the nuts and fry until golden. Spoon in the 4 remaining tbsps of honey and, when it melts, take off the heat and pour over the pie. Serve with Harissa yogurt sauce (mix the yogurt and milk together to make a thin sauce, stir in the herbs and season. Swirl in harissa to taste) and lemon wedges."}
{"text": "Oil and line a 1-litre loaf tin with cling film. Put the coffee, Tia Maria or brandy, egg yolks and sugar in a bowl and stir to dissolve the coffee. Put the egg whites in a large bowl and pour the cream in another.\nBeat the egg whites until stiff with an electric whisk, then quickly beat the egg yolk mixture until thick and leaving a trail. Now beat the cream until it holds its shape. If you beat everything in this order, you don’t need to wash the whisks in between.\nFold the cream into the coffee mixture, then carefully fold in the whites. Fold through the Toblerone and tip into the loaf tin. Lightly cover the surface with cling film. When frozen, overwrap in foil and freeze. Will keep for up to 6 weeks. You can make the chocolate curls (see video link, above, for instructions) and keep them in a airtight container or freeze.\nTo serve, unwrap and turn onto a platter. Strip off the cling film and serve topped with the chocolate curls."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Melt the butter, sugar and syrup in a pan. Mix the flour, bicarbonate of soda and ground ginger into a large bowl, then stir in the butter mixture to make a stiff dough. If it won’t quite come together, add a tiny splash of water.\nCut out the template (download from ingredients list). Put a sheet of baking paper on your work surface and roll about one quarter of the dough to the thickness of two £1 coins. Cut out one of the sections, then slide the gingerbread, still on its baking paper, onto a baking sheet. Repeat with remaining dough, re-rolling the trimmings, until you have two side walls, a front and back wall and two roof panels. Any leftover dough can be cut into Christmas trees, if you like.\nPick out the most intact flaked almonds and gently poke them into the roof sections, pointy-end first, to look like roof tiles. Bake all the sections for 12 mins or until firm and just a little darker at the edges. Leave to cool for a few mins to firm up, then trim around the templates again to give clean, sharp edges. Leave to cool completely.\nPut the egg whites in a large bowl, sift in the icing sugar, then stir to make a thick, smooth icing. Spoon into a piping bag with a medium nozzle. Pipe generous snakes of icing along the wall edges, one by one, to join the walls together. Use a small bowl to support the walls from the inside, then allow to dry, ideally for a few hours.\nOnce dry, remove the supports and fix the roof panels on. The angle is steep so you may need to hold these on firmly for a few mins until the icing starts to dry. Dry completely, ideally overnight. To decorate, pipe a little icing along the length of 20 mini chocolate fingers and stick these lengthways onto the side walls of the house. Use three, upright, for the door.\nUsing the icing, stick sweets around the door and on the front of the house. To make the icicles, start with the nozzle at a 90-degree angle to the roof and squeeze out a pea-sized blob of icing. Keeping the pressure on, pull the nozzle down and then off – the icing will pull away, leaving a pointy trail. Repeat all around the front of the house. Cut the chocolate mini roll or dipped Flake on an angle, then fix with icing to make a chimney. Pipe a little icing around the top. If you’ve made gingerbread trees, decorate these now, too, topping each with a silver ball, if using. Dust the roof with icing sugar for a snowy effect. Lay a winding path of sweets, and fix gingerbread trees around and about using blobs of icing. "}
{"text": "Heat the oven to 180C/ fan 160C/ gas 4 and line the base and sides of a 1.5 litre loaf tin with parchment paper.\nHeat 1 tbsp olive oil and 15g butter in a large \n and cook 1 finely chopped large onion and 2 finely chopped celery sticks for about 5 mins until beginning to soften.\nStir in 2 finely chopped garlic cloves and 200g finely chopped chestnut mushrooms and cook for a further 10 mins.\nStir in 1 finely diced red pepper and 1 \n and cook for about 3 mins then add 1 tsp dried oregano and 1 tsp smoked paprika and cook for just a minute.\nAdd 100g red lentils and 2 tbsp tomato purée and cook for about 1 min, then add 300ml vegetable stock and simmer over a very gentle heat until all the liquid has been absorbed and the mixture is fairly dry. This should take about 25 minutes. Set aside to cool.\nFinally, stir in 100g fresh breadcrumbs, 150g chopped mixed nuts, 3 lightly beaten large eggs, 100g grated mature cheddar, a handful of finely chopped flat-leaf parsley and a pinch of salt and some ground black pepper.\nStir to mix well then spoon the mixture into the prepared tin and press down the surface.\nCover with foil and bake for 30 mins, then remove the foil and bake for a further 20 mins until firm when pressed gently.\nMeanwhile, to make the sauce, heat 2 tbsp extra virgin olive oil very gently then add 2 finely sliced garlic cloves and 1 rosemary sprig and heat without colouring.\nPour in 400ml passata and add a pinch of salt and some ground black pepper. Simmer gently for just 15 mins.\nAllow the loaf to cool in the tin for about 10 mins then turn out onto a serving board or plate. Remove the baking paper and cut into slices and serve with a little of the tomato sauce.\nTo make a vegan nut roast, use an extra tbsp of oil in place of butter, no cheese and 3 tbsp egg replacer. Bake your nut roast for 1 hour. The loaf will still be soft in the middle after cooking.\nIt can be cooked in advance and then chilled, sliced and reheated to make it easier to serve."}
{"text": "Put 2kg unsmoked boneless gammon joint in a large pan and cover with 2l cola. Add 1 chopped carrot, 1 quartered onion, 1 chopped celery stick, 1 cinnamon stick, ½ tbsp peppercorns and 1 bay leaf.\nBring to the boil, then turn down to simmer for around 2 ½ hrs, topping up with boiling water if necessary to keep the gammon fully covered.\nCarefully pour the liquid away, then let the ham cool a little while you heat the oven to 190C/170C fan/gas 5.\nLift the ham into a \n, then cut away the skin leaving behind an even layer of fat. Score the fat all over in a criss-cross pattern.\nMix 150ml maple syrup, 2 tbsp wholegrain mustard, 2 tbsp red wine vinegar and a pinch of ground cloves or five-spice in a jug.\nPour half over the fat, roast for 15 mins, then pour over the rest and return to the oven for another 30 mins, baste half way through.\nRemove from the oven and allow to rest for 10 mins, then spoon more glaze over the top."}
{"text": "Preheat the oven to 220C/gas 7/fan 200C. Pour the oil into a large roasting tin or ovenproof dish and put in the oven for a couple of minutes to heat through. Add all the vegetables to the tin, except the beans, stirring to coat them in the hot oil. Season with salt and pepper and return to the oven for 15 minutes until beginning to brown.\nWhile the vegetables are roasting, stir together the stock, curry paste, chilli, saffron and mustard seeds.\nMix the rice and green beans with the vegetables in the tin, then pour over the stock mixture. Lower the oven to 190C/gas 5/fan 190C. Cover the dish tightly with foil and bake for 30 minutes until the rice is tender and the liquid has been absorbed. Stir in the lemon juice and check the seasoning, then scatter over the coriander and cashew nuts. Serve with a pile of poppadums and a bowl of raita."}
{"text": "First make a ginger syrup. Combine 100ml water with the golden caster sugar and a handful of sliced ginger in a pan and bring to the boil. Cool the mixture and strain through a sieve.\nFill a highball glass with ice and pour the advocaat and ginger syrup into a cocktail shaker. Shake well, pour into the glasses, top with Babycham and serve."}
{"text": "Heat a large frying pan, melt the butter, then add the onion and leeks. Cover, then very gently cook for 15 mins until soft. Add the potatoes after 5 mins cooking.\nStir in the flour, turn up the heat, then add the stock, stirring until the mix thickens a little. Take off the heat, then stir in the crème fraîche, mustard and ham. Season to taste, then cool, if you have time. Spoon the mix into a large pie dish, adding a couple of bay leaves. Heat oven to 220C/fan 200C/gas 7.\nRoll out the pastry on a floured surface to the thickness of a £1 coin. Cut a pastry strip the same width as the lip of the dish, wet the edge of the dish with egg, then fix the strip around it. Brush the top with egg, then lay over the remaining pastry.\nTrim pastry to the edge of the dish, then ruffle the cut edges with the knife blade to help the layers rise. Cut a few slits to let the steam escape, decorate with bay leaves, if you like, then brush all over the top with egg. Can be done up to a day ahead, keep chilled. Bake for 30 mins until risen."}
{"text": "Stone and chop 225g medjool dates quite small, put them in a bowl, then pour over 175ml boiling water.\nLeave for about 30 mins until cool and well-soaked, then mash a bit with a fork. Stir in 1 tsp vanilla extract.\nButter and flour seven mini pudding tins (each about 200ml/7fl oz) and sit them on a baking sheet. Heat oven to 180C/fan 160C/gas 4.\nWhile the dates are soaking, make the puddings. Mix 175g self-raising flour and 1 tsp bicarbonate of soda together and beat the 2 eggs in a separate bowl.\n 85g softened butter and 140g demerara sugar together in a large \n for a few mins until slightly creamy (the mixture will be grainy from the sugar). Add the eggs a little at a time, beating well between additions.\nBeat in 2 tbsp black treacle then, using a large metal spoon, gently fold in one-third of the flour and bicarbonate of soda mix, then half of the 100ml milk, being careful not to overbeat. Repeat until all the flour mix and all the milk is used.\nStir the soaked dates into the pudding batter. The mix may look a little curdled at this point and will be like a soft, thick batter.\nSpoon it evenly between the tins and bake for 20-25 mins, until risen and firm.\nMeanwhile, put the 175g light muscovado sugar and 50g butter pieces for the sauce in a medium \n with half the 225ml double cream.\nBring to the boil over a medium heat, stirring all the time, until the sugar has completely dissolved.\nStir in 1 tbsp black treacle, turn up the heat slightly and let the mixture bubble away for 2-3 mins until it is a rich toffee colour, stirring occasionally to make sure it doesn’t burn. Take the pan off the heat and beat in the rest of the double cream.\nRemove the puddings from the oven. Leave in the tins for a few mins, then loosen them well from the sides of the tins with a small \n before turning them out.\nYou can serve them now with the sauce drizzled over, but they’ll be even stickier if left for a day or two coated in the sauce. To do this, pour about half the sauce into one or two ovenproof serving dishes.\nSit the upturned puddings on the sauce, then pour the rest of the sauce over them. Cover with a loose tent of foil so that the sauce doesn’t smudge (no need to chill).\nWhen ready to serve, heat oven to 180C/fan 160C/gas 4. Warm the puddings through, still covered, for 15-20 mins or until the sauce is bubbling. Serve them on their own, or with cream or custard."}
{"text": "In a preserving pan or your largest saucepan, mix together all the ingredients well. Bring to a gentle simmer, then cook for 1 hr, stirring occasionally, until the chutney is thick and the beetroot tender.\nWhile the chutney is cooking, prepare your jars by running through a short hot wash in your dishwasher. Or wash thoroughly by hand, then put in a hot oven to sterilise for 10-15 mins. Once the chutney is ready, let it settle for 10 mins, then carefully spoon into the jars and seal while still hot. You can eat it straight away but it will be even better after a month. Will keep for up to 6 months in a cool dark place. Once opened, refrigerate and eat within 2 months."}
{"text": "Heat the oven to 160C/ 140C fan/ gas 3 and grease a 850ml/1½ pint shallow baking dish with a little of the 50g butter.\nCut 250g panettone into wedges, leaving the crusts on.\nButter the slices lightly with the rest of the butter. Cut the slices in half and arrange them in the dish, buttered side up.\u2028\nIn a bowl, whisk together 2 eggs, 142ml double cream, 225ml milk, 1 tsp vanilla extract and 2 tbsp caster sugar and pour evenly over the panettone.\nPut the dish in a roasting tin and pour hot water around it to a depth of about 2.5cm/1in. Bake for 35 minutes until the pudding is just set - it should be yellow inside and nicely browned on top. \nDust with icing sugar and serve with spoonfuls of whipped cream.\u2028"}
{"text": "Put the gammon in a very large pan and cover with cold water. Add the spices and bay. Bring to the boil, then turn down and simmer for around 1 hr 50 mins, topping up the water level with boiling water, if necessary. Scoop off any scum that rises to the top every now and then.\nCarefully pour the liquid away (I like to keep it for making soup), then let the ham cool a little while you heat the oven to 190C/fan 170C/gas 5. Lift the ham into a large roasting tin, then cut away the skin leaving behind an even layer of fat. Score the fat all over in a criss-cross pattern, then stud cloves all over the ham. Can now be chilled for up to 2 days.\nMix the glaze ingredients in a jug. Pour half over the fat, roast for 15 mins, then pour over the rest and return to the oven for another 35 mins, basting with the pan juices 3-4 times as it bakes. Turn the pan around a few times during cooking so the fat colours evenly. Remove from the oven and allow to rest for 15 mins before carving. Can be roasted on the day or up to 2 days ahead and served cold."}
{"text": "Heat oven to 220C/200C fan/gas 7 and put the muffin cases in a 12-hole muffin tin. Mix the flour, ground almonds, baking powder, bicarb, 1/4 tsp cinnamon, the sugar, marzipan, nuts and dried fruit in a mixing bowl. Whisk together the eggs, melted butter, yogurt and almond extract, then pour over the dry ingredients and very quickly mix with a wooden spoon until the mixture has just come together – the most important thing is to not overmix – don’t worry if there are still a few floury bits.\nQuickly divide the mix between the cases and put in the oven on the top shelf. Bake for 5 mins, then lower the heat to 180C/160C fan/gas 4 and bake for 15 mins more until they are risen, golden, and a skewer inserted into the middle of them comes out clean.\nOnce they have cooled a little and are firm enough to handle, lift out of the tin onto wire racks and cool for 5 mins. Mix the icing sugar with the remaining 1/4 tsp cinnamon and sieve over the muffins. Serve warm. Will keep for 3 days in an airtight container."}
{"text": "In a toaster or under a grill, toast the bread slices on both sides until dark brown. Leave to cool, then pulse in a food processor to make rough crumbs.\nHeat half the butter in a saucepan and cook the onion gently for about 10 mins until just starting to brown and turn sticky. Add the bay leaf and thyme, and pour over the milk. Mix in the spices and season with a sprinkling of salt and pepper. Bring to the boil and simmer gently for 5 mins.\nRemove the herbs, then stir in all but a handful of the crumbs and cook over a low heat, simmering gently, until thickened. For a very smooth sauce, blitz with a hand blender in the pan. Can be chilled for up to 2 days or frozen for up to 2 months, then reheated to serve.\nWhile the sauce simmers, melt the remaining butter in a small frying pan and cook until sizzling and nut-brown. Throw in the remaining crumbs and cook in the butter until really crisp, then turn off the heat.\nAdd the cream to the sauce and heat for a few mins more, then tip into a serving dish. Spoon over the crisp crumbs and any remaining nutty butter to serve."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Place the potatoes into a pan of salted water, bring to the boil and simmer for 2 mins exactly. Drain well and toss in a little of the oil to coat.\nStir the flour, parmesan, herbs and nutmeg together in a dish with a small pinch of salt and toss the potatoes in the mix until evenly coated. Heat a good layer of oil in a shallow, non-stick roasting tray on a hob or in the oven, then carefully add the potatoes to the tray. Turn the potatoes to coat them in the oil and roast for 40 mins, turning once. If they feel like they are sticking to the pan, don’t move them, just leave them for the full time. Roast until golden brown and crisp, and serve straight away."}
{"text": "Make the middles first. Heat the Dulce de Leche in a pan for 1 min until warmed and runny, then stir in the chopped dark chocolate and leave to melt. Stir until smooth. Cover a dinner plate with cling film, oil the cling film well, then tip the mix onto it. Cool, then freeze for 2 hrs or until very firm.\nPut the milk chocolate into a bowl. Bring the cream to the boil in another pan, then pour it over the chocolate. Leave for 2 mins, then add the vanilla and stir until smooth. Cool, then chill until set.\nPeel the caramel from the cling film, then snip into thumbnail-size pieces; wet kitchen scissors work best. Spread cocoa powder over a large baking tray. Take a heaped tsp of the truffle mix then, with cocoa-dusted hands, poke in a caramel chunk. Squash the mix around the caramel to seal, then roll into a ball. Put onto the tray, then shake to coat in the cocoa. Repeat with the rest of the mix, then freeze, or chill if making less than 3 days ahead."}
{"text": "Heat a drizzle of oil in a frying pan, and use a little more to grease a 900g loaf tin. Put the onion in the pan and cook gently for 10-15 mins until caramelised. Tip into a large bowl and set aside to cool. Line the loaf tin with a double strip of foil, leaving plenty overhanging either end (you can use this as a handle to remove the parcel once cooked).\nStretch each piece of bacon a little with the back of your knife. Arrange the rashers so the base of the tin is covered with overlapping bacon and the rashers come neatly up the sides in a single layer, overhanging generously. Sprinkle the breadcrumbs on top of the bacon.\nOnce the onion has cooled, add the sausagemeat and sage to the bowl. Mix everything together, then pack half the mixture into the tin. Spread over about a third of the cranberry sauce.\nCut each turkey breast steak into three strips. Layer roughly half the turkey on top of the stuffing mix, filling any gaps like a jigsaw, but keeping the turkey in one thick layer, then season. Spread over a little more cranberry sauce, then top with the remaining stuffing, cranberry sauce and turkey in the same way, making sure there are no gaps between the layers. The parcel should be full to the top when you’re finished. Fold over the overhanging bacon and wrap the tin in foil. Can now be chilled for up to 2 days.\nHeat oven to 180C/160C fan/gas 4. Put the tin on a baking tray and cook for 1 hr 30 mins. Remove the tin from the oven and leave to cool for 10 mins. Carefully lift the parcel out of the tin, using the foil handles. Roll the parcel over onto a baking tray. Return to the oven for a further 15-20 mins until the outside is crisp and browning. Test the internal temperature with a thermometer, if you have one – it should read 75C when it’s ready. Or insert a metal skewer into the centre of the parcel and check it is piping hot. Cover loosely with foil and leave to rest for at least 15 mins before serving. Top with the reserved sage leaves, then slice. Leftovers will keep in the fridge for 2 days."}
{"text": "Heat oven to 220C/200C fan/gas 7. Boil potatoes for 15 mins until tender, then drain well and smash a little. Cool slightly.\nMix the cheese, cayenne and onions with the smashed potatoes and stir to make a mouldable filling. Roll out the pastry to a rectangle about 25 x 35cm. Carefully lift onto a baking sheet and brush all over with beaten egg.\nPress the cheese mix along one of the long sides of the pastry, leaving 2cm pastry free on one side for sealing, and half of the pastry empty on the other side for folding over later. Fold the pastry over the filling and press the edges together, before trimming with a knife and sealing well by pressing the edges with a fork.\nBrush with egg and bake for 30 mins. Cool, then slice and serve with caramelised red onions. Can be made 1 day ahead"}
{"text": "Put the flour, butter and salt into the bowl of a food processor, then pulse until the mix looks like fine crumbs. Splash in 4 tbsp cold water, then pulse to a dough. Turn onto a lightly floured surface, shape into a smooth disc, then wrap and chill for at least 10 mins. Heat oven to 200C/fan 180C/gas 6.\nRoll pastry out on a floured surface until large enough to line a 23cm loose-bottomed tart tin. Line the tin with the pastry, leaving any excess pastry overhanging. Line with baking paper, then fill with baking beans. Bake on a baking sheet for 15 mins. Take out the paper and beans, then bake for 10 mins more until pale golden and cooked. Use a serrated knife to trim the pastry level with the tin – resting the knife flat on the edge of the tin will help achieve an even finish.\nWhile the pastry cooks, soften the onions in the oil over a medium heat for 10 mins until golden. Beat the eggs and cream together, then season to taste. Crumble up the hard cheeses and chop or pull the creamy cheese into small pieces. Scatter the cheese into the pastry case, add the onions, then pour in the egg mix. Turn the oven down to 160C/fan 140C/gas 3 and bake for 40 mins until set and lightly golden."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Line 12 bun tins with paper cases. Put the flour, sugar, spice, butter, eggs and milk into a mixing bowl and beat with an electric hand whisk or wooden spoon for 2-3 mins, until the mix is light and fluffy.\nPut a spoonful of cake mix in each case, then a rounded tsp of mincemeat. Cover the mincemeat with a spoonful of cake mix and smooth.\nBake for 15-18 mins until golden brown and firm. Dust with icing sugar and serve warm or cold."}
{"text": "Heat oven to 200C/180C fan/gas 6. Line 2 baking sheets with baking parchment. Melt butter, sugar and syrup in a pan. Mix flour, soda, spices and a pinch of salt in a bowl. Stir in the butter mix and chopped ginger to make a stiff-ish dough.\nWait until cool enough to handle, then roll out dough to about 5mm thick. Stamp out gingerbread men, re-rolling and pressing the trimmings back together and rolling again. Lift onto baking sheets. Bake for 12 mins until golden. Cool 10 mins on the sheets, then lift onto cooling racks.\nTo decorate, mix icing sugar with a few drops of water until thick and smooth. Halve then slice cherries thinly to make smiles, and cut ginger into small squares. Spoon icing into a food bag, snip off the tiniest bit from one corner, then squeeze eyes and buttons, and a tiny smile onto 1 man at a time. Stick on a cherry smile and ginger buttons. Repeat; leave to set. Will keep up to 1 week in an airtight tin."}
{"text": "Sit the cake on a cake board or serving plate. Brush the top and sides with some of the jam. Roll out the marzipan on an icing-sugar-dusted surface until large enough to cover the top and sides of the cake – use a piece of string to help you measure. Carefully lift your marzipan on top and smooth down the sides of the cake to stick. Trim the bottom, then brush all over again with more jam.\nMake sure your surface is really clean, then dust again with a little icing sugar. Knead 850g of the icing until it is very smooth and pliable. As with the marzipan, roll out the icing, then cover the cake and once again trim any excess from the bottom. Smooth out any bumps or marks with the flats of your hands, rubbing the icing to buff it to a shine.\nPull off about a fifth of the remaining icing and knead in enough red food colouring to give a bright colour. Pinch off small amounts and roll between your fingers to make little ‘berries’. Sprinkle some glitter on a saucer and roll the balls in it to coat completely. Shake off any excess glitter and set aside to firm up.\nKnead some green food colouring into the remaining icing and roll it out thinly on an icing-sugar-dusted surface. Stamp out lots of holly leaves and begin sticking them onto your iced cake. Use a paintbrush to moisten the underside of each leaf with a little water – don’t make them too wet though, or the green colour might leak onto the rest of the cake. When you have added enough holly leaves, mix a splash of water into some icing sugar to make a runny but fairly stiff icing, and use this to stick on your glitter berries. Leave the cake for a good couple of hours to dry before cutting into it. The cake will sit happily uncut for up to 2 weeks. Once cut into, keep in an airtight tin for up to a month."}
{"text": "Tip the cream into a bowl and add the golden syrup, brandy and Disaronno. Stir to dissolve the syrup, then lightly whip with a hand whisk or electric beaters until the mixture holds its shape. Spoon into a serving bowl, cover and chill until ready to serve."}
{"text": "Using a ruler as a guide, cut your cake into 4 x 4cm squares with a small serrated knife, so you end up with 16 mini cakes. Divide your marzipan into 16 equal pieces.\nLightly dust your work surface with a little icing sugar and roll out each chunk of marzipan to a thin circle. Brush the top and sides of a square of cake with some jam, then turn upside down to stick in the middle of the marzipan. Flip upright, smooth the marzipan down the sides of the cake so it sticks, then trim any excess from the bottom. Repeat to cover all your mini cakes.\nTip the icing sugar into a big mixing bowl and stir in just enough dribbles of water to make a thick, but pourable, icing. Divide the icing into as many bowls as you want different colours, and add some food colouring to each.\nSit your cakes on a wire rack sat in a tray, or on kitchen paper. Spoon some icing over each cake until the top and sides are covered – you can repeat until all the icing is used up. Leave to set for 4 hrs, or overnight is best.\nDivide your ready-to-roll icing into 16 equal balls. Put a splash of water in a shallow saucer, and your sprinkles into others. One by one, roll each icing ball in the water to dampen, then roll immediately into sprinkles to coat (if you’ve got children helping and the balls are getting too wet, get them to roll the balls on damp pieces of kitchen paper instead). Pierce each ball with a cocktail stick, then leave to set alongside the cakes.\nTo finish, cut card into little flags and secure to the sticks with some tape. Add a name, number or Christmas message to each and let the festivities begin!"}
{"text": "Put the linseeds in a small bowl and mix with 2 tbsp water, then set aside for 5-10 mins until the water thickens to a gluey consistency. Meanwhile, place the onion in a food processor and whizz until finely chopped. Heat the oil in a frying pan, tip in the onion and cook for 5 mins until softened.\nTip the nuts into the food processor and whizz until coarsely chopped. Sprinkle 3 tbsp of the nuts over a plate and set aside. Add the lentils, breadcrumbs, sage, apple, linseeds (and any liquid in the bowl), onion and plenty of seasoning to the processor. Pulse to blend the mixture until just combined – don’t chop too finely or the stuffing will lose its nice nutty texture.\nLine a baking tray with foil and grease with a little oil. Remove the blade from the processor and oil your hands. Scoop out walnut-sized chunks of stuffing, roll into balls, then roll on the plate of chopped nuts to coat. Place on the prepared baking tray. Can be covered with cling film and chilled for up to 2 days, or frozen for 2 months.\nHeat oven to 200C/180C fan/gas 6. Unwrap (if chilled) and bake for 25-30 mins until the nuts are a little darker and the balls have firmed up slightly – they will be softer than traditional stuffing balls but will firm up after a few mins cooling. If you’re cooking from frozen, bake for 35-40 mins."}
{"text": "Tip the cranberries into a medium pan over a low heat with the orange juice, sugar and marmalade, and stir until the sugar and marmalade melt and the mixture starts to bubble. Cook for 3-5 mins, depending on whether the cranberries are fresh or frozen, as the frozen ones will soften more quickly. They need to be tender but still hold their shape, so try to squash one to see if it is soft enough. The sauce will thicken as it cools, but this has a looser texture than shop-bought. Will keep for 1 week in the fridge."}
{"text": "Put the dried fruit in a bowl with the brandy, rum or orange juice, cover with cling film and microwave on High for 1 min. Set aside to cool while you make the dough.\nPour the milk and honey into a pan and heat until they just come to the boil, then remove from the heat, add the butter and set aside to cool a little, swirling now and then to melt the butter. Meanwhile, mix the flour, yeast, spices and ½ tsp salt in a large bowl.\nWhen the milk has cooled to body temperature, pour into the flour bowl. Add the egg and zest, and mix together with a spoon, then with your hands, until the mixture comes together as a dough. If it’s a little sticky, add a little extra flour.\nTip out onto your lightly floured work surface and knead for 10 mins or until smooth and elastic. Transfer to a clean, lightly greased bowl, cover with greased cling film and leave to prove for 2 hrs or until doubled in size. You can put the dough in the fridge for up to 2 days at this point; just bring back to room temperature before continuing.\nWhen the dough has doubled in size, tip out onto the work surface and knock out the air bubbles. Knead in the soaked fruit.\nRoll the dough into a square, roughly 40 x 40cm, then cut into 3 long strips. Break the marzipan into 3 balls, then roll each to the same length as the strips of dough. Put 1 marzipan sausage on top of each strip of dough, then pinch the sides of the dough together to encase the marzipan – so you have 3 long sausages of marzipan-filled dough. Flip the dough over so the seams are underneath, then pinch the 3 ends together. Tightly plait the dough, pinching together to seal when you finish. Place the plait on a baking tray lined with baking parchment, tucking the ends under for a neat finish. Cover loosely with a sheet of oiled cling film, leave to prove for 30 mins-1 hr or until doubled in size.\nHeat oven to 190C/170C fan/gas 5. Uncover the plait, brush with the beaten egg and sprinkle over the almonds. Bake on the middle shelf of the oven for 30 mins until golden brown and cooked through. Transfer to a wire rack to cool and dust with icing sugar before serving. Will keep for up to 5 days in a sealed container."}
{"text": "First make an orange syrup. Combine 100ml water with the golden caster sugar and the orange or clementine zest in a pan and bring to the boil. Cool and strain the syrup.\nChill 4 coupé glasses, then dampen the rims with a little water and dip in the grated dark chocolate. In a cocktail shaker, shake the vodka, crème de cacao, orange syrup and orange juice with ice (you may need to make in 2 batches). Pour into the glasses."}
{"text": "Heat oven to 180C/160C fan/gas 4 and boil the kettle. First, make the chocolate cake. Liberally grease the bundt tin with butter, then dust with flour and shake out the excess. Put the cocoa in a bowl with a pinch of salt, cover with 150ml hot water from the kettle, mix until smooth, then set aside to cool. Put the butter and sugar in a bowl and whisk until light and fluffy. Add the eggs, one at a time, mixing well between each addition. Sift in the flour and baking powder and fold everything together. Stir the soured cream into the cocoa mixture, then add to the other bowl and mix until just combined, then scrape into the prepared tin. Bake for 35 mins until a skewer comes out clean. Leave to cool for 15 mins in the tin, then turn out onto a wire rack to cool completely.\nWhen the cake is cool, transfer to a baking sheet lined with baking parchment, and make space for the cake and tray in your freezer. Slice the cake into pieces roughly the thickness of your star cutter, then pull each piece out a little, so there is space around each one. Pop the cake in the freezer for 2 hrs, or overnight.\nWhen the cake is firmly frozen, lay each slice on its side, keeping them in the same circular pattern, and cut out a star, using the cutter, from the middle of each piece. Leftover cake can be kept in the freezer for up to 2 months, ready for making a trifle. Return the cut-out stars to the freezer.\nNow, make the peppermint cake. Grease the same bundt tin and heat your oven to 180C/160C fan/gas 4. Put the butter and sugar in a bowl and beat until pale and fluffy. Add the eggs, one at a time, mixing well between each, then add the flour, soured cream and peppermint extract. Give everything a good mix and scrape half the mixture into the bundt tin. Remove the stars from the freezer and line up in a circle on top of the cake mixture (pointy sides up) – make sure there are no gaps and that the stars perfectly line up. Spoon the remaining cake mixture on top, easing it around the stars until they are just covered. Bake for 45 mins until risen and golden brown and a skewer poked into the side of the cake comes out clean. Cool in the tin for 10 mins, then turn out onto a wire rack to cool completely.\nFor the icing, melt the chocolate in short blasts in the microwave, or in a bowl suspended over a pan of barely simmering water, stirring it occasionally. Set aside to cool a little. In a large bowl, beat the icing sugar and butter until pale and smooth. Add the chocolate and peppermint extract, and mix again until combined. When the cake is completely cool, place on a serving plate, then swirl over the chocolate icing, easing it about halfway down the sides to create a snowy effect. Place the Maltesers on top of the cake. Will keep for up to 3 days in a sealed container."}
{"text": "Bring a large pan of salted water to the boil and add the carrots. Simmer for 5 mins until slightly tender, then drain.\nIn a wide pan, heat the butter until melting, then add the carrots, ginger, honey and orange zest. Cook over a medium heat for 25-30 mins, turning them gently every now and then, until the carrots start to go golden and sticky.\nTurn the carrots gently in the pan every now and again until all sides are browning. Season well before serving."}
{"text": "Mix together the flour, yeast, mustard powder, 11/2 tsp fine salt, the sugar, thyme leaves and 1/2 tsp freshly ground black pepper. Stir in 250ml lukewarm water, use your hands to bring together into a dough, then knead for 10 mins on a clean surface until it is smooth and elastic. If you have a tabletop mixer with a dough hook, use this instead and ‘knead’ for just 5 mins. Sit the dough in a large, clean bowl, cover with oiled cling film and leave at room temperature for about 1 hr until doubled in size.\nHeat oven to 190C/170C fan/gas 5 and line your largest baking tray with baking parchment. Sit the lid of your boxed camembert in the centre of the tray.\nKnead the dough back into a smooth ball, then use your fingers to make a hole through the centre. Steadily stretch the doughnut shape into a large ring until the centre hole is large enough to fit around the lid. The best way to do this is to swing the dough around your fingers, then hand, like a hula-hoop.\nSit the dough ring on the tray around the box lid. Use kitchen scissors to snip the dough ring into 20 strips, from the outside in, but leave a few millimetres of dough still connecting the strips together around the lid in the centre. If using the ready-to-eat pancetta slices, halve each one lengthways. Twist one of the 20 dough strips to make it longer and thinner like a breadstick, then wrap a pancetta slice in a spiral around it. Repeat with all the dough strips.\nYour breadsticks might look a little higgledy-piggledy at the moment, so use kitchen scissors to snip the ends off any that need it to make an even, round shape, if you like (see tip below). Brush with a little light olive oil and bake for 15 mins.\nMeanwhile, unwrap the camembert and top with the thyme sprigs. Brush with olive oil and sprinkle with a little more black pepper. Remove the breadsticks from the oven and sit the cheese inside the box lid, then bake for another 5 mins until the bread is golden and crispy, and the cheese molten."}
{"text": "Put the peanut butter, butter and sugar in a food processor. Pulse until it comes together. Add the toffee and pulse again. Remove and, using the palms of your hands, roll mixture into small balls. Place on a tray. Chill for 30 mins.\nMelt the chocolate in a heatproof bowl in the microwave on High for 1 min or set over a pan of boiling water (make sure the bowl doesn't touch the water). Using a fork, dip the balls, one at a time, until half covered in chocolate. Roll in the peanuts. Put on a tray lined with baking parchment and leave to harden (about 2 hrs).\nStore between layers of baking parchment in a covered container and keep chilled. Will keep for 1 week in an airtight container."}
{"text": "Put the pork, breadcrumbs, chilli powder, salt, lime zest, spring onions, turmeric, cumin and ground and chopped coriander in a food processor and season well with ground black pepper. Blitz until the mixture is evenly combined and forms a very thick paste. Form the mince into 32 small ovals and place on a baking tray lined with baking parchment. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking.\nHeat oven to 220C/200C fan/gas 7. Bake the koftas for 10 mins or until lightly browned and cooked through. To make the guacamole, cut the avocados in half and remove the stones. Scoop the flesh into a bowl and add the garlic, chilli, lime juice and coriander. Mash well with a fork and season, then serve with the hot koftas."}
{"text": "Heat oven to 180C/160C fan/gas 4 and line 2 baking sheets with baking parchment. Arrange the candy canes in pairs on the trays, to make heart shapes. Put a lolly stick between each one, where they meet at the bottom. Put the trays in the oven and cook for 5 mins.\nThe candy canes should now be soft enough for you to carefully pinch together where they join at the top and the bottom, around the stick. Be careful as the canes will be extremely hot, but work quickly or they will set and you won’t be able to pinch them together.\nMelt the chocolate in a bowl over a pan of barely simmering water, or in the microwave. Spoon the melted chocolate into the middle of the heart lollies, pushing it out to fill the spaces. Scatter over your choice of sprinkles, then leave to cool completely. When set, peel off the baking parchment, wrap in cellophane bags and tie with a ribbon to give as a gift."}
{"text": "Pour the cream into a large bowl and the whisky and icing sugar. Whip until the cream just holds its shape. Serve alongside the your pudding."}
{"text": "To make the terrine, put the ham hocks in a large saucepan with the onion, bay leaves, cinnamon stick and peppercorns. Cover with water and bring to the boil, then reduce the heat and cook gently for 2 hrs. Once the meat is cooked, take the pan off the heat and leave to one side to cool.\nWhen cold, remove the ham hocks from the pan, then strain 300ml of the cooking liquid through a fine sieve and pour it into a saucepan. Put the gelatine in a bowl of cold water to soften for around 5 mins, then drain. Heat the cooking liquid until simmering but not boiling, then remove from the heat and add the softened gelatine leaves. Stir well and leave to cool.\nTake the ham from the bones and chop into small pieces. Line four x 200ml ramekins with cling film and add a third of the cooked ham to each to form the base layer. Pour over a little of the gelatine liquid, then sprinkle in a layer of parsley. Next, add another third of the ham and some more gelatine liquid. The next layer should be the tarragon, followed by the remaining ham and the rest of the gelatine liquid. Once all the layers are complete, cover the surface of each terrine with cling film, then a layer of foil. Put in the fridge with some weights on top – I put another ramekin on top of each terrine with an onion in it to weigh it down. Leave to set and compress in the fridge for about 2 hrs.\nFor the apple compote, peel, core and dice the apples. Put them in a saucepan with the butter, 4 tbsp water and the spices. Cook gently until softened. Remove the cinnamon stick, star anise and cloves, and stir in the sugar. Heat gently until the sugar has dissolved. Set aside.\nMake the vinaigrette dressing by whisking the tarragon with the vinegar and slowly adding the olive oil. Season to taste.\nPut the 25g butter in a non-stick frying pan and heat until foaming. Drop in the cubes of malt loaf and fry for around 2 mins, turning regularly, to lightly brown on all sides.\nTo serve, turn out a terrine onto each plate and carefully remove the cling film. Add spoonfuls of the apple compote and the cubes of toasted malt loaf. Drizzle a little of the tarragon dressing over the plate and terrine to complete the dish."}
{"text": "Heat oven to 180C/160C fan/gas 4. In a food processor, whizz the biscuits to a fine crumb. Pour in the melted butter and pulse briefly to mix well. Spoon into a 24cm pie dish and press into the base and up the sides. Bake in the oven for 10 mins to firm up.\nTo make the brownie layer, melt the butter and chocolate together in a bowl set over a pan of simmering water (making sure that the bottom doesn’t touch the water), or in short bursts in the microwave.\nIn a separate bowl, whisk the eggs until pale, fluffy and doubled in size, then add the sugar and whisk until thickened. Fold in the chocolate mixture, then sieve in the flour and fold in.\nPour into the baked biscuit case and return to the oven for 15–20 mins until the brownie has a crust on top. Set aside and leave to cool (if the brownie has risen a lot, it should sink down slightly as it cools).\nOnce the brownie base is cooled, put the custard, chocolate and vanilla in a pan and cook over a medium heat, stirring, until the chocolate has melted into the custard. Remove from the heat.\nSoak the gelatine in a little cold water and, once softened, remove from the water and squeeze to remove any excess. Stir into the warm custard mixture until dissolved. Let the custard cool slightly, then pour over the brownie layer. Put in the fridge for a few hrs, or overnight, until set.\nRemove the mud pie from the fridge about 30 mins before serving so that it can come to room temperature for easy slicing. Just before serving, whip the cream to soft peaks and spoon it over the custard layer, then grate over some dark chocolate."}
{"text": "Put your freezer on the fast-freeze setting, or clear some space in the coldest part of the freezer. Heat oven to 180C/160C fan/gas 4. Line a 23 x 33cm Swiss roll tin with baking parchment, grease with a little butter and set aside.\nFirst, make the sponge. Put the egg yolks and sugar in a large bowl and whisk with an electric whisk until thick and creamy. Sift the cocoa powder over the egg mixture and whisk in thoroughly. Wash and dry the beaters. In a clean bowl, whisk the egg whites until stiff but not dry. Fold a third of the egg whites into the cocoa mixture, then gently fold in the rest until evenly distributed.\nPour into the prepared tin and spread gently with a spatula. Bake in the centre of the oven for 25 mins or until well risen and just beginning to shrink away from the sides of the tin. Remove from the oven, loosen the edges with a round-bladed knife and leave to cool in the tin.\nPrepare the filling while the cake is cooling. Place a large sheet of cling film on the work surface, take the ice cream out of its tub and place on top. Working quickly, cover the ice cream with cling film, then press and roll into a long sausage shape. It will need to be 33cm long and around 5cm wide. Wrap a second piece of cling film around the first and twist the ends to maintain the sausage shape. Return to the freezer to harden for at least 1 hr.\nLine a baking tray with baking parchment. Take the ice cream out of the freezer, unwrap it and place in the centre of the sponge. Using the parchment to help you, bring up the sides to enclose the ice cream and carefully lift the roll onto the lined baking tray, rotating it so the seal is underneath. Trim the ends. Cover the cake and tin with cling film and place in the freezer for at least 4 hrs, or up to 1 week.\nMake the meringue topping 20 mins before serving. Put the sugar and 175ml water in a pan and bring to a rolling boil over a high heat. Continue to boil until it reaches 115C on a sugar thermometer.\nMeanwhile, put the egg whites in a large mixing bowl or tabletop mixer and whisk the egg whites to soft peaks. Continue whisking at high speed and very slowly trickle in the hot sugar syrup. The meringue will begin to thicken and become glossy after about 10 mins. Continue to whisk until it is just warm, then whisk in the vanilla extract. Use the meringue immediately, as it is easier to work with while warm.\nFit a large piping bag with a 1.5cm star nozzle and fill with the meringue. Take the baking tray out of the freezer and slide the log gently onto a serving platter using a couple of spatulas. Pipe the meringue in lines down the length, then around the ends. Use a cook’s blowtorch to scorch the meringue all over. Alternatively, bake for 8 mins at 220C/200C fan/gas 7 or until the meringue is set and lightly browned. Serve in generous slices (it will sit quite happily for 5-10 mins). Please note this recipe contains lightly cooked egg whites, which may be unsuitable for babies and toddlers, the elderly, pregnant women and people who already feel unwell."}
{"text": "Up to two days ahead, make the salt mix by grinding the salt with the thyme leaves and pepper in a spice grinder or using a \n. Sit the turkey in a roasting tin and gently push your fingers under the skin, starting from the neck, until you can push your whole hand in down the length of the breast. Take care not to tear the skin.\nSeason the bird all over with the salt mix, inside and out and under the skin. Leave the turkey in the tin, breast-side up, and put in the fridge for up to two days – the longer you salt it, the more succulent the turkey will be. For the crispest skin, leave the turkey uncovered so it dries out, but loosely cover it if you prefer.\nTip the butter, vegetable stock powder and lemon zest into a small bowl and mix until completely combined. Cover and chill. Can be made a few days ahead or frozen, wrapped in cling film, for one month.\nRemove the turkey from the fridge an hour or so before you want to cook it. Remove the butter from the fridge to soften. Heat oven to 180C/160C fan/gas 4. Work out your cooking time based on 40 mins per kg for the first 4kg, plus 45 mins for every kg after that.\nUse your hands to spread the butter under the skin so that it covers the entire breast area and work it into the crevice between the thigh and the main body, then smooth the skin over with your hands. Put the onion, lemon halves, and garlic in the cavity.\nCover the tin loosely with foil and roast for the calculated cooking time. Around 30 mins before the end of cooking, increase the oven temperature to 200C/180C fan/gas 6, remove the foil, baste the turkey and return to the oven. When the turkey is beautifully brown and cooked through, remove from the oven and leave to rest on a warm platter covered with foil for up to 1 hr.  Save the juices from the tin to make gravy."}
{"text": "Tip the sugar and orange juice into a pan, then bring to the boil. Stir in the cranberries, then simmer until tender but still holding their shape – this will take about 5 mins if using frozen cranberries or 8-10 mins if using fresh. The sauce will thicken as it cools. Will keep in the fridge for 1 week. On the day, bring to room temperature before serving."}
{"text": "Take the beef out of the fridge and leave it to come up to temperature overnight or for at least three hours. Tip the garlic and all the herbs and spices into a large roasting tin and, using a blow torch or under a hot grill, singe the herbs until they start to smoulder (if using a grill to do this, do not leave it unattended), then leave to cool slightly.\nHeat oven to 100C/80C fan/gas \n. Rub a tbsp of salt over the meat, then sit the joint on top of the herbs. Pour over the wine, then tightly tent the tin in a couple of sheets of extra-wide foil. Roast in the oven for 1 hr, then reduce the temperature to 70C/50C fan (if you have a gas oven, don’t adjust the temperature), and slow roast for 3 hrs more.\nRemove the foil, then insert a digital probe into the middle of the joint – when the temperature reaches around 60C, it’s ready. If the meat is not up to temperature, increase oven to 150C/130C fan/gas 2, and roast with the foil off, checking the temperature every 15 mins. While the beef is cooking, make the glaze by \n all the ingredients together.\nWhen the beef is cooked, remove from the oven and increase the temperature to 230C/210C fan/gas 8. Return the beef to the oven for 5 mins to crisp and blister the fat, then generously brush the glaze all over the joint and return to the oven for 5 mins until sticky and slighty charred – keep an eye on it, as it will burn very easily at this stage. Lift the beef onto a chopping board and leave to rest for 20 mins.\nTo make a herby gravy, put the roasting tin over a low heat and stir in the flour to make a gloopy paste. Add in any remaining glaze, then carefully pour in 500ml boiling water. Boil for a few minutes, then strain into a small pan and keep warm. Serve the beef in thick slices, with gravy on the side."}
{"text": "Up to two days ahead, season the bird all over with flaky sea salt – inside and out and under the skin. Leave the turkey in the tin, breast-side up, and put in the fridge for up to two days; the longer you salt it, the more succulent it will be. Weigh the turkey and calculate the cooking time by allowing 40 mins per kg for the first 4kg, then 45 mins for every additional kg. As a guide, a turkey of this size should take 3½-4 hrs plus 30-45 mins resting.\nTo make the butter, mash the garlic with the thyme, lemon zest and a pinch of salt using a \n, then beat in the butter until well mixed. \nGently push your fingers under the skin of the turkey, starting from the neck, until you can push your whole hand down the length of the breast – take care not to tear the skin. Spread the butter under the skin so that it covers the breast meat. Lay the pancetta (or bacon) on your work surface in two rectangles of six overlapping slices. Carefully push each rectangle under the skin to cover and protect each breast. This can be done the night before; take the turkey out of the fridge 1 hr before roasting to bring it back to room temperature.\nOn the day, heat oven to 180C/160C fan/gas 4. Tip the whole shallots into a bowl with the thyme, bay and garlic butter, then season and toss to coat. Lift the turkey into a \n, massage the olive oil into the skin and season well if you haven’t already seasoned ahead. Tip the shallots into the roasting tin, around the turkey, and stuff the lemon halves into the cavity. Cover the tin loosely with foil and roast for the calculated cooking time. \nFor the final 30 mins, remove the foil and pour off all of the cooking juices (reserve them for the gravy). Spoon the shallots into the cavity and increase the oven to 200C/180C fan/gas 6. Roast for the final 30 mins until the turkey is golden and the thigh juices run clear when pierced with a skewer, or until a \n reads over 70C. Leave the turkey to rest on a warm platter covered with foil – it will stay warm for about 1 hr. If you want to make turkey gravy, pour the fat off the juices and add the gravy to the roasting tin. Bring to the boil, then pour into a gravy jug. To serve, bring the whole turkey to the table, along with the herbs, if using. Carve onto a hot platter with a little of the hot gravy poured over. Any leftover meat can be frozen in the gravy, or used in leftovers."}
{"text": "Heat a large frying pan and cook the prosciutto in batches, laying the slices flat in the pan until brown and crispy. Remove from the pan and set aside.\nSteam or boil the sprouts for 7-8 mins until just tender, drain and return to the pan with the butter, lemon zest and some seasoning. Turn the sprouts until well coated, then tip into a serving bowl, tear over the crispy prosciutto and season with freshly ground black pepper."}
{"text": "Tip the flour into a food processor. Cut the butter into small pieces and drop them into the bowl, then whizz until the mixture looks like breadcrumbs.\nAdd the sugar, vanilla and egg yolks and whizz to a small dough."}
{"text": "Lightly oil 8 small ramekins. Line with cling film, then the salmon (either 1 large or 2 smaller slices), allowing plenty of overhang.\nGently mix together the cheese, chives and avocado with the lemon juice and plenty of seasoning. Spoon into the salmon-lined ramekins, press down, fold over the overlapping salmon, then cling film to seal in the mixture. Can be made the night before, but if making on the day they should be chilled for at least 4 hrs.\nOn the day, gently lift the terrines out of the ramekins using the cling film, then remove the film. Place the terrines on plates with some baby salad leaves tossed in a little vinaigrette. Drizzle the terrine and plate with sweet chilli sauce. Serve on their own or with toast."}
{"text": "Heat the oil in a large frying pan, then gently fry the onion for 5 mins until softened. Finely chop the apples either by hand or in a food processor.\nSqueeze the sausagemeat from the sausages into a large bowl, then add all the other ingredients, except the cranberries and streaky bacon. Season generously, then get your hands in and mix well. Weigh out 450g of the stuffing and mix a handful of the cranberries into it. Use to stuff the neck of the turkey (see 'Goes well with').\nTo assemble, butter and season a large sheet of foil. Stretch out the bacon rashers slightly with the back of a kitchen knife, then overlap 12 rashers on the foil. Spoon half of the stuffing mix evenly over the bacon, leaving a border of about 3cm. Scatter with half the cranberries, then pat them in. Tuck the long edges of the bacon over the stuffing; then, using the foil to help, roll the stuffing up into a log shape. Repeat to make a second roll.\nHeat oven to 190C/fan 170C/gas 5. Put the foil-wrapped rolls onto a roasting tin and roast for 45 mins. Unwrap, draining off any juice, then finish roasting for 15 mins until the bacon is crisp."}
{"text": "Mix the hot tea, whisky and marmalade in a large bowl until the marmalade melts. Stir in all of the dried fruit, peel and cherries, then cover and leave to soak overnight.\nNext day, heat oven to 160C/fan 140C/gas 3 and grease and double-line a 20cm round, deep cake tin with non-stick baking paper. Using electric beaters, cream together the butter and sugar until fluffy. Add the eggs a little at a time, beating well after each addition, then fold in the flour and spices, followed by the lemon zest and soaked fruit. Add any liquid that hasn’t been absorbed by the fruit, too. Spoon into the prepared tin, level the top, then bake for 1½ hrs. Turn the oven down to 140C/fan 120C/gas 1 and bake for another 1½ hrs or until a skewer inserted into the centre of the cake comes out clean. Cool on a wire rack in the tin.\nWhile the cake is still warm, use the skewer to pepper the cake with holes, poking it all the way down. Dissolve the sugar in the tea, add the whisky or orange juice, then spoon over the surface. If you’re making the cake ahead of time, feed it with a fresh swig of hot toddy every week, but take care not to make the cake soggy. Can be kept for a month well-wrapped in an airtight container in a cool, dry place. If short on time, the cake can be made the same day that you decorate it."}
{"text": "Place the cream, onion or shallot and the thyme sprig into a small pan. Slowly heat to just below boiling point, then remove from the heat and leave to cool. Strain, discarding the onion and thyme.\nHeat oven to 160C/fan 140C/gas 4. Rub the bottom and sides of a gratin dish measuring about 20cm x 30cm with butter. Peel the parsnips and trim the ends. Peel and scoop the seeds out of the squash. Thinly slice the vegetables.\nLayer the parsnip and squash in the dish, pour over the infused cream, then scatter with the thyme leaves and gruyère. Bake for 1 hr until golden and a fork slides easily into the veg."}
{"text": "In a large pan of boiling salted water, cook the parsnips and swede, covered, for about 20 minutes until tender. Drain well, then mash them together using a masher or food processor until reasonably smooth but still with a bit of texture. Stir in the soured cream, horseradish and thyme and season with salt and pepper.\nSpoon into a buttered shallow ovenproof dish and put to one side.\nMake the topping. Melt the butter in a frying pan and cook the onion for 5-6 minutes, until gorgeously golden. Mix in the breadcrumbs and stir to brown and crisp a little. Season with salt and pepper and add the thyme. Take the pan off the heat. Spoon the mixture casually over the top of the mash. Scatter over the parmesan. (Can be made ahead to this point and kept covered in the fridge for up to a day. Or can be frozen for up to a month.)\nBake with the turkey (190C/gas 5/ fan 170C) for 35-40 minutes if doing from cold, 25-30 minutes if not, or 11⁄2-13⁄4 hours from frozen (put foil on top, and remove it for the last 10 minutes) – until golden and crisp on top. Serve scattered with a few more thyme sprigs and leaves."}
{"text": "Line a 22cm square non-stick tin with baking parchment. Put the caster sugar, double cream and liquid glucose in a pan. Slowly heat together, stirring continually, until the sugar melts and stops feeling grainy on the bottom of the pan. Turn up the heat and fast boil until a small amount of the mixture dropped into a glass of cold water sets into a soft ball that you can pick up on a teaspoon. By this time the bubbles in the mixture will look small and even.\nTurn off the heat and keep stirring for 5 mins or until the mix starts to thicken a little. Sprinkle in the white chocolate and swirl it through the mixture once using a spatula or the handle of a wooden spoon. Pour into a tin and leave the fudge overnight to set, then turn out and cut into squares. "}
{"text": "Heat oven to 220C/200C fan/gas 7. Tip the turkey bits and/or chicken wings into a sturdy roasting tin with the onions, carrot, celery and garlic. Toss in the oil and spread out into a single layer. Place in the oven for 40 mins undisturbed – you want them the right side of just burnt, as this will give you lots of flavour.\nRemove the tin from the oven and mix in the honey, soy sauce and tomato purée. Toss everything together until all the bits are completely coated, then return to the oven for 10 mins until sticky and caramelised. Remove the tin from the oven again, sprinkle over the flour and dried mushrooms (if using) and return to the oven for a final 10 mins.\nIf your roasting tin is flameproof, put it on a low flame, add the vinegar and sizzle for a moment. Pour in the Port and cook until you have a thick, glutinous paste mixed in with all the ingredients – it will look quite messy! Add the stock and herbs, bring to the boil and cook for 10 mins. (If your tin isn’t flameproof, add the vinegar, stir to loosen all the burnt bits from the tin, then tip into a saucepan to continue.)\nTurn off the heat and use a potato masher to mash everything to extract as much flavour out of it as you can. Carefully pass the contents through a sieve over another saucepan, pushing down on the contents of the sieve. Simmer the gravy until thick and glossy, then leave to cool. Can be chilled for up to 3 days or frozen for up to 2 months. Reheat the gravy and serve as it is, or add to the turkey roasting juices for even more flavour."}
{"text": "Put the sugar in a saucepan with 75ml water. Simmer until the sugar has dissolved, then cool and chill.\nBeat the yolks with the vanilla until smooth. Add the condensed milk, brandy and cooled sugar syrup, mixing well.\nPour into a jug and chill for at least 2 hrs. Serve within 24 hrs, over ice."}
{"text": "Sit the cake on a large board or flat serving plate. Brush a little of the jam over the cake. Dust a clean surface with a little icing sugar, then roll out the marzipan until big enough to cover the cake (use string to help you measure). Carefully lift the marzipan onto the cake, pat down to cover smoothly and trim any excess off the bottom. Brush all over again with more jam.\nKnead 1kg white icing until smooth, then roll out on an icing sugar-dusted surface until a little bigger than the marzipan size. Carefully lift onto the cake, partially pat down the sides to smooth and stick, allow the rest to stick in folds, or tease into shape with your fingers (step A). Trim any ragged edges.\nFor the robins, roll 3 walnut-size balls from some of the remaining white icing. Halve the icing that is left. Knead brown colouring into 1 half to give a rich colour, wrap well – this will be the branch. Divide the other half into 3 pieces, and colour 1 red, 1 pale brown and 1 green.\nRe-dust the work surface, pinch off 3 marble-size balls of red icing and roll each into a teardrop shape for the breast. Use a cocktail stick to add texture, then stick 1 onto each robin – brush a little water onto the icing to help it stick. As you stick it, flatten the base of the ball slightly so that the robins stand up.\nDivide the pale brown icing into 3 balls and roll each into an oval shape, then pinch 1 end of each into a gentle point (step B). Stick onto the robins so that the point is the head, and trim the tail if you need to. Poke a clove into each brown tip to make a little beak. Pull the round bit off the end of 6 cloves to leave spiky ends, and poke into robins to make feet. Use black writing icing to add eyes (step C).\nRoll most of the dark brown icing into a long branch and attach to the cake with a little more water or jam. Roll smaller branches from the remaining dark brown icing. Pinch leaves from the green icing and attach. Add the robins and enjoy."}
{"text": "Put the flour, baking powder, ginger, cinnamon and sugar in a large bowl with a pinch of salt. Combine the egg, maple syrup and milk in a jug. Gradually add to the dry ingredients, whisking until a smooth, silky batter forms.\nHeat a drizzle of oil in a large, non-stick pan over a medium heat and ladle 2-3 small rounds into the pan. Cook for 1-2 mins until bubbles start to appear on the surface, then flip over and cook for a further 1 min until fluffy. Do this in batches until you have 10 pancakes.\nServe in a stack, with extra maple syrup, a blob of crème fraîche and dates scattered over."}
{"text": "Heat oven to 220C/200C fan/gas 7 and grease a large baking tray. Unroll the puff pastry into an A4 sheet and cut 16 x 10cm-long strips.\nWrap each chipolata in a strip of pastry, winding it round like a corkscrew. Place on the baking sheet and chill in the fridge for 15 mins. Can be chilled overnight or frozen for up to 2 weeks.\nMix the egg yolk with 1 tsp water and use to glaze the top of each pastry spiral. Sprinkle with the sesame seeds, then bake for 25-30 mins until the pastry is puffed up and golden, and the sausages are cooked."}
{"text": "Bring a large pan of salted water to the boil, add the sprouts and cook for 3-4 mins until slightly tender. Drain and rinse under cold water.\nMeanwhile, very gently fry the onions in the oil and half the butter for about 10 mins until soft. Add the garlic and stock cube and cook for 2 mins, stirring, until everything is combined. Remove from the heat.\nRoughly chop the sprouts by hand or in a food processor, then stir them in with the onions and the rest of the butter, along with the double cream and nutmeg. Put back on the heat and cook until the cream is bubbling. Season to taste. Toss in the chestnuts and sprinkle over a little extra nutmeg to serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. Grease and line a 20 x 30cm Swiss roll tin with baking parchment, then grease the parchment a little too. Put the treacle, syrup, butter and stem ginger in a pan, heat until melted and stir to combine, then set aside to cool a little.\nPut the eggs and sugar in a bowl and whisk using an electric hand whisk until light, mousse-like and doubled in size – this will take about 10 mins. The mixture is ready when it holds a ribbon trail from the beaters for 3 secs. Sift over the flour, baking powder and spices, then pour the melted butter mixture around the sides of the bowl so that it trickles down into the whisked eggs. Very gently fold everything together with a large metal spoon. When just combined, pour the mixture into the Swiss roll tin and ease it into the corners. Bake for 12 mins until just cooked.\nWhile the sponge is cooking, lay a sheet of baking parchment, big enough to fit the cake, on your work surface and dust with a little sugar. Once cooked, tip the cake directly onto the parchment. Use a small serrated knife to score a line about 2cm from one of the shorter ends, making sure you don’t cut all the way through – this will help to get a tight roll. Gently roll up from this end, rolling the parchment between the layers. Leave to cool like this on a wire rack to help set the shape.\nTo make the icing, put the ingredients in a bowl and whisk until smooth. Transfer to a piping bag fitted with a large round nozzle, or use a plastic sandwich bag and snip off one corner to make a hole about 1cm wide. Unroll the sponge and drizzle the surface with 2 tbsp ginger syrup. Pipe a layer of ginger buttercream over the inside of the roll, then use the paper underneath to help tightly re-roll into a roulade. Slice off both ends for a neat finish. The Bûche can be frozen at this point – simply re-roll in the parchment, then in foil, and freeze. Defrost at room temperature before continuing.\nPlace the Bûche on a serving plate or board. Use the remaining icing to pipe a thick layer over the top of the sponge, zigzagging backwards and forwards to create a tight concertina pattern. Decorate with white pearl sprinkles, if you like. The Bûche will keep in a sealed container for up to 5 days, or can be frozen for up to two months."}
{"text": "Tip 100g pecans into a processor and whizz until fine, then tip into a bowl. Put the dates into a small pan with enough water to cover, boil for 5 mins until very soft. Drain, discarding the liquid, then whizz in the processor until smooth. Leave to cool.\nHeat oven to 180C/fan 160C/gas 4. Butter and line the base of a 23cm cake tin. Beat the butter, sugar and spice together until lighter and creamy, then tip in the dates, ground pecans, eggs and a pinch of salt and beat briefly until smooth.\nFold in the flour with a metal spoon, then spoon into the tin and level the top. Sprinkle the remaining nuts over the top (don’t press them in), then bake for 40 mins or until risen and golden and a skewer comes out clean. Serve warm, with generous drizzles of maple syrup and scoops of Maple crunch ice cream (see 'goes well with')."}
{"text": "Put a few ice cubes in a cocktail shaker with the vanilla vodka, coconut cream, crème de cacao and grated nutmeg. Shake and strain into two mini milk bottles (see tip). Pop a rolled chocolate wafer in each."}
{"text": "Heat the butter in a small pan until just starting to take on a nutty brown colour – remove from the heat straight away as it will continue to colour. Stir in the brandy, then leave to cool.\nHeat the milk in a saucepan but don’t let it boil. Whisk the egg yolks and sugar in a bowl until pale. Pour over the hot milk, whisking continuously, then return to the saucepan set over a low heat. Cook for 3-4 mins, stirring the whole time with a wooden spoon, until the custard thickens enough to coat the back of your spoon. Leave to cool.\nWhisk the cream until it forms soft, billowy peaks. Fold in the brandy butter and the custard mixture. Churn in an ice-cream machine until set, then keep in the freezer for up to 2 months."}
{"text": "Heat the oil in a large frying pan over a medium heat. Put the sprouts in the pan, cut-side down, and leave them to sizzle away happily for 10 mins without disturbing them.\nHalfway through cooking, dot over the butter and leave it to sizzle and brown – the sprouts need to be really crispy and dark brown. If they are just lightly brown, carry on cooking for another 5-10 mins.\nScatter over the sesame seeds and stir-fry everything until the seeds are toasted. Off the heat, toss through the pomegranate seeds, then season the sprouts with salt and tip into a serving dish. Drizzle with the pomegranate molasses before serving."}
{"text": "Put the cranberries, liqueurs, orange and lime juices and the maple syrup into a food processor or blender. Blitz until the berries are as finely chopped as possible.\nStrain through a fine sieve, working the cranberry pulp against the mesh with a spatula or small ladle until you have extracted all of the liquid. Chill until needed. When ready to serve, fill small glasses with crushed ice, then pour over the almost fluorescent pink cocktail."}
{"text": "Put the pomegranate juice in a small saucepan with a sprig of rosemary. Bring to the boil and reduce for a few mins until syrupy. Leave to cool, then chill until ready to use.\nFill four Champagne flutes with 1 part pomegranate syrup and top up with 3 parts Prosecco. Garnish each glass with a rosemary sprig, if you like."}
{"text": "To make the dressing, tip the hazelnuts into a frying pan, toast until golden, then transfer to the small bowl of a food processor. Whizz for 5-10 mins until they make a smooth paste – the nuts will start to release some of their oil and the paste should look like smooth peanut butter. Add the vinegar, maple syrup, season and blend to combine. With the motor running, pour in 150ml water and continue blending until smooth. Can be kept in the fridge for up to 1 week.\nCut the apple into really fine matchsticks using a mandolin or sharp knife. Toss in a little of the lemon juice as you go to prevent the apple from turning brown.\nPut the hazelnuts in a shallow dish. Heat the butter in a frying pan until foaming and nut brown. Add the scallops and cook for 1 min on each side, or to your liking, seasoning as they cook. Remove from the pan and roll each scallop in hazelnuts. If cooking for larger numbers, cook the scallops in batches so that you don’t overcrowd the pan.\nTo serve, spoon a dollop of the hazelnut dressing in the centre of each plate; use the back of the spoon to spread out the dressing slightly. Toss the watercress in the remaining lemon juice and oil, season and place a pile in the centre of each dressing dollop. Arrange the scallops around the watercress and place piles of apple between each scallop. Drizzle with a little oil and serve immediately."}
{"text": "Heat oven to 180C/160C fan/gas 4 and grease a large baking tray. Halve the onions through the root and peel off the papery skin. Cut off any stringy roots but leave the base of the root intact. Slice a little off the rounded side of each onion half, so they will sit on the tray. Cut away the centre of the onions, reserving the offcuts, to leave a hollow – once you’ve cut away a little, you can use your fingers to pull out the layers until you’re left with a shell of 2 or 3 layers. Arrange the halves on a baking tray, season and bake for 10 mins until just softened. Set aside to cool.\nWeigh the onion offcuts and place 140g/5oz in a food processor (save any remaining onions for another recipe). Blitz until finely chopped but still with a little texture – or finely chop by hand. Heat a drizzle of oil in a frying pan and add the onions. Cook for 5 mins until softened, then set aside to cool.\nTip the sausagemeat, cranberries, thyme and breadcrumbs into a bowl. Add the fried onions and a little seasoning. Mix well. Roll the stuffing mixture into 12 balls and use to fill the onion halves. Wrap a slice of pancetta around each ‘bauble’, ensuring the ends meet underneath the onions. Can now be covered with cling film and chilled for up to 2 days or frozen for up to a month.\nHeat oven to 200C/180C fan/gas 6. Unwrap the stuffing baubles (if chilled) and bake for 25 mins until cooked through and the bacon is starting to crisp. If you’re cooking from frozen, bake for 35 mins. (If you have a full oven, it may be too steamy to crisp up the bacon, so finish with a blast under a hot grill until nicely browned and crispy.)"}
{"text": "Heat oil in a large saucepan, add cabbage, ginger, onions, allspice and mustard seeds, then cook for 5 mins until just starting to wilt.\nScatter over the sugar and pour in the vinegar. Cover pan, gently cook for 10 mins, then remove lid and turn up the heat to medium. Simmer the liquid in the cabbage for about 20 mins, stirring occasionally, then stir continuously for the last few mins until all the liquid has evaporated and becomes sticky on the bottom of the pan. Tip cabbage into a large bowl and serve."}
{"text": "Tip the dry ingredients into a large bowl. Heat the honey and butter in a pan over a low heat until the butter melts, then pour into the flour mixture along with the lemon zest. Mix well until the dough is combined and fairly solid. Cover and leave to cool.\nHeat oven to 180C/fan160C/gas 4. Using your hands, roll dough into about 30 balls, each 3cm wide, then flatten each one slightly into a disk. Divide the biscuits between two baking trays lined with baking parchment, leaving room for them to expand. Bake for 15 mins, then cool on a wire rack.\nTo ice the biscuits, mix together the icing sugar, egg white and 1-2 tbsp water to form a smooth, runny icing. Dip the top of each biscuit in the icing and spread with the back of a knife. Leave to dry out in a warm"}
{"text": "Cut each mango in half down the sides of the flat stone that runs through the centre of the fruit, so that you end up with 2 fleshy halves. Now take each mango half and cut into the flesh, making quite chunky diagonal pieces – take care not to cut through the skin. Turn each half inside out, then slice away the chunks of mango that stand proud from the skin. Cut the flesh from around the stones, trim off the skin and chop the flesh.\nHeat the oil in a large, deep sauté pan, add the onion and fry for a few mins until starting to soften. Stir in the ginger and cook, stirring frequently, for about 8-10 mins until the onion is golden. Stir in all of the spices, except the turmeric, and fry until toasted.\nStir in the turmeric, add the apple and pour in 500ml water, then cover the pan and cook for 10 mins. Stir in the mango and chilli, then cover and cook for 20 mins more until the apple is pulpy and the mango is tender.\nPour in the vinegar, stir in the sugar and salt, then leave to simmer uncovered for 30 mins, stirring frequently (especially towards the end of the cooking time so that it doesn’t stick) until the mixture is pulpy rather than watery. Spoon into sterilised jars."}
{"text": "Fry 2 sliced onions in 25g butter for 5 mins, then add 1 small diced Bramley apple and cook briefly.\nCool, then mix with 800g Cumberland sausages, skins removed, the chopped handful of sage, 140g granary breadcrumbs and seasoning.\nUse to stuff the neck end of the bird, then roll any leftovers into balls. Or, pack the whole mixture into a 1kg loaf tin and top with extra sage leaves.\nBake with turkey for 30-40 mins. Drain off any fat and serve sliced."}
{"text": "Melt the butter in a large frying pan. Add the leeks and garlic, stir well, cover and cook for 10 mins until the leeks are soft, stirring a few times to check that they don’t catch. Tip into a large bowl. Put the spinach in the pan and allow it to wilt. Leave to cool and, when cold, squeeze out as much liquid from it as you possibly can.\nTip the chestnut purée into the bowl with the leeks and add the 3 eggs, the nutmeg, chestnuts, spinach, breadcrumbs, cheese and seasoning, and stir until well mixed. Chill for at least 1 hr until the mixture firms up.\nHeat oven to 220C/200C fan/gas 7. On a lightly floured work surface, roll out the pastry to a rectangle large enough to completely enclose the filling. Carefully lift onto a large, long baking tray that has been lined with baking parchment, then brush round all the edges of the pastry with the remaining egg. Spoon the filling down the centre of the length of the pastry, leaving the ends clear. Tuck the ends over the filling, then firmly lift up the sides to wrap them round, trimming away any excess pastry as you go. Brush with more egg to glaze, then make a few holes in the top so steam can escape as it cooks. Bake for 40 mins until golden and the filling is firm. Remove from the oven, brush with more glaze and bake for 10 mins more.\nTo make the sauce, heat the stock in a medium pan, add the leeks, boil for 5 mins, then take off the heat and scoop out 2 tbsp of the leeks. Blitz the rest in the pan with the cornflour using a hand blender, then cook, stirring, until thickened. Pour in the cream and reserved leeks and warm through. Can be made 2 days ahead and chilled. Serve the pastry in thick slices with the sauce."}
{"text": "Soak the cranberries in the port for an hour. Fry the onion and bacon gently in the butter, until the onion is tender and the bacon is cooked. Add the garlic and fry for another minute or so.\nCool slightly, then mix with all the remaining ingredients, including the cranberries and port, adding enough egg to bind – I find it easiest to use my hands. Fry a knob of stuffing in a little butter, taste and adjust the seasoning if necessary.\nTo Cook: This stuffing can be baked in a dish, or rolled into balls that will be crisp on the outside and moist inside. To bake, press the stuffing into a greased ovenproof dish in a layer that is around 4cm thick. Bake at 190C/gas 5/fan 170C for about 40 minutes, until browned and, in the case of sausagemeat stuffing, cooked right through. Alternatively, roll into balls that are about 4cm in diameter. Roast the stuffing balls in hot fat (they can be tucked around the turkey or done in a roasting tin of their own) for 30-40 minutes, until crisp and nicely browned on the outside."}
{"text": "Sift the sugars and ground almonds together, then stir through the orange zest. Beat together the egg and egg yolk, then add to the sugar mixture, stirring well.\nKnead briefly to ensure the marzipan is completely mixed and pliable, adding a little orange juice if the mix is too dry, or icing sugar if too wet.\nPlace the cake on a cake board and use small balls of marzipan to plug any holes in the cake. Now glaze the cake with a thin layer of marmalade. Dust your work surface with a little icing sugar, then roll out the marzipan in one direction, keeping the pressure even and turning a ¼ turn every few rolls.\nWhen large enough (about 40cm in diameter for a 20cm cake), roll the marzipan onto the rolling pin and lift onto the cake. Smooth the top with your palms and continue down over the sides of the cake, smoothing out any folds as you go. Trim with a knife where the marzipan meets the board, then leave to dry overnight.\n Although homemade marzipan contains raw eggs, the amount of sugar, and lack of moisture, prevents bacteria growing when left at room temperature, so your cake should last for 1-2 months iced. The most important thing is that you don't scrimp on drying time – once you’ve covered your cake in marzipan it should be left to completely dry out for up to 3 days, before you then cover it with icing. If you want to make marzipan before you are ready to cover your cake, then wrap it well in cling film and keep in a fridge for up to a week – as wrapped in a ball it will still contain a little moisture. As it contains raw eggs it shouldn’t be given to anyone in an at-risk group, including pregnant women, the elderly, the unwell and the very young. You can make a cooked marzipan, which carries no risks. It is a little softer, and harder to work with, but a good substitute if you are at all worried."}
{"text": "Sit the cake on a cake board or flat plate. Brush all over with a little of the jam. Roll out the marzipan on an icing sugar-dusted surface until large enough to cover the sides and top of the cake – use string to help you measure. Cover the cake and trim the excess marzipan from the bottom. Brush with jam again, knead 850g of the white icing until smooth and pliable, then roll out as you did you for the marzipan ensuring it is large enough to cover the top and sides. Lift onto the cake. Smooth the icing down and around the sides, trimming excess from the bottom, as before. Smooth out any marks with the flats of your hand, rubbing the icing to buff it to a shine.\nRoll out the rest of the white icing and cut out a few snowflakes. Brush one side with a little egg white or runny icing, then dip this side into the preserving or granulated sugar to coat. Sprinkle on glitter, if using, then use more egg white or icing to stick randomly onto the cake. Leave to set for a few hrs before cutting."}
