{"text": "Heat the chocolate in separate bowls over simmering water or on a low setting in the microwave. Allow to cool a little.\nPut your chosen sprinkles on separate plates. Push a cake pop or lolly stick into a marshmallow about half way in. Dip into the white or milk chocolate, allow the excess to drip off then dip into the sprinkles of your choice. Put into a tall glass to set. Repeat with each marshmallow."}
{"text": "Place the ginger, coriander and garlic in a pestle and mortar, then pound to a paste. Add the oil and mix through. Pour over the scallops and rub in until they are covered with the mixture. Thread each scallop onto a skewer (see Know-how, below). Can be done up to 1 day in advance.\nTo cook, heat a non-stick frying pan until really hot. Place a couple of skewers in the pan and cook for 2 mins, until starting to turn golden. Turn over, drizzle with more oil if needed, then cook for another min. Serve with sweet chilli sauce."}
{"text": "Soak the 100g walnuts in water overnight. Strain through a sieve, put in a pan and cover with 300ml water. Bring to the boil, then simmer for 15 mins. Strain again, return to the pan with the stock and bring to the boil. Pour into a blender, blend on medium for 5 mins, then strain back into the pan. Set aside until step 4.\nMake the sauce: soften the shallot in the oil over a gentle heat for 10 mins. Stir in the spices and stock, increase the heat and reduce by three-quarters. Pour in the Port and gently simmer for 20 mins. Strain into a clean pan and reduce over a high heat until thickened, about 10 mins. Set aside. Heat oven to 200C/180C fan/gas 6.\nFor the squash, heat the butter in an ovenproof pan. Fry the squash for 3-4 mins, then stir in the walnuts with the cinnamon, sugar and a pinch of salt. Roast for 15-20 mins or until tender. Keep warm.\nMeanwhile, make the orzotto. Warm the walnut stock. Heat the oil and 25g butter in a large, deep pan, add the shallots and soften for 10 mins, but don’t colour. Stir in the garlic and cook 3-4 mins more. Remove from the pan, set aside, then wipe the pan clean. Increase the heat, tip in the barley and toast for 2-3 mins, keeping it moving so it doesn’t burn. Quickly stir the shallots and garlic back into the pan with the barley, then pour in the Champagne. Stir well and add a ladleful of warm walnut stock. Lower the heat a little and keep adding stock when the orzotto looks ‘thirsty’, stirring occasionally to prevent it from sticking to the pan. (You’ll need about 500ml stock in total. Make up the amount with vegetable stock if necessary.) Cook until the barley is tender – 35-40 mins (you have a lot more grace with this than with rice, as it retains its bite for longer).\nWhen cooked, add another half ladle of stock (to stop the orzotto from thickening as it cools), then stir in the stilton and a knob of butter. Stir and season, remembering stilton can be very salty.\nTo serve, reheat the sauce, adding a little more Port if it is too thick, then stir in the redcurrant jelly until dissolved and finish with the butter. Spoon some sauce over each plate and top with a few spoonfuls of orzotto. Garnish with the roasted squash and walnut halves, a few small pieces of stilton and leaves."}
{"text": "Heat oven to 200C/180C fan/gas 6. Halve any large sprouts and toss them with the oil and some seasoning in a roasting tin or ovenproof dish. Roast for 20 mins until the sprouts are tender and turning golden.\nMeanwhile, put the bacon lardons in a cold frying pan and place over a medium-low heat. Gently fry the lardons so the fat melts out into the pan as they crisp. When golden brown and crisp, remove from the pan with a slotted spoon. Add the breadcrumbs and crisp up in the bacon fat until golden and crunchy. Remove from the pan to cool, then clean the pan.\nMelt the butter in the pan with 2 tbsp of the milk, then stir in the flour and mustard powder for 2 mins to make a paste. Gradually whisk in remaining milk, until you have a smooth sauce. Use a spoon again to stir and cook until the sauce comes to the boil and thickens. Turn off the heat and stir in the cheese until melted. Taste and season.\nTip the sprouts into a baking dish, scatter with the crisp bacon lardons, then spoon over the sauce and scatter with the crispy crumbs. Can be cooled, covered and chilled for up to 48 hrs before baking. Bake gratin for 10 mins (or 20 mins from chilled) at 200C/180C fan/gas 6 until piping hot and bubbling."}
{"text": "Heat the oil in a large saucepan or casserole dish over a medium heat. Add the cabbage, onion, garlic, coriander seeds and bay leaves, and cook, stirring occasionally, for 15 mins until the cabbage begins to wilt.\nStir in the apple, vinegar and maple syrup and season well. Cover the pan and cook gently for 1 hr until the cabbage is tender and wonderfully sticky and caramelised. Remove the bay leaves before eating. Can be made in advance and frozen or kept chilled for up to two days. Use up any leftovers in our \n."}
{"text": "Peel the potato and parsnip, grab a bowl and grate them both into it. Grate or finely slice the sprouts and chuck them into the bowl too. Put the veg in a sieve and squeeze out as much liquid as you can. Return the mixture to the bowl and crack in the egg. Mix and season, then add your rosemary and garlic.\nNow it’s time to get your hands messy. Shape the mixture into three rösti patties, equal in thickness. Slice the leftover turkey breast. Put it in a pan with the gravy on a low heat and simmer until the turkey is warm. Heat the coconut oil in a separate frying pan. Cook the röstis for 3 mins each side until golden brown, then put them on a plate, layer with the sliced turkey and add a dollop of cranberry sauce on top. Voilà – a lovely, lean Christmas leftover meal!"}
{"text": "Heat oven to 120C/100C fan/gas ½. Line two-three baking sheets with parchment. Beat the egg whites until they are foamy and doubled in size. Add the sugar, 1 tbsp at a time, while you continue to \n. The meringue will become thick and glossy and should hold up in stiff peaks on the beaters when it is ready.\nFor the meringue kisses, fit a disposable piping bag with a 1cm round or star nozzle. Hold it vertically to the baking sheet and gently squeeze, pulling the bag up and away to make a peak. If you are making frosty icicles, make some meringue dots as well.\nFor colour-striped meringues, fit a disposable piping bag with a round nozzle, paint red food colouring paste in stripes onto the inside of the bag, then fill with meringue and pipe as before. Bake for 1 hr. Once cool, you can drizzle some of the meringues with melted chocolate and sprinkle with edible glitter or lustre powder, if you like.\nFor the icicles and snowflakes, scoop the meringue into a disposable piping bag and snip off a tiny opening. Pipe spiky icicle shapes onto the trays, making them thicker one end and thin at the other. Pipe crossed lines to make snowflakes.\nBake for 50 mins, then leave to cool on the tray for a few mins, then carefully loosen them off the parchment. Sprinkle with edible glitter or lustre powder, if you like. If left to cool completely, they may stick and break when you try to lift them off. If you are storing these, leave to cool completely, then layer in an airtight container between pieces of baking parchment.\nNow use the meringue kisses to make our \n."}
{"text": "Tip half the chocolate into a bowl set over a pan of simmering water. Once melted, remove from the heat and stir in the rest of the chocolate. Put the petit four cases into the holes of the mini muffin tins. Put 1 tsp of the melted chocolate in each one, then pick up a petit four case in your hand and swirl it gently to get the chocolate to coat the sides. Repeat with all the cases, leaving about a third of the chocolate in the bowl. Pop the tins in the fridge to firm up while you make the fillings.\nPut the butter in a large bowl with the icing sugar. Beat well with electric beaters or a wooden spoon until light and creamy. Divide the mixture into three bowls, then stir the peanut butter into one, hazelnut butter into the second and pistachio butter into the third (if using). Transfer the fillings to three piping bags.\nTake the chocolate cups out of the fridge and fill with the nut mixtures. If your reserved chocolate has hardened, melt again as before. Once melted, carefully spoon it over the top of each cup to seal in the nut butters.\nTop each cup with with a whole nut (or a nut coated in gold leaf, a pinch of coarse sea salt – or any combination). Chill for at least 2 hrs. Will keep in the fridge for 1 week (see tip)."}
{"text": "Heat the oil in a large frying pan over a medium-high heat. Put the sprouts in the pan, cut-side down, and leave them to fry for 10-15 mins, tossing occasionally. If they’re just lightly brown, carry on cooking for a further 5 mins until blistered.\nScatter over the pistachios and stir-fry until toasted. Remove from the heat and stir through the pomegranate seeds. Season with salt and tip into a serving dish. Drizzle with a little pomegranate molasses, if you like."}
{"text": "Put everything except the parsley in a pan and pour over 250ml water. Simmer over a low heat for 20 mins until the liquid has evaporated and the carrots are tender and coated in a sticky glaze. If they are still a little raw, add a splash of water and cook for a few mins more. Transfer to a serving platter and serve sprinkled with parsley."}
{"text": "First, make up the blini batter. Put the flours, baking powder, ½ tsp salt, the milk, egg yolks and melted butter in a bowl and whisk until smooth. In another bowl, whisk the egg whites until they hold stiff peaks. Stir a good spoonful of the whisked whites into the batter to loosen the mixture, then add the remaining egg whites and carefully fold everything together with a big metal spoon.\nHeat a small knob of butter and a drizzle of oil in a large frying pan, roughly 23cm wide across the base. Pour a third of the blini mixture in the pan, using your spoon to encourage the batter towards the edge of the pan. Leave to cook for a few mins, until the blini starts to set around the edges and the underside is golden brown. Slide onto a plate, then carefully flip back into the pan and cook for a further 1-2 mins until golden. Repeat with the remaining mixture. Leave the blinis to cool on a wire rack, then place on a plate, separated by a layer of baking parchment and covered with cling film. The blinis will keep like this for 24 hrs.\nMix the crème fraîche, horseradish, most of the lemon zest, a good squeeze of lemon juice and some seasoning in a bowl. In a second bowl, toss the beetroot, oil and a squeeze of lemon juice. Set aside until ready to serve.\nPlace each blini on a board or large plate. Spoon on dollops of crème fraîche, arrange slices of salmon over and scatter beetroot, capers and the remaining lemon zest on top. Finish with a few rocket leaves and a drizzle of oil. Cut and serve with lemon wedges."}
{"text": "Melt the butter over a low heat in a large, non-stick frying pan. Add the onion and cook for 10 mins until soft. Increase the heat to medium and stir in the bacon, sage and sausagemeat. Cook for 6-8 mins, breaking up the sausage with a wooden spoon, until starting to brown.\nTip in the sprouts and chestnuts, cover with a lid and cook, stirring occasionally, for 10 mins until the sprouts are tender. Keep them warm over a low heat until you are ready to serve. Just before serving, take off the lid, season, stir in the breadcrumbs and fry on high for 2 mins to toast them and get some colour on the sprouts."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease and line the base and sides of a 1lb (500g) loaf tin with baking parchment. Heat the oil in a large non-stick sauté pan and fry the onions for 10 mins until golden, stirring every now and then. Add the grated potato and garlic and cook for 5 mins more until the potatoes have softened.\nTip into a bowl, (reserve the pan) and add two-thirds of the chestnuts crushing them up as you go, then stir in the thyme, tamari and egg. Press into the loaf tin, roughly break the remaining nuts and arrange them on top then bake for 45 mins.\nFor the sauce mix the flour with a little of the bouillon to make a very wet paste. Return the pan to the heat and add all the ingredients, including the flour mix and stir over a high heat until well mixed and thickened. Keep simmering for a good 10 mins then taste as it should now be tangy rather than vinegary. If it is too sharp return to the heat and boil a little longer.\nCarefully take the loaf from the tin and remove the paper. Scatter with thyme. If you're doing the Healthy Diet Plan, serve half in 2 thick slices with half the tomato sauce and chill the rest for another day, otherwise serve the whole recipe as a meal for four people."}
{"text": "In your food processor, pulse the almonds, peel, apple, ginger, cherries and pineapple together until finely chopped (but not mushy), then tip into a large bowl. In batches, pulse the sultanas, raisins and currants until just chopped a little bit then add to the bowl.\nSprinkle the suet and sugar, salt and spices over all the chopped fruit and mix well. To mix, squelch through fingers. Pour over the ginger syrup, orange juice and zest and alcohol, then mix again. Spoon the mixture into sterilised jars and keep until needed."}
{"text": "Tip all the ingredients, except the suet and ground almonds, into a large bowl and stir really well. Stir in the suet, cover with a plate or cling film and leave overnight for the fruit to plump up in the juices and brandy.\nNext day, stir thoroughly again, and if the mixture still looks very juicy, add a sprinkling of ground almonds to absorb some of the liquid. Now it is ready to jar. The mincemeat will keep for 6 months, but once open, store in the fridge."}
{"text": "Tip all the ingredients into a pan and bring to the boil, stirring every now and then. Simmer for 5 mins, until the berries soften but still look whole. Tip into a bowl and leave to cool – it really is as simple as that."}
{"text": "Roll out a little over half the pastry on a flour-dusted surface to about the thickness of a £1 coin. Stamp out circles of pastry to line the holes of a 12-hole bun tin – an 8cm cutter should be about right. Re-roll the trimmings until all 12 holes are lined.\nSpoon a little mincemeat into each, then roll out the remaining pastry with a little more flour. Use a 6cm fluted or plain round cutter to cut out 12 lids. Top the mincemeat with the pastry lids, push around the edges to seal, then poke 1-2 small holes into each to allow steam to escape. Wrap the whole tray well in cling film. \n.\nTo cook, heat oven to 200C/180C fan/ gas 6. Remove the mince pies from the freezer and brush the top of each with a little milk. Bake for 20-22 mins or until the pastry is golden and crisp and the filling piping hot."}
{"text": "Heat the oil in a non-stick pan, then fry the onion, carrot and bay, stirring frequently, until the onion is golden. Stir in the flour, then pour in the stock while stirring. Simmer for 15 mins. Discard the bay leaf, then purée the contents of the pan with a hand blender until completely smooth. Cool, then chill. Can be made 2 days ahead.\nWhen you take the turkey from the oven (see 'goes well with', right), pour the juices from the tin into a deep but narrow jug or bowl. Leave to stand so that excess oil from the turkey rises to the top. Skim off as much fat as you can and discard, then pour the juices into a pan with the gravy base and stir over the heat until bubbling. Season to taste."}
{"text": "First, make the horseradish cream by mixing together the crème fraîche, horseradish sauce and half of the lime juice. Keep the sauce covered and chill until needed.\nTake two glass serving dishes and put 1 chicory leaf in each. Finely shred the rest of the chicory and divide it between the dishes. Stone, peel and thinly slice the avocado, toss in the remaining lime juice and put on the shredded chicory. Lay the crayfish tails over the top.\nAdd the horseradish cream and a light sprinkling of cayenne pepper to serve."}
{"text": "Put the cream, sugar and both zests in a saucepan and bring to a simmer. Measure all the juice – you should have 100ml. Turn up the heat and bubble for 3 mins exactly, then stir in the juice. Sieve the mixture into a jug, then divide between 4 glasses. Chill for at least 4 hrs or until set.\nTo make the compote, put all the ingredients in a saucepan. Bring to a simmer, then bubble for 10 mins until thickened and syrupy. Cool, then chill until ready to serve.\nNow make the palmiers. Heat oven to 200C/180C fan/gas 6 and line 2 baking trays with baking parchment. Unroll the pastry. Mash the butter, cinnamon and sugar until combined, then spread over the surface of the pastry. Roll the pastry up from each of the longer sides until the rolled-up edges meet in the centre. Slice the pastry into 1cm pieces, then place, cut-side up, on the baking trays, flattening a little with the palm of your hand. Bake for 20 mins until golden and puffed up, then cool on a wire rack. Serve each posset with a spoonful of compote and a palmier or two."}
{"text": "The night before, soak the cashew nuts in water and leave overnight.\nTo make the crumble, tip the oats and flour into a bowl, make a well in the centre and pour in the coconut oil. Draw the dry ingredients in until everything is well coated and resembles chunky breadcrumbs. Tip the mixture onto a baking sheet and put in the fridge to firm up – this will make your topping extra crunchy.\nHeat oven to 200C/180C fan/gas 6. Steam the carrots and potatoes together for 5 mins until softened, then transfer to a \n. Drain the cashews and add them too, along with 2 tbsp oil and the rest of the sauce ingredients except for the leeks. Blitz the mixture, season and set aside.\n \nHeat the remaining oil in a large frying pan over a medium heat. Add the leeks and a large pinch of salt, then fry for 15 mins until softened. Spoon in the cheese sauce – if it is very thick, add a splash of water to thin it. Transfer the mix to an ovenproof dish, top with the crumble and bake for 30 mins until piping hot. For a crispy topping, put under the grill to finish. Can be assembled in advance and kept in the fridge to cook when needed."}
{"text": "Steam or microwave the cabbage until just cooked. Melt the butter with the oil in a large frying pan or wok, then add the garlic, rosemary and almonds. Cook, stirring the almonds for about 2 mins or until they start to brown. Tip onto a plate. Add the cabbage to the pan, stir in the leftover buttery juices, then return the almond mixture to the pan. Season well and tip into a serving dish."}
{"text": "Boil a pan of water, add the sprouts and blanch for 6 mins. Drain and cool quickly under the cold tap or in iced water. To get ahead, pack into a plastic food bag and chill overnight.\nOn the day, heat the goose fat in a large wok and add the sage and chestnuts. Cook for a few mins over the heat, add the sprouts, season and stir-fry until piping hot."}
{"text": "Boil the potatoes for 10 mins, then drain. Rough up their surfaces with a fork or by shaking them in the pan with the lid on.\nMelt the goose fat in a large, thickbottomed roasting tin on top of the stove. Tip in the potatoes carefully and turn them until they are evenly coated in the fat. Place on the top shelf of the oven (move the turkey down a shelf if necessary) and roast for 1-1¼ hrs, turning every now and then, until crisp and golden. Sprinkle with salt to serve."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Grease and line a deep, 20cm square tin with baking paper. Sift the muscovado until it’s lump-free. Tip into the largest bowl you have with the flour, coconut, mixed spice, baking powder and walnuts, then mix well. In a jug, whisk together the oil, eggs and 2 tsp of the vanilla extract, then pour over the dry ingredients. Add the carrot, pineapple, reserved pineapple juice and lime zest to the bowl, then give everything a really good mix until combined. Scrape into the tin, then bake on a low to middle shelf for 1 hr, until a skewer inserted comes out with just moist crumbs clinging to it and no sticky mix. Once cool, the cake can be frozen for up to 3 months, then soak with the syrup once defrosted.\nMeanwhile, make a lime syrup by gently heating the caster sugar, lime juice and final tsp of vanilla in a small pan. Once dissolved, boil for a few mins until syrupy.\nLeave the cake in its tin until cool enough to handle, then turn upside-down onto a wire rack. Using a skewer, poke holes all over the cake and drizzle over the syrup a little at a time, waiting for the last addition to soak into the cake before pouring over any more. Cool completely, then trim the edges. Will keep for a few days in an airtight tin.\nTo serve, return the cake to a serving plate, right side up, and place a doily, or a few doilies, over the top. Dust liberally with icing sugar, then very carefully lift off the paper without disturbing the sugar. Serve immediately, as the icing sugar will begin to melt after a while, with a dollop of something creamy on the side – try mixing equal amounts of mascarpone and natural yogurt with a little more icing sugar."}
{"text": "Pierce the rind side of the pork (a roasting fork is good for this) until the skin is covered with fine holes. Put the joint rind side up on a rack over the sink. Bring a pot of water to the boil and, using a large ladle, pour hot water over the rind side of the pork several times. Set the pork aside.\nHeat a wok or large frying pan until it is very hot. Add the salt, peppercorns and five-spice and stir-fry for about 30 seconds until hot and well mixed. Remove from the heat, stir in the sugar, then allow to cool slightly. When it is warm enough to handle, rub this mixture on the flesh side of the pork. Leave, flesh side up, on the rack at room temperature for a minimum of 3 hours (overnight is ideal).\nTo roast Sichuan peppercorns: heat a wok or heavy frying pan to a medium heat. Add the peppercorns (you can cook about 140g/5oz at a time) and stir-fry them for about 5 minutes until they brown slightly and start to smoke. Remove from the heat and let them cool. Grind the peppercorns in a pepper mill or using a mortar and pestle. Seal tightly in a screw-top jar until required. Alternatively, keep the whole roasted peppercorns in a well-sealed container and grind them when required.\nPreheat the oven to 200C/gas 6/ fan 180C. Turn the pork rind side up on the rack and put the rack over a roasting tin with 2-3cm hot water in the bottom. Roast for 15 minutes, then reduce the heat to 180C/gas 4/fan 160C and continue to roast for 2 hours, checking every now and then that your tin is not dry – splash in some hot water from the kettle if it is. Increase the heat to 230C/gas 8/fan 210C for the last 15 minutes. Remove the pork from the oven and leave it to rest (about 20 minutes). Serve carved into large cubes."}
{"text": "Put the potatoes in a large pan of salted water, cover with a lid and bring to the boil. Simmer for 15 mins or until cooked through. Drain and leave to steam-dry for 5 mins.\nHeat the butter in a large pan, add the spring onions and cook for 3 mins, stirring regularly. Tip in the Brussels sprouts and cook for a further 8 mins until soft. Add the milk and warm through for 1 min more.\nTip the potatoes back into their pan, mash, then add the milk and sprout mixture. Add the nutmeg, season and stir."}
{"text": "Grease a 900g loaf tin with oil and line with a double layer of cling film. Put the coffee, sugar and 125ml water in a pan, and bring to the boil. When the sugar has dissolved, remove the syrup from the heat. Add the coffee liqueur and set aside to cool.\nWhisk the double cream until it just holds its shape. Fold through the mascarpone, and then the coffee syrup. To assemble the terrine, press half the halved mini rolls into the tin, cut-side down, trimming them to fit. Tip half the cream into the terrine, then line the whole mini rolls down the middle. Top with the rest of the coffee cream and press the other half of the cut mini rolls into the cream, cut-side up. Wrap with the cling film and press down gently to push the top layer of rolls into the cream, then freeze.\nBefore serving, remove the terrine from the freezer and place in the fridge for 1 hr, then turn out onto a chilled serving dish. Dust heavily with cocoa powder before cutting into slices."}
{"text": "Heat the oil in a large heavy-based pan. Add the onions and sauté for about 8 mins. Stir in the garlic and juniper and cook for 1 min more. Add as much cabbage as you can and cook, stirring, until it starts to soften, then make room for more and add the rest with the cinnamon, vinegar, sugar and stock.\nGive everything a good stir, then cover the pan and leave to cook over a low heat for 35 mins, stirring occasionally and checking it isn’t catching on the bottom of the pan.\nAdd the pears and cook for 10-15 mins more, depending on their ripeness. If freezing, cook for just 5 mins. Leftovers will keep in the fridge for 1 week."}
{"text": "Turn oven to 200C/180C fan/gas 6. Toss the shallots in the sugar. Heat a large ovenproof frying pan until hot, and add the shallots. Cook for a few mins to caramelise the outside to a nice golden colour, then transfer to the oven for 5 mins to cook through.\nCook the peas in boiling salted water for 2 mins until tender, drain and mix with the shallots, mint, olive oil and lemon juice. Season and serve with your favourite roast."}
{"text": "Melt the chocolate and 150ml of the cream together in a small pan. Cool until spreadable, then use to sandwich pairs of the cookies together.\nChoose a cake stand or flat plate to assemble your cake. Tip the remaining cream, the mascarpone, Baileys and icing sugar into a big bowl, and use an electric hand whisk to beat until thick and the mixture is just holding its shape.\nArrange some of your cookie sandwiches to make a base that almost covers the plate. Dot a little of the cream under each, and stick into position. Spread or dollop over a good layer of cream, then add another layer of cookies, a little smaller than the first. To get a neat finish, choose a front to your cake – and always start by arranging the outside ring of cookies from there (then you can snap cookies in half to fill in the middle). Repeat, making the layers smaller each time, until you finish with a single cookie and a dollop of cream on top! Chill in the fridge overnight."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toast the nuts on a small baking tray for 5-8 mins until golden. Roll out the pastry on a lightly floured work surface and stamp 12 circles with a 7.5cm plain round cutter. Use to line the wells of a 12-hole bun tin. Chill until step 3. (You will only use around half of the pastry.)\nTurn the oven down to 180C/160C fan/gas 4. Melt the butter, sugar, syrup and chocolate together in a small pan, then beat in the egg, orange zest, figs and cinnamon. Stir in the toasted nuts.\nSpoon the nutty mixture into the pastry cases and bake for 18-20 mins until the pastry is pale golden. Cool for 10 mins in the tin, then remove to a rack until just warm. Whip the cream with the sugar and booze, then dust the pies with a little icing sugar and finish with a dollop of cream and a scattering of orange zest just before eating. Good with strong coffee or mint tea."}
{"text": "Heat oven to 200C/180Cfan/gas 6. Put the potatoes in a large pan filled with cold salted water. Bring to the boil and cook for 15 mins until a cutlery knife can be inserted into the centre of a potato with only a little resistance, then drain and steam-dry.\nArrange the potatoes in a large roasting tin, leaving enough space between each one so that they have room to spread once smashed. Using a fish slice, push down on each of the potatoes to break them up slightly. Don’t worry if some break up completely, it just means more crispy bits. Season well and drizzle over the oil. Roast for 1 hr, turning once, until golden and crispy."}
{"text": "Start by placing half the white chocolate in a heatproof bowl over a pan of simmering water. Once melted, take the bowl off the heat and add the rest of the white chocolate and the food colouring, if using (just use a tiny amount as the gel colours are quite strong). Stir occasionally to allow the chocolate to melt in the residual heat. Sprinkle a pinch of meringue into 10 of the holes of your chocolate mould. Once the chocolate has melted, use half to coat the insides of the holes where you have sprinkled meringue. Use the end of a teaspoon to spread the chocolate up the sides of the moulds so that the the inside is coated. Leave to set for 45 mins-1 hr.\nMeanwhile, melt the other chocolates in separate bowls using the same method, then use each to coat a further 10 holes of the mould. Keep back half of each chocolate mixture, as you will need this to seal the truffles.\nWhile the chocolate sets, make the fillings. For the Pisco sour filling, beat the softened butter together with the icing sugar until pale and smooth. Add the Pisco, Angostura Bitters and lime zest and stir well. Transfer to a piping bag and store in a cool place until needed.\nTo make the espresso martini filling, melt the dark chocolate and butter in a bowl set over a pan of simmering water (or in the microwave). Remove from the heat and mix in the double cream, vodka and Kahlúa. Leave to cool for 5 mins. Transfer to a piping bag and store in a cool place until needed.\nFor the Cosmopolitan filling, Put the dried cranberries in a bowl with the orange liqueur and leave to soak for 15 mins. Beat the butter with the icing sugar, then stir in the cranberries and liqueur, bit by bit. Mix in the lime zest and cranberry jelly. Transfer to a piping bag and store in a cool place until needed.\nOnce all the chocolate has set in the moulds, pipe the Pisco sour filling into the green/white chocolate shells, the espresso martini filling into the espresso chocolate shells (saving a bit for sticking the beans on later) and the Cosmopolitan filling into the dark chocolate shells. Leave 2mm of space at the top of each one.\nBring the pan(s) of water back to simmering, then set the reserved bowls of chocolate over to melt them again if they have set. Use this remaining chocolate to fill up the moulds and seal in the filling. Try to fill the moulds level or just under – if they go over, they won’t sit flat when the chocolates are turned out.\nLeave your truffles somewhere cool to set completely for at least 2 hrs (ideally overnight). If you put them in the fridge they will set more quickly, but they will lose their shine.\nOnce set completely, pop the chocolates out of the moulds carefully. Add a brush stroke of gold to the Cosmopolitan truffles using your brush pen. Stick a chocolate- coated coffee bean on each of the espresso martini truffles using a bit of the filling. Arrange in a box lined with baking parchment and tissue paper. Will keep in a cool place for up to 1 week."}
{"text": "Put the cranberries in a pan with 150g of the sugar. Gently heat until the sugar begins to melt, then cover and cook for 5-10 mins until the berries are soft. Mash with a potato masher and transfer to a large mixing bowl. Stir in 200ml of the cream and chill until cool.\nIn a bowl, whip the remaining cream with the remaining 50g sugar until soft peaks form. Scrape onto the cranberry mixture and fold 1-2 times to very lightly marble. Spoon between 5 small bowls – the fool will marble more as you spoon into the dishes. Cover and chill for at least 2 hrs or up to 24 hrs.\nFroth the egg white with a fork. Put the extra 3 tbsp sugar on a small plate. Tip the extra cranberries for decoration into the egg white, then drop into the sugar. Shake the plate to roll and coat the berries. Repeat a few times, leaving the sugar to set for a couple of mins between each. Chill until ready to serve.\nTo serve, top each fool with a few sugared cranberries and serve with Cinnamon shortbread (see 'Goes well with')."}
{"text": "Boil the potatoes for 10 mins until tender, then drain. Heat oven to 200C/180C fan/ gas 6. Drizzle half the oil over a flat, sturdy baking tray or baking dish. Using a potato masher, squash a sprig of rosemary into each potato on the tray so the masher leaves its mark and the potato splits around the edges. Drizzle the potatoes with the remaining oil, season with sea salt and roast for 50 mins or until golden around the edges."}
{"text": "Cook the soya beans in boiling salted water for 4 mins. Drain and cool under cold running water. Blitz with the yogurt, chopped red chilli, lime juice and crushed garlic clove until smooth. Fold in the finely chopped red onion and a handful chopped coriander. Serve with halved radishes and sticks of carrots, celery and peppers. "}
{"text": "Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Mix honey and both of the mustards in a bowl. You can make the glaze 2-3 days ahead.\nAdd the sausages and toss well to coat them. Arrange the sausages, spaced apart, on the baking tray. Smooth any remaining glaze left in the bowl on top of the sausages to make them extra sticky. Bake for 20 mins until golden."}
{"text": "Bake the Apricot & almond fruitcake (see recipe to the right of this one) or any other 20-23cm fruitcake but bring out of the oven 10 mins before the end of the cooking time. Increase oven temperature to 200C/180C fan/gas 6. Gently heat the golden syrup and butter in a saucepan.\nWhen it is all melted and runny, stir in toasted flaked almonds, whole blanched almonds and plain flour. Use a couple of teaspoons to dot the mixture all over the top of the cake, and pop back in the oven for 12-15 mins until the topping is nicely golden. Cool, then remove from the tin and cover the sides with pretty ribbons. Lightly dust the cake with icing sugar to finish."}
{"text": "Melt the butter in a large pan, add the onions and celery, and briefly cook until they start to soften. Stir in the apricots and garlic, and cook a few mins more. Add the pecans and nutmeg, and cook, stirring until the nuts are lightly toasted. Leave to cool.\nStir in the breadcrumbs, mince, egg and herbs with 1 tsp salt and lots of pepper, then divide the mixture into 4, pack into bags and freeze. Will keep for 3 months.\nOne batch will make 12 stuffing balls or can be used to stuff roast pork or chicken. Two batches will fill a 1lb loaf tin, lined with streaky bacon that can be sliced, while 2 - 3 will stuff a medium-to-large turkey.\nCook at 200C/180C/gas 6 for 30 mins if rolling into balls, 45 mins if cooking in a loaf tin, or use to stuff the neck of your favourite roast bird, cooking for the same time as indicated in the recipe."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease 8 ovenproof dariole moulds and line the bases with a disk of baking parchment. Sprinkle each slice of clementine with a little sugar and place 1 in the bottom of each dariole, line up on a baking tray and set aside.\nPut the butter and sugar in a large bowl. Mix with an electric hand whisk until smooth and fluffy. Add the eggs, one at a time, whisking until well incorporated. Add the flour, almonds and baking powder, whisk until smooth, then add the zest, milk and cranberries. Give everything a good final mix with a spatula, then divide the mixture between your dariole moulds. Bake for 30 mins until risen, golden, and an inserted skewer comes out clean. Leave to cool in their tins for 10-15 mins while you make the syrup.\nHeat the clementine juice, orange liqueur and sugar in a small pan, swirling until the sugar has dissolved. Increase the heat and boil for a few mins, until the liquid has reduced by about half. Pour into a shallow dish and leave to cool for 5 mins.\nWhen cool enough to handle, turn the cakes out of their tins and peel away the parchment. Stand in the dish of syrup, spooning it over the little cakes until completely absorbed. Transfer the cakes to a baking parchment-lined tray and leave to cool completely before serving with stem ginger cream (see tip below for recipe)."}
{"text": "Melt the butter in a deep non-stick pan. Add the shallots, cloves and bay leaves, and gently cook for 10 mins over a low heat until the shallots are soft and colouring a little. Pour in the milk, then part-cover the pan and leave to simmer on a very low heat for 10 mins.\nRemove the cloves, then add the bread and cream to the shallot mixture. Grate in half the nutmeg, then cook for 5 mins, or until the bread absorbs the milk and starts to break down a little but still has a texture. Can be made 1 day ahead (you may need to thin with a little milk). Grate over the remaining nutmeg to serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. Grease a large baking tray with a little oil. To prepare your skewers, remove most of the leaves from each rosemary sprig, keeping a few leaves at the end. Sharpen the other end to a point by cutting it at an angle.\nStretch the bacon by placing it on a chopping board and running the back of a knife along the length. Cut each piece in half across the middle. Thread 3 sausages onto each skewer, weaving a piece of bacon around them as you do.\nArrange the skewers on the baking tray and bake for 20 mins. Turn them, brush with maple syrup and return to the oven for 10 mins more until really sticky."}
{"text": "Heat oven to 200C/180C fan/gas 6. Peel the potatoes and cut into large chunks or, if they are small enough, keep them whole. Place in a pan of salted water, add most of the turmeric, stir and bring to the boil. Turn down the heat and simmer the potatoes for 6 mins until the sides are fluffy. Drain well and leave to cool slightly. Mix the flour, polenta, paprika and remaining turmeric together in a large bowl, then toss through the potatoes until evenly coated in the flour mix.\nPut the oil and fat in a large roasting tin – you want a layer of fat about 5mm deep, and put in the oven for 10 mins until shimmering hot. Carefully tip the potatoes into the hot fat and use a fish slice to turn them until evenly coated. Place in the oven and leave for 40 mins. Remove, turn the potatoes and return to the oven for another 20 mins until golden. Serve sprinkled with the salt."}
{"text": "To peel the chestnuts, cut a nick in each one on the flat side. Put 6 on a plate and microwave for 1 min on High. Then, wearing rubber gloves, peel off the outer skin and inner brown membrane. Continue until all the chestnuts are peeled. (If you don’t have a microwave, you can roast the chestnuts in the oven at 200C/180C fan/gas 6 for 15-20 mins.) Put them in a pan, cover with water and bring to the boil, then simmer for 25 mins. Drain well.\nPare thin strips of zest from the orange using a vegetable peeler. Cut the vanilla pod in half lengthways. Put the orange strips, vanilla pod, sugars and 400ml water in a pan and bring slowly to the boil, stirring to dissolve the sugar. Simmer for about 15 mins until syrupy. Remove from the heat and stir in the Cointreau.\nPack the prepared chestnuts into sterilised jars (see below) and pour over the syrup to cover. Seal the jars. The chestnuts will keep in a cool, dry place for up to 6 months."}
{"text": "Up to four days before, make the brine by combining the salt, peppercorns, bay, sage and sugar using a pestle and mortar, or crush with the end of a rolling pin in a bowl. Stir through both zests and spoon roughly 1/ 3 into a large resealable bag and the rest in another bag to chill. \nPut the turkey legs and wings in the bag with 1/ 3 of the brine and shake well to coat the skin, then leave overnight in the fridge.\nThe next day, heat oven to 120C/ 100C fan/gas 1. Rinse the brine from the legs and wings and pat dry. Put the duck fat in a roasting tin, melt in the oven for 5 mins, then add the turkey pieces (they should be submerged in the fat). Cook in the middle of the oven for about 4 hrs or until the legs are tender. Leave to cool, then cover and chill overnight, or up to three days.\nOn Christmas Eve, cover the turkey crown in the remaining dry brine and chill in the fridge overnight.\nIn the morning, take the crown out the fridge 1 hr before roasting, rinse off the brine and pat dry with kitchen paper. Take the confit legs, thighs and wings out the fridge and leave to come to room temperature so they are easily released from the fat. Take out and put on a baking tray ready to reheat later. Strain the fat and set aside ready to cook the potatoes.\nHeat oven to 190C/170C fan/gas 5 and line a large shallow roasting tin with foil. Set a wire rack on top, scatter the herbs and onion across and sit the crown on top. Rub the butter all over the skin and season well. Roast, uncovered, for 40 mins, then cover with foil and cook for another 30 mins. Remove the foil, and cook for a final 15-20 mins. To test if the turkey is cooked, insert a skewer into the thickest part of the breast – the juices should run clear. Transfer to a platter, cover with foil and leave to rest for at least 30 mins.\nMeanwhile, reheat the confit legs and wings in the oven for 30 mins or until the skin has crisped up. Add to the platter with the crown and carve."}
{"text": "Put all the ingredients (except the slices of orange) in a slow cooker on low for 1 1/2 - 2hrs until hot. Ladle into heatproof glasses and serve with slices of orange. "}
{"text": "Heat oven to 180C/160C fan/gas 4. Rinse the lentils and rice together under cold water until the water runs clear. Soak them in water for 30 mins, then drain. Meanwhile, toss the celeriac and garlic halves in 4 tbsp of the rapeseed oil and season. Cover with foil and roast for 20 mins, tossing occasionally. Remove the foil and return to the oven for 10 mins until soft and caramelised.\nHeat 4 tbsp of the oil over a medium heat, season and fry the onions for about 12 mins until starting to caramelise. In the meantime, cook the macaroni until al dente, then drain. Tip into the onions along with the pine nuts, fry until the nuts and pasta are starting to brown, then remove from the heat.\nHeat the remaining 2 tbsp oil in a heavy-bottomed frying pan and add the ground cinnamon, cumin and coriander seeds. Stir until they sizzle, then add the lentils and rice. Stir-fry for 1 min, then add the stock and cranberries. Cook for about 25 mins, stirring occasionally, until the stock is absorbed and the cranberries have swelled up.\nTip the lentil mixture into the onion mixture along with the celeriac, and heat over a medium heat to warm it all through. Squeeze the roasted garlic cloves out of their skins and mash with the lemon zest and juice, then stir into the rice.\nIn a separate container, stir the harissa into the yogurt. To serve, divide the koshari between bowls and top with the spiced yogurt and coriander."}
{"text": "Heat oven to 200C/180Cfan/gas 6. Bring a large pan of salted water to the boil. Add the parsnips and carrots, cook for 2 mins, then drain and empty into a large roasting tin. Drizzle over the oil and season.\nMix together the harissa and marmalade, then spoon over the veg and toss to coat. Roast for 45-50 mins until sticky and caramelised."}
{"text": "Heat oven to 220C/200C fan/ gas 7. Cut the chicken wings into winglets by slicing through each of the joints. Keep the two meaty pieces and discard the wing tips, or freeze for stock.\nPut the winglets on a large baking sheet, drizzle with the olive oil, then season. Roast in the oven for 20 mins, then reduce the temperature to 180C/160C fan/ gas 4 and cook for a further 25 mins.\nMeanwhile, make the barbecue sauce. Put all the ingredients, except the butter, in a pan and mix together with plenty of black pepper. Let it bubble away for 3-5 mins to thicken up a little, then add the butter and stir until it has melted and made the sauce nice and shiny. Season to taste.\nHalf an hour before the chicken wings are ready, take them out of the oven and brush over three-quarters of the barbecue sauce. When they’re fully cooked, toss them in the rest of the sauce so that they become sticky.\nIn a small bowl, mash the blue cheese dressing ingredients together with some seasoning, until combined. The barbecue sauce and dip can be made a day ahead, covered and chilled. Serve alongside the wings with the celery sticks and radishes for dipping."}
{"text": "In a large bowl, mix together all the fritter ingredients, except the oil, until combined. For the yogurt dip, simply mix all the ingredients together in a small bowl with plenty of freshly ground black pepper and 1 tsp salt. The dip can be made in the morning and chilled.\nWhen you’re ready to cook the fritters, heat the oil over a high heat (you want to make sure the oil is really hot, so be brave!). Carefully drop 1 tbsp of batter into the pan – add only 4-5 tbsp at a time so you don’t overcrowd the pan – and fry for about 2 mins each side until nicely crisp and golden. Remove from the pan and place on kitchen paper to absorb the excess oil. The fritters can be fried a couple of hours before serving, then reheated in the oven.\nTo reheat the fritters ready for serving, heat oven to 220C/200C fan/gas 7. Put the fritters on a baking tray and bake for 10 mins or until crispy and hot. Serve on a platter with the feta and spring onions scattered over, with the minty yogurt dip on the side."}
{"text": "Heat oven to 180C /160C fan/gas 4. Grease and line a 23cm x 33cm Swiss roll tin with baking parchment.\nBeat together the eggs and caster sugar with an electric hand whisk until pale, thick and doubled in volume. Working quickly, divide between 6 bowls and stir a colouring paste into each portion.\nSift the flour and baking powder into a separate bowl and combine evenly. Sprinkle 3 tbsp of the flour mixture over each portion of the egg mixture. Drizzle with a little of the melted butter. Fold together very gently, taking care not to knock out the air.\nGently spoon each mixture into separate piping bags, then cut off each tip to create a 2cm hole. Pipe lines of the mixture diagonally across the Swiss roll tin in a rainbow pattern, making sure the lines touch each other. Continue until the tin is full and the mixture is used up. Bake for 12 mins, or until springy and dry to the touch.\nPlace a large piece of baking parchment onto a clean surface and sprinkle with caster sugar, then turn the cake out onto it. Remove the lining paper and loosely roll up the sponge from the short side, with the sugared paper rolling along with it. Cover with a damp tea towel and leave on a wire rack to cool completely.\nFor the whipped cream filling, beat the cream with an electric hand whisk until soft peaks form. Add the icing sugar and vanilla extract and whisk briefly until just combined.\nGently unroll the cake and remove the paper. Spread the cream filling evenly across and reroll. Trim the ends if any cream leaks. Dust with icing sugar before serving."}
{"text": "Heat the oil in a saucepan over a medium heat. Add the shallot and a pinch of salt, and cook for 6 mins until softened. Stir in the garlic and caraway seeds and cook for 1 min more, then add the carrot and veg stock, bring to a boil and simmer for 12 mins.\nOnce the carrots are completely soft, drain them (reserve the liquid) and \n to a smooth purée – add a tbsp of the reserved stock initially, but use more if necessary to get the desired consistency. Season and leave to cool. The purée can be made a day ahead and kept in the fridge.\nTo serve, spoon the purée – or, if you want to be extra fancy, transfer it to a piping bag and pipe it – onto the oatcakes and top each with a little dill and a veg crisp."}
{"text": "Warm 350ml water in a saucepan until steaming, then remove from the heat, add the butter and set aside to cool until you can comfortably put your finger in the liquid. Combine the flour, yeast, sugar and 1 tsp salt in a large bowl or the bowl of a tabletop mixer. Add the cooled liquid and combine to make a soft dough. Knead for 10 mins by hand, or 5 mins in a mixer, until the dough feels stretchy and smooth. Return to a clean, oiled bowl and cover with oiled cling film. Leave somewhere warm to rise for 11/2-2 hrs or until doubled in size.\nGrease and line your largest baking tray (ours was 42 x 33cm) with baking parchment. Grease the parchment too, then scatter over the polenta. Remove the cheeses from their boxes and place on the tray, spaced well apart. Brush each one with a little oil, slash the tops a few times with a sharp knife and poke in some fresh herbs, if you like.\nPour the egg into a shallow dish, the poppy seeds in another and the sesame in a third. Knock the air out of the dough and knead again for several mins. Take a small piece of dough (about the size of a whole walnut ) and roll it into a ball. Dip the top in egg, then into one of the dishes of seeds, and place on the baking tray, seeded-side up. Continue rolling and dunking the dough, leaving every third piece seedless, filling the tray but leaving a little space between each ball of dough. When you have used all the dough, you may need to reposition the dough balls to ensure the baking tray is evenly covered.\nHeat oven to 180C/160C fan/ gas 4. Cover the tray with a few sheets of oiled cling film and leave for 30 mins-1 hr until the dough has doubled in size and the balls are touching. Bake for 25-30 mins until the dough balls are cooked through and the cheese is oozy and melted. Leave to cool for 5 mins, then serve."}
{"text": "Make the pizza dough: put the bread mix in a large bowl, pour over ½ tbsp olive oil and 175ml lukewarm water. Stir until a dough is formed, then tip out onto a lightly floured surface and knead for 5-10 mins until smooth. Rub the bowl with a little oil, pop in the dough, cover with cling film and leave to rise in a warm place for 45 mins or until doubled in size.\nMeanwhile, make the pizza topping. Heat 1/2 tbsp oil in a large frying pan over a medium heat. Add the bacon and cook until just starting to crisp. Remove with a slotted spoon and drain on kitchen paper. Add another drizzle of oil to the pan, then tip in the sprouts, season and cook for 3-4 mins until softened and starting to caramelise around the edges. Set aside.\nFor the white sauce, melt the butter in a small pan, add the garlic and let it sizzle gently for 30 secs. Pour in the cream, grate over some nutmeg, season and simmer for 5 mins until thickened and reduced.\nHeat oven to 220C/200C fan/gas 7 and pop in 2 large trays. Carefully remove the dough from the bowl and, without punching out all the air, divide into 4. Using your hands or a rolling pin, shape each quarter into a rough circle 18-20cm in diameter. Transfer to the hot trays and cook for 4 mins. Remove from the oven, spread over the white sauce, then scatter with the sprouts, bacon and stilton. Toss the sage leaves with the remaining oil and divide among the pizzas. Cook for 5-10 mins until the dough is golden brown and the top is bubbling. Grind over some black pepper before serving."}
{"text": "Combine the milk, onion, cloves, bay leaf, peppercorns and mace in a medium-sized microwaveable bowl. Place in the microwave and cook for 2 mins on High. Remove, cover with cling film and stand for 15 mins, or chill for up to 2 days if the milk’s sell-by date allows.\nWhen you’re ready to serve, strain the sauce, then return to the bowl. Add the breadcrumbs, place in the microwave again and cook for 3 mins on High. If the sauce is a bit lumpy, whisk until smooth, then stir in the cream, nutmeg and seasoning. Finish with a knob of butter."}
{"text": "Heat oven to 180C/160C fan/gas 4. Rinse the turkey inside and out, then pat dry with kitchen paper. Weigh it to calculate the cooking time, allowing 40 mins per kg for the first 4kg, then 45 mins for each 1kg over that weight. Finely grate 1 tsp zest from the lemon and set aside for the stuffing. Cut the lemon into 4-6 wedges and tuck into the turkey cavity with the shallots and herb sprigs. Rub the turkey all over with the butter, then season with salt and pepper. Put the onion wedges in the middle of a large roasting tin and sit the turkey on top. Cover with a loose tent of foil, then roast following your calculated time.\nMake the stuffing. Chop just over half the pecans and reserve the remaining. Line the base of a baking tray or sheet (big enough to take 16 stuffing balls) with baking parchment. Heat the oil and butter in a frying pan, tip in the shallots and garlic, and fry for a few mins until softened. Stir in the chestnuts and chopped pecans, then tip into a large bowl and cool. Squeeze the sausages from their casings and add to the bowl with the nut mixture. Add the remaining stuffing ingredients, including the reserved lemon zest, and season with salt and pepper. Shape the stuffing mixture into 16 balls. Break the remaining pecans into big pieces and press a piece into top of each ball. Arrange balls on the prepared tray, cover with buttered baking parchment and chill until ready to cook. Can be made 1 day ahead and chilled.\nMake the glaze. Mix the honey, mustard, remaining 1 tbsp butter and soy sauce in a small bowl and set aside. Thirty mins before the end of the cooking time, remove the turkey and increase oven to 200C/180C fan/gas 6. Remove the foil, then return the bird to the oven for a further 10 mins. Remove again, brush the turkey with the glaze, then roast for another 20 mins until golden. If you are roasting potatoes, put them in now. To test if the turkey is cooked, pierce the fattest part of the thigh with a skewer – the juices should run clear, not pink. If they are pink, continue to roast, checking at 10 min intervals.\nRemove the turkey from the oven, transfer to a warm serving platter and rest, covered loosely with foil so it doesn’t stick to the glaze, for up to 1 hr before carving. Meanwhile, cook the stuffing balls and shallots. Increase oven to 220C/200C fan/gas 7. Bake stuffing balls in the oven for 25-30 mins, removing the paper for the last 5 mins if they need browning.\nMake the shallots. Put the shallots in a small roasting tin, toss in the oil, scatter over a few thyme and sage sprigs, and season with salt and pepper. Roast for 25-30 mins, turning half way, until shallots are nicely caramelised.\nMake the gravy. Pour off any excess fat from the roasting tin but leave the juices and onions. Sprinkle in the flour, set tin over a medium heat and cook, stirring for a couple of mins to cook the flour, scraping up any sticky bits from the bottom of the tin. Gradually pour in the stock, along with any resting juices from the turkey, and continue to stir until slightly thickened. Simmer gently for about 10-15 mins or until reduced to your liking. Season with salt and pepper if needed. Strain gravy into a pan, warm through, pour into a jug and serve with the turkey. Serve the turkey surrounded with stuffing balls, roasted shallots, and thyme and sage sprigs."}
{"text": "Tip all the ingredients into a pan and stir well to combine. Bring to the boil, then reduce the heat and simmer until the cranberries start popping (about 5 mins for fresh cranberries or 8-10 mins for frozen) and turn into a runny sauce. Leave to cool before serving."}
{"text": "Make sure your cake is completely cooled, remove from its tin and peel off the baking parchment. Spread a little icing over a cake board or cake stand, then invert your cake onto it, so the bottom now becomes the top.\nOn a clean surface lightly dusted with a little icing sugar, roll out the marzipan to a circle large enough to cover the cake – use a piece of kitchen string to help you check. Melt the apricot jam in a small pan with 1 tbsp water, then sieve and brush a little all over your cake. Cover the cake with the marzipan, smoothing it over the surface. Trim the edges.\nBrush the marzipan all over with the remaining apricot jam, then roll out 1kg of the fondant icing and, using the same method as for the marzipan, cover your cake with the icing. Trim the edges. (See our step-by-step guide on how to cover your cake, above.)\nSplit the remaining icing into 3 equal lumps. Dye 1 ball of icing bright red and another gingerbread brown. Cover the icing tightly with cling film until needed. Roll out the brown icing and, using your cutter, stamp out 5 gingerbread men. Use a little of your runny icing to glue the gingerbread men to the top of the cake in a circle.\nRoll your red icing and white icing into 20cm sausage shapes, squeeze them together, then continue rolling, twisting the sausage as you roll to give you a candy-cane effect. Use a piece of string to measure around the base of the cake, then cut a candy cane-coloured strip long enough to run around the base and stick it with a little runny icing. Roll the remaining candy cane-coloured icing out a little thinner, then cut into 5 short pieces and bend the ends over to make candy canes. Stick 1 of these between each gingerbread man.\nPour the remaining icing into a piping bag fitted with a small nozzle, or a sandwich bag and snip off the end – if the icing is a little runny, thicken it with extra icing sugar first. Use the icing to pipe a smiley face, eyes and 2 dots in the middle of each gingerbread man – stick edible gold balls on the dots to make buttons."}
{"text": "Whizz together the pistachios, sugar, butter, 1 egg and the flour in a food processor to an almost smooth frangipane.\nRoll the pastry into a ball (to break up some of the layers), then roll out very thinly on a flour-dusted surface. Cut out 4 x 11cm circles and 4 x 13cm circles – you’ll probably need to re-roll once. Save all the trimmings.\nPut 6 raspberries in the centre of each of the 4 smaller circles, then dollop on some pistachio frangipane. Using a small palette or round-bladed knife, spread and smooth the mixture into a dome, covering and enclosing the raspberries – leave a good 1cm of pastry clear around the edge. Beat the second egg and brush a little around the pastry edges. Carefully lay the larger circles of pastry on top, easing and pressing them over the filling bit by bit, all the way around, to squeeze out any air. Reshape the pithiviers to give a nice round dome shape, press the edges to seal, then trim any excess pastry around the edges if you need to. Brush egg over all the pithiviers.\nDecorate the tops by lightly scoring a pattern with the tip of a sharp knife. Pinch the edges to seal, then crimp to give a fluted edge. If you like, brush egg over some of the rolled-out trimmings, then brush with edible glitter. Use letter cutters to cut out the initials of your guests, or any other shapes you like. Spray other trimmings with gold spray and stamp out more shapes. Decorate with the shapes and cover loosely with cling film. Chill for at least 2 hrs, but more if you can. Can be made 1 day in advance.\nHeat oven to 200C/180C fan/gas 6. Bake the pithiviers for 20-25 mins until golden and crisp. Serve immediately."}
{"text": "First, use a veg peeler to peel the butternut squash and heat oven to 200C/180C fan/gas 6. Then using, a large, sharp knife cut a few 1cm thick ring-slices from the bulbous end, and a few small solid slices from the top end. Set aside the slices, and dice the rest into 1-2cm chunks. Toss the chunks with 1 tbsp of the sunflower oil on a baking parchment-lined tray and roast for 20-30 mins until tender and golden.\nMeanwhile prepare the tin. It’s worth taking some time to do this, as it’ll be the top of your cake in the end – and the bit you want to look impressive! Line the base of a deep, round, 25cm tin with a sheet of baking parchment. Brush the new base and sides with some oil, then start to arrange the rings in the base. You want to get in as many as you can, overlapping a bit like the Olympic rings. Snuggle in as many flat as you can, then sit your overlapping ones on top, cutting out bits of the squash, so they’ll also sit flat too. Any leftover trimmings, put in a microwave-proof bowl with a splash of water, cover with cling film and microwave on High at 2 min intervals until tender – around 5-6 minutes.\nIn a separate pan, soften the onion in the last 2 tbsp of sunflower oil, over a very low heat so it doesn’t brown. Stir in the chopped sage, half the rosemary, and the garlic and mace, and cook for another few mins until fragrant. Mix the ground chia seeds or linseeds with 4 tbsp of water, and set aside with the cooling onions, until gluey.\nMeanwhile, roughly chop half the chestnuts but keep them chunky. Put the other half in a food processor with half the lentils, the microwaved squash and one-third of the roasted squash. Pulse to a mashed mixture. Tip this into a large mixing bowl with the softened onions, breadcrumbs, ground seed mixture and 1 tsp salt. Mash everything together really well to thoroughly mix, then more gently stir in the chopped chestnuts, followed by the whole lentils, and finally the remaining roasted squash chunks. Carefully press this mixture around and over the squash rings in the prepared tin. Level off the top, making sure it is tightly packed, then cover with foil. \nTo bake, heat the oven to 180C/160C fan/gas 4. Put the cake (still foil covered), into the oven on a middle shelf and bake for 1 hr.\nTo serve, heat the rapeseed oil in a small frying pan and sizzle the reserved sage leaves with the remaining rosemary sprigs for a minute. Loosen around the sides of the cake with a round-bladed knife, then sit a serving plate inverted on top, and carefully flip the plate to turn out the cake. Spoon over the sizzled sage and rosemary leaves and herby oil, and serve at the table – for cutting into wedges in front of everyone."}
{"text": "Melt the butter in a large pan, tip in the leeks and sweat for 5 mins, stirring to break up, until they soften. Stir in the cabbage, then pour over the cider. Turn up the heat and wilt the cabbage for a few mins. Season, and serve immediately."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put the parsnips and carrots in a large roasting tin. Mix the oil, honey and coriander seeds together with some seasoning and spoon over the vegetables, turning them to coat, then roast for 20 mins.\nAdd the apples to the tin and cook for a further 20 mins until the vegetables are golden and just tender."}
{"text": "Heat oven to 140C/fan 120C/gas 1. Line a 33cm x 23cm Swiss roll tin with baking parchment. For the meringue, mix together the cornflour, coffee and vinegar, and set aside. Whisk the egg whites to stiff peaks, then gradually beat in the sugar, a spoonful at a time, until quite thick. Whisk in the coffee mix.\nSpoon the meringue onto the paper and gently spread, giving the top a few swirls. Scatter over the pistachios. Bake for 35-40 mins until it feels crisp.\nMeanwhile, make the filling. Slice the mango either side of the stone, peel, then finely chop the flesh. Beat the mascarpone, then stir in the mango. Whip the cream until thick and fold into the mango mix. Halve the passion fruit, scoop out the inside and set aside.\nWhen the meringue is cooked, leave in the tin for 10 mins, then lift out and put on a cooling rack, paper-side down. Dust a sheet of baking parchment with icing sugar and, when the meringue is cold, tip it on, paper side up. Peel off the lining paper and spread the cream over. Drizzle over the passion fruit and roll up using the paper as a guide. Open-freeze (see 'Try' below) on a board, wrap in foil and freeze for up to 1 month.\nTo serve, unwrap and thaw in the fridge for about 1 hr. Sift with icing sugar and serve in slices."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Unwrap the puff pastry and, using a 5cm cutter, cut out 20 rounds (you may need to re-roll the pastry trimmings to get 20 circles). Now use a slightly smaller cutter to make a light dent in the pastry, creating a rim. Use a fork to make a few pricks in the centre of the pastry; this will stop it from rising, while letting the outer rim puff up.\nPlace the pastry discs on a baking sheet and brush all over with the egg. Crumble the goat’s cheese in the centre of each tartlet and scatter over the olives. Can be made up to this point up to 2 days ahead and kept in the fridge. Cook for 15-18 mins until the pastry is puffed and golden brown. Sprinkle with parsley before serving."}
{"text": "Heat oven to 180C/160C fan/gas 4. Rinse the turkey inside and out, then pat dry with kitchen paper. Weigh the turkey to calculate the cooking time, allowing 40 mins per kg for the first 4kg, then 45 mins for each 1kg over that weight. Cut 1 onion into quarters and the other into 6 wedges. Finely grate 1⁄2 tsp orange zest from the orange and set aside for the stuffing. Quarter the orange and tuck it with the onion quarters into the turkey cavity. Rub the turkey all over with the butter, then season with salt and pepper. Put the onion wedges and carrot chunks in the middle of a large roasting tin and sit the turkey on top. Cover with a loose tent of foil, then roast following your calculated time.\nMake the stuffing. Butter a 28 x 18 x 3cm deep baking tray and crush the juniper berries using a pestle and mortar. Melt the butter in a large frying pan, tip in the onions, garlic and celery, and fry for about 12-15 mins until softened and just starting to turn golden. Stir in the crushed juniper berries, then remove the pan from the heat. Stir in the breadcrumbs, apples, prunes, most of the parsley (reserve a small handful, to garnish), the reserved orange zest and the beaten eggs. Season with salt and pepper. Spoon the stuffing loosely into the baking tray, pat it down gently (don’t pack it down) then lay a piece of buttered baking parchment on top. Set aside. Can be made 1 day ahead and chilled.\nThirty mins before the end of the cooking time, remove the turkey and increase oven to 200C/180C fan/gas 6. Remove the foil, baste the turkey, then return to the oven for a further 30 mins until golden. If you are roasting potatoes put them in now. To test if turkey is cooked, pierce the fattest part of the thigh with a skewer – the juices should run clear, not pink. If they are pink, continue to roast, checking at 10 min intervals.\nRemove the turkey from the oven, transfer to a warm serving platter and rest, covered loosely with foil, for up to 1 hr before carving. Meanwhile, cook the stuffing, and make apple wedges and gravy. Increase oven to 220C/200C fan/gas 7. Bake the stuffing for 30 mins, then remove paper and bake for a further 10 mins to brown the top.\nMake the gravy, pour off any excess fat from the roasting tin, leave the juices and onions, and discard the carrot. Stir the wine and lingonberry jam or redcurrant jelly into the tin, scraping up any sticky bits from the bottom. Set the tin over a high heat and bring to the boil, then boil rapidly for 8-10 mins until reduced by half. Pour in the stock along with any resting juices from the turkey, and simmer for 10-15 mins or until reduced to your liking (this makes a slightly thinner gravy). Season, if needed.\nMake the apple wedges. Melt the butter in a large non-stick frying pan. Tip in the almonds and apples, and fry over a medium heat for about 5-8 mins, moving them around often, until the almonds are toasted and the apples golden and softened, but still holding their shape. Don’t worry if the butter starts to turn a nutty brown, it just adds to the flavour.\nTo serve, strain the gravy into a pan, warm through, then pour into a jug. Scatter the stuffing with the reserved parsley and cut into squares or wedges. Garnish the turkey with the apples, nuts and flat-leaf parsley sprigs, and serve everything together."}
{"text": "Heat oven to 220C/200C fan/gas 7. Mix together the polenta, Parmesan and nutmeg, and set aside. Bring a pan of salted water to the boil, tip in the parsnips and cook for 6 mins or until just tender. Drain. While parsnips are still hot, toss with the Parmesan mixture to coat.\nSet a roasting tin over the hob and heat the oil. Add the parsnips and turn to coat in the oil. Put the tin in the oven and roast for 15 mins, then turn the parsnips over and cook for 15 mins more until golden."}
{"text": "Heat the oil in a wok, add the garlic and fry for 2 mins. Tip in the bok choi and stir well over the heat for 4 mins until it wilts. Pour in the oyster sauce, soy and 50ml water. Simmer for a further 3 mins, then scatter over the chilli to serve."}
{"text": "Melt the dark and white chocolate in separate bowls suspended over pans of gently simmering water, stirring every now and then. Meanwhile, line a large baking tray with baking parchment. Leave the chocolate to cool for 10 mins.\nPour the dark chocolate onto the tray and spread it into a rectangle, roughly 20 x 25cm. Drizzle over the white chocolate and create a swirled pattern by dragging a cocktail stick back and forth across the chocolate. Scatter over the nuts, fruit and sea salt, then leave somewhere cool to set.\nBreak into shards or leave whole, wrap in cellophane or pack into a box, then tie up with ribbon. Will keep for 2 weeks."}
{"text": "Mix the crabmeat with the mayonnaise, mustard, lemon juice, salt and a good grinding of black pepper. Chill for up to a day.\nTo serve, arrange the leaves from the lettuce to form a cup on your board and pile the crab in the centre of the lettuce cup."}
{"text": "Trim the outer leaves from the leeks and cut off the top down to where the leaves split. Cut the leeks into 3-4 chunks, then wash really well to remove any grit. Heat a steamer, add the leeks and cook for 8 mins. Tip in the peas and cook for 2-3 mins more until both are tender.\nMeanwhile, whisk the oil, vinegar, honey, mustard and seasoning together in a serving bowl to make the vinaigrette. Add the hot vegetables and herbs, and mix well."}
{"text": "Halve the parsnips down their length (as they are not too big, the cores shouldn’t be woody so there is no need to remove them), then cut each half into 3 equal pieces. To do this, cut off the bottom and halve the top down the length. Boil for 5 mins, then drain well and toss with the flour.\nHeat oven to 220C/200C fan/gas 7. Put the oil in a large roasting tin and heat in the oven for 5 mins. Add the parsnips, turn them in the oil and give the tin a shake so that all the parsnips are in contact with the base of the tin. Roast for 30 mins, turning once, until golden. Tip onto a platter, drizzle with the maple syrup and scatter with rosemary and salt."}
{"text": "Open the pack of lasagne sheets and divide between two large pieces of greaseproof paper. Wrap into 2 parcels and secure with sticky tape then wrap in wrapping paper and tie with string or ribbon, adding a label, if you like. Place each parcel into a lasagne dish along with a tin of tomatoes and a bottle of wine.\nTo make the seasoning sachet, place the dried mushrooms into a small food processor. Blitz until finely chopped then transfer to a small bowl. Stir in the remaining sachet ingredients and mix well then divide between 2 pieces of tin foil. Fold the foil parcels up to contain the mushroom and spice mix inside then wrap each one in wrapping paper. Label and place into the lasagne dishes.\nSterilise your jars and keep warm until needed (see tip). Heat the olive oil in a saucepan over a low heat then add the onion and cook gently for 20 mins until really soft. Stir in the garlic and heat for a further 5 mins. Divide the hot onions between the smaller jars, seal and leave to cool.\nNow make the béchamel sauce. In a large saucepan, melt the butter over a medium heat. Add the flour and mix really well. Add the milk gradually until you have a smooth sauce then add the bay leaves. Simmer gently and allow to thicken, then season well with salt, black pepper and nutmeg. Divide between the large jars making sure a bay leaf goes into each one. Seal, leave to cool then label as ‘Béchamel sauce’. Once cool, refrigerate the jars until needed then add one to each lasagne dish along with a pack of Parmesan. Write or print out the recipe below and fix to a gift tag."}
{"text": "To make the red wine jelly, put the red wine, jam sugar, star anise, clove, cinnamon stick, allspice, split vanilla pod and seeds in a medium saucepan. Stir together, then heat gently to dissolve the sugar. Turn up the heat and boil for 20 mins until reduced and syrupy. Strain into a small, sterilised jam jar and leave to cool completely. Will keep in the fridge for up to 1 month.\nTake the pastry out of the fridge and leave at room temperature for 10 mins, then unroll. Heat the grill to high and heat the oven to 180C/160C fan/gas 4. Cut out 2 x 13cm circles of pastry, using a plate as a guide, and place on a non-stick baking sheet. Sprinkle each circle with 1 tbsp sugar and grill for 5 mins to caramelise, watching carefully so that the sugar doesn’t burn. Remove from the grill. Can be done a few hours ahead, and left, covered, out of the fridge.\nPeel, quarter and core the apples, cut into 2mm-thin slices and arrange on top of the pastry. Sprinkle over the remaining sugar and pop in the oven for 20-25 mins until the pastry is cooked through and golden, and the apples are softened. Remove and allow to cool slightly. Warm 3 tbsp of the red wine jelly in a small pan over a low heat with 1 tsp water to make it a little more runny, then brush over the top of the tarts.\nTip the crème fraîche into a bowl, sift over the icing sugar and cardamom, and mix together. Carefully lift the warm tarts onto serving plates and serve with the cardamom crème fraîche."}
{"text": "Heat oven to 180C/160C fan/gas 4. Butter and line the bases of two 18-19cm cake tins with baking parchment. \nBeat the butter and sugar with an electric \n until pale and fluffy. Add the eggs, one at a time, and beat well, scraping down the sides of the bowl after each addition. Add the lemon zest, vanilla, flour, milk and a pinch of salt and blend until just combined, then evenly divide the mixture between the tins.\nBake in the centre of the oven for 25-30 mins until a skewer inserted into the middle of each cake comes out clean. Cool the cakes in their tins for 10 mins, then turn out onto a \n and leave to cool completely.\nTo make the buttercream, put the butter in a large bowl and beat with an electric whisk until fluffy. Add the icing sugar 2-3 tbsp at a time until it is all incorporated, adding the vanilla and milk halfway through. Sandwich the cakes together with a little of the buttercream and put on a board. Use the remaining buttercream to cover the sides and top of the cake. Chill for 30 mins.\nTo decorate, \n the white fondant icing on a surface lightly dusted with icing sugar until large enough to cover the top and sides of the cake. Drape the fondant icing over the cake and carefully mould to fit. Trim off any excess, wrap and set aside.\nRoll out the green icing and cut out a semi-circle, using the base of the cake tin as a guide; this will be the snowman’s hat. Brush one side with a little water and stick on the cake. Cut a strip of green icing and make some markings to make it look like the band of a hat, then trim to the correct length and stick on. \nTo make the nose, shape a round, flat lump from the orange icing. Mark a smile by gently pressing the rim of a water glass into the fondant. Cut out two circles from the black icing for the eyes, then add a small circle of white icing (from the offcuts) to make the eyes appear to sparkle. To make the scarf, wrap a strip of the blue icing around the base of the cake, then use a knife to add cuts for the fringe. Will keep for up to a week in an airtight container in a cool place."}
{"text": "Beat together the eggs, milk, Tabasco, Worcestershire sauce and some seasoning in a jug. Heat the oil in a large non-stick pan over a low heat and pour in the egg mix. Cook, stirring, until it is done around the edges and slightly runny in the middle. Then tip in the tomatoes and warm through for 1 min until the eggs have finished cooking.\nTop the toast with the scrambled eggs and chives, and place the smoked salmon on the side with a wedge of lemon to squeeze over. Drizzle over extra Tabasco and Worcestershire sauce, if you like it with an extra kick."}
{"text": "Heat a large frying pan. Spread the membrillo paste over one slice of bread (you might need to mash it first with 1 tsp water if it’s very firm), top with the chorizo and cheese, and sandwich with the other slice. Spread the outside of both pieces of bread with mayo, and press on the sage leaves.\nHeat the oil in the pan and cook the toastie for 2-3 mins each side, squashing with a fish slice every now and then, until the bread is crisp and golden and the cheese has melted. Cut in half to serve."}
{"text": "First, make the dipping sauce. Mix all the ingredients except for the lime wedges, adding a splash of water to loosen if it is too thick. Season and set aside. Can be made up to a day in advance and kept in the fridge.\nCut the tempeh into 16 slices. Heat the oil in a large frying pan over a medium heat. Fry the slices of tempeh for around 3 mins each side. Add the teriyaki sauce to the pan, and turn the slices to coat them. Let it bubble away for 1-2 mins – you’re looking for the tempeh to be well covered and sticky.\nTip the sesame seeds into a cup. Take the sticky slices of tempeh and push a wooden skewer into each (don’t push them down too far). Dip one end of the tempeh into the sesame seeds, then transfer to a serving platter with the dipping sauce in a bowl and the lime wedges on the side."}
{"text": "Once the cake has been removed from the oven, increase the heat to 200C/180C fan/gas 6. Leave the cake in its tin. Put the sugar cubes in a large bowl and crush with the end of a rolling pin to a sugary rubble. Mix in the preserving sugar, pearly balls and egg white – it should have the texture of wet sand. Tip the mixture on top of the cake and level the surface. Bake the cake for 5 mins to set the sugary crust, then remove and leave to cool.\nOnce completely cooled, remove from the tin and peel off the baking parchment. Sprinkle the top with edible glitter, tie ribbons around the side and decorate with your favourite figurines, if you like."}
{"text": "Heat the grill to high. Put the peppers, skin side up, on a baking tray, then pop them under the hot grill for about 10 mins until the skins blister and blacken. Drop them into a bowl, cover with some cling film and leave until cool enough to handle. Peel away and discard the skins, then roughly chop the peppers.\nHeat the oil over a low-ish heat in a sturdy roasting tin or in a shallow pan that has a lid and is large enough to fit both fish. Throw in the shallots and garlic and sweat briefly until soft. Stir in the tomatoes, peppers, capers, olives and half the basil leaves, then sweat for a few mins until the tomatoes soften. Pour in the wine and tomato juice. Stir and gently simmer for 10-15 mins, adding a splash of water if the sauce becomes a bit dry.\nWhile the sauce is simmering, slash each side of the fish a few times. When the sauce is ready lay the fish on top, season if you want to and cover with a lid (cover with foil if you are using a roasting tray). Leave to cook on a low heat for 12-15 mins until the flesh feels firm when pressed.\nWhile the fish is cooking, melt the butter in a large pan, then fry the spinach until wilted, season if you like and divide the spinach between two serving dishes. Lift the fish carefully from the pan and place on top of the spinach, neatly drizzle some of the sauce round the fish, scatter the remaining basil on top and drizzle everything with extra-virgin olive oil. Serve with some ribbon shaped pasta, like tagliatelle or pappardelle, with the remaining sauce in a bowl or side dish."}
{"text": "Divide the smoked salmon between 4 plates. Toss the fennel, red onion, lime juice, white wine vinegar, olive oil and a little black pepper. Arrange over the salmon and serve."}
{"text": "Put the grated apple and any juices, sugar, and orange and lemon zests and juices into a large saucepan. Bring gently to a simmer, stirring until the sugar has melted. Turn off the heat and stir in the spices, dried fruit and brandy. Set aside until cool.\nOnce cool, stir in the almonds and suet. Divide between sterilised jars or plastic containers for the freezer. \n."}
{"text": "Heat oven to 220C/200C fan/gas 7. Put 1 tsp oil in each well of a 12-hole muffin tin and heat in the oven for 6 mins. Meanwhile, tip the flour and some seasoning into a large, wide jug or a bowl. Beat the eggs with the milk and mustard, then gradually beat into the flour mixture until it makes a smooth batter.\nPour or ladle the batter into the tin, taking care that it doesn’t splatter up and burn you. Bake for 25-30 mins until well risen and golden – try to keep the door closed, as this will help you get a good rise on the Yorkies."}
{"text": "First, put the noodles in a large heatproof bowl, cover in boiling water and leave for 10 mins. Drain and rinse with cold water, then set aside. In a bowl, mix the soy sauce or tamari, tamarind or lime juice and sugar.  \nHeat the oil in a large frying pan or \n. Fry the garlic, spring onions, chilli and the cooked or leftover sprouts for around 2 mins (to cook the sprouts from raw, boil for 8-10 mins until tender). Then, add the noodles and beansprouts and fry for 1 min more. Pour over the sauce and toss well, working quickly to coat all the vegetables and noodles. Once everything is heated through, season and divide between four bowls. Scatter with the nuts and serve with lime wedges to squeeze over."}
{"text": "Slice the courgettes in a food processor, using the fine disc, and pat dry on a clean tea towel. Toss the slices in a plastic bag with the flour, well seasoned. Heat the olive oil in a large frying pan with the rosemary, discarding the herb when the oli is hot, and add 1⁄4 of the courgettes. Fry the courgettes in batches on medium high heat for 2-3 minutes until light golden. Drain on kitchen paper, serve hot."}
{"text": "Put your ready-to-roll icing block in a large bowl and pour over boiling water to cover. After 10-15 mins the icing should be soft. Pour off water, and mix icing in bowl, adding a dribble more hot water until you get a smooth, runny but thickish icing. Divide evenly in 3 and add a little blue colouring to one third, and a little blue and green colouring to another third.\nSlice a 20cm square, or a 30 x 20cm traybake cake into roughly equal, portion-sized squares, and sit them on a wire rack above a large tray.\nSpoon some icing over each cake to cover, then decorate with sprinkles, sugared almonds, mini marshmallows and small gingerbread men."}
{"text": "Heat oven to 200C/180C fan/gas 6. Wet your hands, push a piece of mozzarella into the centre of each meatball, then re-form the meat into a ball. Place on a baking tray and cook for 15-20 mins until they’re browned and cooked through.\nMeanwhile, tip the sauce into a pan. Gently heat, letting it bubble and reduce a little. Once the meatballs are cooked, pop a mini skewer in each one and serve with the sauce to dip."}
{"text": "In a wide, shallow bowl, whisk the eggs, milk, cinnamon and clementine zest. Add the sliced panettone to the mixture and leave to soak for 5 mins, turning occasionally until all the liquid has been absorbed (alternatively you can wrap the bowl in cling film and chill overnight.)\nScatter the almonds over a plate and carefully dunk in the soaked panettone, pressing to help the almond flakes stick, then turn and stick more to the other side. Heat the butter and oil in a large frying pan (you may need to use two pans if the pieces are quite large.)\nWhen the butter is bubbling, add the panettone and cook over a medium heat for 3-4 mins each side until golden. Serve with pomegranate seeds, clementine slices, and maple syrup and yogurt, if you like."}
{"text": "Mix all the ingredients together in a bowl, then carefully transfer to a pepper mill or an airtight jar. Simply grind over your favourite meat before cooking, or over veg before roasting, for extra flavour."}
{"text": "Mix all the ingredients together in a bowl. Give them a good stir and season generously with salt and pepper.\nPour into a sterilized jar and refrigerate. Leave for 2 – 3 days, shaking once a day, before eating. Keep for up to a week more."}
{"text": "Stud the whole clementine with the cloves and set aside.\nMix the remaining ingredients in a big saucepan or flameproof casserole. Cover and cook for 30 mins, then snuggle in the studded clementine, cover again and cook for 30 mins more until the cabbage is tender. Season and eat hot or at room temperature."}
{"text": "Whisk the cream, chestnut purée, sugar, Grand Marnier and cinnamon together until it forms soft peaks. Fold through the yogurt and spoon into a serving dish. Chill until ready to serve with the friands (see 'Goes well with')."}
{"text": "Heat sultanas and alcohol together until just simmering, then turn off the heat and cool completely. Spoon into a small jar and seal. Put the jar on top of the cheese and tie together with string or ribbon.\nKeep in the fridge for up to a week until you are ready to give them away, then add a label with these instructions: ‘Heat oven to 200C/fan 180C/gas 6. Unwrap the camembert, take off the wax wrapper and any other packaging. Put it back in the box but leave the lid off. Cook for 10 mins or until the centre of the cheese feels very soft. Cut a slashed cross in the centre of the cheese then tip in and over as many of the sultanas as you like. Serve with chunks of crusty bread.’"}
{"text": "To prepare the lobster, separate the claws from the tail. Crack the claws with a rolling pin and pick out the meat. Remove the shell from the lobster tail, cut the tail in half and discard the intestine. Break off the legs then roll a rolling pin over them to push out any meat. Cut all the meat into bite-sized pieces, cover and put in the fridge.\nPut a small saucepan of salted water on to boil. Add the potatoes and simmer for 15 mins until cooked but not broken up. Lift the potatoes out of the water and leave to one side to cool. Add the green beans to the hot water and boil for 3 mins until just cooked. Drain the beans and run under cold water. Put the cooled potatoes and beans in the fridge to chill.\nTo make the basil dressing, blitz the pine nuts, most of the basil (saving a few leaves to finish), the garlic and red wine vinegar in a small food processor. With the motor running, slowly drizzle in the olive oil. The dressing should be fairly smooth but still have some texture. Season and set aside.\nWhen you are ready to serve, cut the potatoes into 1cm-thick slices, put in a bowl and mix with half the dressing. Arrange the radicchio and green beans on two serving plates, top with the potato slices and finally the chilled lobster. Drizzle over the rest of the dressing, top with the reserved basil leaves and serve."}
{"text": " Split 6 scones. Sandwich them together with a 227g tub of clotted cream and ½ a jar of strawberry jam. Cut into quarters and serve like triangular sandwiches, pointy-side up (makes 24).\n Use a melon baller to scoop 25 small balls of vanilla ice cream from a 500g tub. Freeze on a tray for 1 hr until solid. Melt 200g dark chocolate and spread 100g finely chopped pistachios on a tray. Dip the balls in the chocolate using a cocktail stick, then roll in the nuts and freeze for 30 mins or until serving (makes 25).\n Buy 2 x 350g Madeira sponge cakes. Trim, then cut into 20 x 3cm cubes. Freeze until solid. Heat 200ml double cream, then remove from heat and stir in 200g chopped white chocolate until melted. Cool a little. Spread 2 cups of desiccated coconut on a tray. Dip each frozen cake completely into the chocolate, then roll in the coconut to coat all sides (it might help to hold each cake on a skewer). Firm up on baking parchment for at least 30 mins before serving (makes 20).\n Thinly roll out a 375g pack puff pastry. Divide into squares (roughly 20 x 5cm), then prick each all over with a fork. Spread onto baking sheets. Peel, core and slice 2 Bramley apples into 2cm pieces. Place a small slice of marzipan on each square (you’ll need about 200g), top with some apple and bake at 200C/180C fan/gas 6 for 10 mins until crisp. Dust with icing sugar to serve (makes 20).\n Use a 4cm pastry cutter to cut out 20 circles from bought lemon tarts (you’ll need 2 large tarts). Top each with a raspberry and dust with icing sugar."}
{"text": "Tip the dates into a bowl with the raisins, cover with 200ml hot water from the kettle and set aside. Meanwhile, grease a 1.5 litre pudding basin and line the base with a disk of parchment paper. Put the dry ingredients and orange zest in a large bowl. Stir in the dates and raisins (and soaking liquid), the rose and orange water, with the eggs and butter. Mix until everything is combined. Tip into the basin and cover with a circle of parchment paper, then foil, then tie the rim with string.\nPlace the pudding on an upturned jar lid in a large pan and pour in hot water from the kettle until it comes halfway up the bowl. Cover the pan and gently steam for 4 hrs, topping up with more water if needed. The pudding can be eaten straight away, chilled and kept for up to a week, or frozen for 1 month. To reheat, defrost completely or remove from the fridge and steam pud again for 30 mins until piping hot.\nTo make the butter, whisk the ingredients together. Serve the pudding in wedges with a spoonful of the butter melting over it."}
{"text": " ADULTS the rest is for you. \n Get your children to weigh out the mincemeat in a bowl and mix in the chocolate chips (if a few get eaten, not to worry, it is Christmas!). Set aside.\n To make the pastry, tip the butter, flour and spice into a bowl. Get them to rub it together until combined to the texture of breadcrumbs. Add the sugar and squidge together to make a dough – don’t be tempted to add any liquid. Tip the dough onto a floured surface and knead.\n Heat oven to 200C/180C fan/gas 6. Halve the dough (discuss with your child how half makes two, etc), and get them to roll half into 12 balls – another counting opportunity. Get them to gently press the balls into the holes of the tin so that they come up the sides with a little overlap.\n Spoon the filling into the pies – try to be as neat as you can, as you don’t want to get any on the sides.\n Make 12 more balls (again counting) and pat them out flat (cue the Pat-a-cake song), so that they are large enough to cover the pies. Top and press the edges together. You don’t need to worry about sealing them or being too neat.\n Brush the tops of the pies with egg. Put the tray in the oven and bake for 20 mins or until golden brown. Remove from the oven and leave to cool slightly.\n If you want neat-looking pies, you can use a 7cm round cutter to trim the edges. This is easiest done while the pies are still warm.\n For some extra learning fun, you can now dust the work surface with icing sugar, press some marzipan out flat and use letter cutters to create letters of your choice. Brush the letters with a drop of water and gently press them onto the pies.\nLeave to cool a bit more, then gently slip the pies out of the tin. Put some icing sugar in a fine sieve and give the pies a snowy dusting. Eat straight away, give to neighbours and friends, or keep in an airtight container for up to 3 days."}
{"text": "First collect 8 glasses to serve your mousses in, and put to one side. Put the coconut and granulated sugar in a bowl and, using a hand blender, whizz together until finely chopped. In another bowl, froth the egg white using a fork. Dip each glass rim into the egg, shake off any excess, then dip into the coconut mixture. Leave to set and dry.\nTo make the mousse, cut all the flesh from the mangoes. Put the fruit into a blender or food processor with the pulp from the passion fruit and lime juice. Blend to a smooth purée, then set a sieve over a large bowl and sieve to remove any passion fruit seeds. Put the gelatine leaves in a bowl of cold water to soften.\nHeat the cream in a small saucepan until it’s just about to start bubbling. Turn off the heat. Squeeze out the softened gelatine leaves to remove excess water, then stir into the cream. When they have completely melted and no gelatine streaks remain, stir this into the mango mixture.\nBeat the egg whites until stiff. Add the sugar and beat to a thick, shiny meringue mixture. Fold a little of the mango mixture into the meringue with a big metal spoon or spatula. Gently fold in the rest (you’re trying to get rid of all the meringue streaks, while retaining as much air in the mousse as possible . Ladle into a jug and divide between the glasses. Chill overnight to set.\nTo serve, beat the egg whites until stiff. Add the sugar and beat to a shiny, thick meringue, then beat in the Malibu. Spoon into a piping bag (or food bag with the corner snipped off) and pipe a blob onto each mousse. To save time, do this 1 hr ahead and pop them back into the fridge."}
{"text": "Heat oven to 180C/160C fan/gas 4. Arrange 6 mini loaf cases (8 x 4 x 4cm) on a baking tray. In a large bowl, mix the sugar, flour, cocoa, bicarbonate of soda, spices, orange zest and ¼ tsp salt. In a jug, whisk the eggs, oil, milk and carrots. Pour the wet ingredients into the dry and mix thoroughly. Divide the mixture between the cases and bake for 30 mins until risen and cooked through. Transfer to a wire rack to cool.\nWhile the cakes are cooking, make the carrot decorations. Mix the orange food colouring into the fondant icing until evenly coloured, then divide into 6 pieces. Roll each piece into a cyclinder, about 5cm long, then roll one end a little thinner to create a carrot shape. Use a cocktail stick to make indentations along the sides. Set aside, standing them on their fattest end, to firm up for 30 mins. Now make the chocolate icing. Put the butter, cocoa, icing sugar and milk into a saucepan, and bubble for a few mins, stirring with a small whisk until smooth and shiny. Set aside to cool for 20 mins. For the green coconut ‘grass’, tip the coconut into a small bowl, add a little green food colouring and mix until evenly coated.\nTo assemble the cakes, first cut a little hole, about 1cm, into the centre of each to ‘plant’ your carrot later. Stir the icing and spread over the cakes to cover the surface. Push your carrot into the centre, then scatter the green coconut around the edges. Stick a sprig of parsley into the top of each carrot and sprinkle the coconut grass with green edible glitter, if you like. Can be stored in a sealed cake tin for up to 3 days."}
{"text": "Heat oven to 160C/140C fan/ gas 3. Heat the oil in a wide, shallow ovenproof dish (or use a roasting tin that can go on the hob). Mix the pomegranate juice, cinnamon, allspice, lemon juice, honey and red wine vinegar together in a large bowl. Brown the pork for 2-3 mins each side, then add all the other ingredients, season and bring to a simmer. Cover with a lid, or wrap the dish in foil, then transfer to the oven for 1 hr.\nUncover the dish, remove the pork and set aside. Skim off the fat and place the dish on the hob. Reduce the sauce to a sticky glaze before returning the pork to the dish and basting. Increase the temperature to 180C/160C fan/gas 4 and return the dish to the oven. Continue cooking for another 45-50 mins until the pork is really tender. Scatter with the pomegranate seeds and serve with green veg or a fresh grain salad, if you like."}
