{"text": "Heat oven to 180C/160C fan/gas 4. Grease then line a 23 x 32cm shallow baking tray. Using electric hand beaters, whisk the egg whites, lemon juice and a pinch of salt until stiff but not dry.\nAdd 1 tbsp of the caster sugar, then whisk until the mixture thickens again to make stiff peaks. Repeat with the rest of the sugar, spoon by spoon, until the mix resembles thick shiny shaving foam. Spread the mixture into the tin, scatter with almonds, then bake for 15 mins or until risen, firm and golden. Cool completely. (It will deflate.)\nSimmer the cranberries in the pomegranate juice for 10 mins until tender. Add the sugar and cinnamon, and simmer for 5 mins or until syrupy. Taste and add more sugar if you need to. Stir in the arrowroot until the juices thicken, then leave to cool.\nTo assemble, sift plenty of icing sugar over a large piece of parchment, then carefully flip the meringue onto it. Remove the tin and the baking parchment. With a short end facing you, score a line 2cm into meringue. Whip all the cream ingredients until thick but not stiff, then spread over the meringue. Spoon over about 1/3 of the cranberry sauce. Roll up the roulade, starting with the scored short end and using the paper underneath to help. Carefully lift onto a serving plate and serve with the remaining saucy cranberries."}
{"text": "Heat oven to 200C/180C fan/gas 6. Cut the top off the pumpkin or squash and use a metal spoon to scoop out the seeds. Get rid of any pithy bits but keep the seeds for another time (see our \n). Put the pumpkin on a baking tray, rub with 2 tbsp of the oil inside and out, and season well. Roast in the centre of the oven for 45 mins or until tender, with the ‘lid’ on the side.\nMeanwhile, rinse the wild rice well and cook following pack instructions, then spread out on a baking tray to cool. Thinly slice the fennel bulb and apple, then squeeze over ½ the lemon juice to stop them discolouring.\nHeat the remaining 2 tbsp oil in a frying pan. Fry the fennel seeds and chilli flakes, then, once the seeds begin to pop, stir in ½ the garlic and the fennel. Cook for 5 mins until softened, then mix through the apple, pecans and lemon zest. Remove from the heat. Add the mixture to the the cooked rice, then stir in the chopped parsley and taste for seasoning.\nPack the mixture into the cooked pumpkin and return to the oven for 10-15 mins until everything is piping hot. Meanwhile, \n the remaining lemon juice with the tahini, the rest of the garlic and enough water to make a dressing. Serve the pumpkin in the middle of the table, topped with pomegranate seeds and the dressing."}
{"text": "Boil the carrots for 20 mins until tender, then drain and return to the pan. Mash with the butter, Pernod and plenty of seasoning until fairly smooth and most of the moisture has evaporated. Tip in a bowl and cover. This will keep in the fridge for 2 days. On the day, heat in the microwave on High for 7 mins, or in the oven for 20 mins, until piping hot."}
{"text": "Heat oven to 220C/200C fan/gas 7. Cut the sausages in pairs (so you have 2 sausages still connected by skin). Unwrap the twist between each pair and squeeze into one long, uniform sausage. Place a rasher of pancetta along the length of a sausage, stretching it a little to reach. Roll up the sausage in a pinwheel and secure with a rosemary skewer. Repeat with remaining sausages, pancetta and skewers. Put pinwheels on a greased baking tray and cook for 30 mins until golden."}
{"text": "Heat oven to 160C/140C fan/gas 3. Grease two 20cm round cake tins and line with baking parchment. Heavily grease a 16cm hemisphere cake tin and stand on a ramekin on a baking sheet to hold it steady.\nFirst, make the sponges. Using electric beaters or a tabletop mixer, beat the butter and sugar together until pale and fluffy. Pour the eggs in, one at a time, giving the mix a thorough beating before adding the next. If the mix starts to look curdled, add 2 tbsp of the plain flour. Beat in the yogurt.\nMix both the flours together, adding ½ tsp salt, and slowly beat into the batter, followed by the malt extract (or vanilla paste) and milk. Spoon half the mixture into one of the 20cm tins, and split the remaining half between the other 20cm tin and the 16cm hemisphere. Bake the smaller amount of cake batter in the 20cm tin and the 16cm tin for 1 hr, and the larger amount for 1 hr 20 mins or until a skewer comes out clean when inserted into the middle of the cakes. Cool in the tin for 10 mins before turning out onto a wire rack to cool completely. \nMeanwhile, make the buttercream by beating all the butter and half the icing sugar together using an electric whisk or tabletop mixer. Add the rest of the icing sugar once incorporated, followed by the malt extract (or vanilla paste) and milk. Set aside until ready to use.\nTo assemble, halve the largest 20cm cake horizontally so you are left with two equal-sized sponges the same size as the remaining 20cm cake. Put a blob of buttercream onto a 23cm cake board (or cake stand) and spread using a palette knife. Stick one of the sponges to the board. Spread a thick layer of buttercream on top of the cake and sandwich another sponge on top. Spread over another thick layer and sit the final sponge on top. Using a palette knife, coat the entire cake in a thin layer of buttercream and smooth the sides and top carefully, working around the whole cake, scraping off any excess icing. Chill in the freezer for 10 mins or in the fridge for 1 hr until set.\nMeanwhile, put the hemisphere sponge on the smaller cake board and halve horizontally. Fill the middle with some buttercream, sandwich with the top and coat the entire cake in a thin layer of buttercream. Chill in the freezer for 5 mins or in the fridge for 30 mins.\nTake the larger cake out of the fridge/ freezer and coat in another layer of buttercream. Take care when covering this time, as you want a smooth finish to the cake. Running the palette knife under hot water helps smooth over the sides once it is coated completely. Chill again for 5 mins in the freezer.\nCover the hemisphere sponge with buttercream and smooth over with the palette knife. Carefully lift the hemisphere onto the centre of the cake (as the sponge has been frozen you shouldn’t leave finger marks). Press down lightly to set on the buttercream. If there is a gap around the rim, use a small palette knife to fill in with any remaining buttercream. Chill for 10-15 mins.\nMeanwhile, make the eyes and nose using coloured fondant. Roll the black fondant into two balls for the eyes, and five smaller balls for the mouth. Roll the orange fondant into a carrot shape. Leave to set and harden slightly while you make the drippy ganache.\nMake the drippy ganache by mixing the chocolate and oil and microwaving for 30 secs, stirring and then giving it another 30 secs until melted. Transfer to a squeezy bottle, then pour down the edges of the round cake to create the melting snow effect.\nTo finish the cake, stick the eyes to the head using a little remaining buttercream. Poke the wooden dowel into the carrot nose, leaving some poking out to stick it to the face. Stick the five small black fondant balls for the mouth and the chocolate buttons down the front of the cake for buttons. Insert the Mikado sticks on either side for the arms. Bring the cake to room temperature before serving."}
{"text": "Using a peeler, pare thin strips of zest from the orange and lemon. Squeeze the juice. Put the zests and juice into a large saucepan, then add the Port and remaining ingredients. Simmer very gently for 20 mins, then leave to cool completely. Can be made up to 1 week ahead and chilled. To serve, 'frost' the glasses if desired (see 'Tip', below left), put ice and slices of orange and lemon in each glass, then carefully pour in equal quantities of the Port and lemonade."}
{"text": "Butter a 30 x 20 x 2.5cm tray tin. Mix the mincemeat and grated apple. Unroll the pastry sheets. Lift one sheet into the tin so that the pastry lines it and the excess hangs over the sides. Spread the mincemeat mix over evenly.\nLeave the other sheet on its wrapping, but lightly mark the size of the tin onto it. Stamp out stars, spaced apart – don’t go outside the markings. Carefully invert on top of the mincemeat, pastry side down, and peel off the wrapping. Press the edges together around the edge of the tin, trim the excess, then randomly place the cut-out stars over the pastry. \n.\nChill for 20 mins. Meanwhile, heat oven to 200C/180C fan/gas 6 with a large baking sheet inside it. Dredge the pastry with sugar and bake on the hot baking sheet for 30 mins until golden. Remove and dredge with more sugar."}
{"text": "Heat oven to 200C/180C fan/gas 6. Mix the butter with 50g of the sugar and the vanilla. Mix the flour, ground rice and ½ tsp cinnamon, then mix this into the butter mixture – you may need to finish with your hands. Roll out to just under 1cm thick between 2 sheets of baking parchment, then lift the bottom sheet of baking parchment onto a baking tray. Bake for 10-15 mins until golden and crisp looking.\nMeanwhile, mix the remaining sugar with the remaining cinnamon. Remove the shortbread and leave to firm up for 1-2 mins, then slice into long shard shapes with a knife. Discard trimmings (or nibble them!), and scatter the biscuits with the cinnamon sugar while still warm. Gently toss to coat, then set aside until cool. Cover until ready to serve."}
{"text": "Dry-fry the lardons until crisp in a non-stick frying pan, then lift out with a slotted spoon and tip in the onions. Gently cook for 15-20 mins until really soft. Tip into a bowl with the lardons, herbs, breadcrumbs, zests, mace, eggs and plenty of seasoning, then mix well.\nSet aside about 450g of the stuffing for your turkey, then roll the rest to the size of golf balls. When the turkey comes out of the oven, roll the stuffing balls in the oil in a small roasting tin, then roast underneath the veg at 220C/200C fan/ gas 7, for 20 mins until golden and crisp."}
{"text": "Chop the leafy tops of the thyme but not the hard, woody branch ends (save these for the cavity). Finely grate the orange and lemon zest into a small bowl and mix with the chopped thyme, olive oil and seasoning. Mash the mix into the oil with the back of a metal spoon (or use a pestle and mortar) to release its flavour. Set aside to infuse.\nPreheat the oven to fan 170C/conventional 190C/gas 5. Wash the turkey inside and out and dry well with kitchen paper. To make carving easier, you can now cut out the wishbone, but it’s not essential.\nPut the reserved third of the stuffing in the neck end of the turkey and push it towards the breast. Don’t overfill, as the stuffing will expand during cooking. Secure the neck end flap with a small metal skewer. Weigh the stuffed turkey and calculate the cooking time – allow 18 minutes per 450g/1lb.\nSeason the turkey generously with salt and pepper inside and out. Halve the orange and lemon and put in the cavity (squeezing the fruit as it goes in) with the thyme branches and two of the bay leaves. Tie the turkey legs together to give the bird a good shape.\nThrow the chopped carrots and onion and remaining bay leaves into a large roasting tin. Sit the turkey on top of the vegetables, smear the butter over the skin and cover with a loose tent of foil. Roast the turkey for the calculated time, basting with the pan juices every hour.\nMeanwhile, tip the red onions and squash into a shallow roasting tray and toss in half of the thyme oil, making sure you get it right into the cuts in the onions. Set the tray aside.\nHalf an hour before the end of the turkey’s cooking time, whip off the foil and leave the bird to brown. After 15 minutes, drizzle the turkey with the remaining thyme oil.\nTo test if the turkey is cooked, insert a skewer into the thickest part of a thigh – the juices should run clear. If they are still pink, cook for a further 20-30 minutes and test again. Remove the turkey from the oven and turn the oven up to fan 180C/conventional 200C/gas 6. Transfer theturkey to a serving platter, cover tightly with foil and leave to rest while you finish off the vegetables and trimmings.\nPut the red onions and squash in the oven and roast for 30-40 minutes. At the same time, roast the bacon-wrapped sausages (see Lightly spiced Christmas stuffing, right) for 30 minutes. Now make the gravy. Discard any fat from the roasting tin. Stir the wine and redcurrant jelly into the carrots and onion in the tin. Bring to the boil and boil rapidly for 8-10 minutes to reduce by half. Scrape the sticky bits off the bottom of the tin with a wooden spoon as the gravy boils. Pour in the stock and simmer for 10 minutes until you have a dark, tasty gravy, adding salt and pepper to taste. Strain the gravy into a pan (discard the vegetables), bring back to the boil and serve in a warm jug."}
{"text": "To make the cake, soak the apricots in the brandy while you get everything prepared. Heat oven to 160C/fan 140C/gas 3. Butter then line the sides and base of a deep 20cm round cake tin with greaseproof paper. Mix together the figs, raisins, cherries, nuts and lemon zest.\nCombine the flour with the baking powder, mixed spice and ground almonds. Beat the butter and sugar in a large bowl until creamy, about 2 mins. Add the eggs one at a time, beating well after each addition. Gently fold the flour mixture into the cake mixture in two goes, then fold in the fruits and nuts, followed by the apricots and brandy.\nSpoon the mixture into the tin, then smooth the top, making a slight dip in the middle. Bake for 30 mins, then lower the temperature to 150C/fan 130C/gas 2 and bake for another 1 hr 45 mins, laying a sheet of foil loosely over the top for the final 15 mins if it starts to brown too quickly. The cake is done when a skewer inserted in the centre comes out clean. Leave the cake in the tin to cool, then remove the lining paper and wrap well in cling film and foil until ready to decorate (see below or turn the page for another idea).\nTo create the frosty forest cake: colour the marzipan pale green with a little of the food colouring. Cut off 250g, then make this a shade darker with more food colouring for the trees. To make the trees, roll out the darker green marzipan on a surface lightly dusted with icing sugar. Make pointed triangular cardboard tree templates in 3 different sizes (roughly 7.5 x 4cm/6.5 x 3.5cm/5.5 x 3cm). Using these as guides, cut out the tree shapes (see tip, above right). Brush one side lightly with honey, then scatter over silver and coloured dragees, pressing them down lightly to stick. Lay the trees on baking parchment to firm up. This is best done a day or two ahead.\nWhen ready to decorate, sit the cake on a board or plate. On a surface lightly dusted with icing sugar, roll the paler green marzipan into a circle wide enough to cover the cake completely. Brush the cake all over with honey. Using a rolling pin, lift and lower the marzipan onto the cake. Smooth the surface of the marzipan with your palms, then trim off any excess from the bottom with a sharp knife.\nCut off two-thirds of the ready-to-roll icing, then roll out a strip about 8cm wide and long enough to go over the top and down the sides of the cake. Cut a wavy line down either side to resemble a path. Brush the marzipan with honey where you want the path to go, then lay the path on top. Trim to neaten the ends.\nTake two-thirds of the remaining icing, then roll out 2 long, narrow ropes the same length as the path and about 5mm wide. Dampen the path edges with water and lay the ropes in position. Cut off and roll small pieces from the rest of the icing (and any trimmings), then shape into small snow drifts for the trees to stand in. When the trees are firm, make an indent in the top of each snowdrift with the back of a knife and put each tree into position. Sit the trees on the cake, securing with a little honey underneath. If necessary, cut off some of the rope along the edge of the path to make a flatter surface for the trees. Finally, scatter edible glitter onto the marzipanned cake."}
{"text": "Preheat the oven to 180C/ gas 4/fan 160C and grease 2 large baking sheets. Roll out the dough to a thickness of about 5mm/¼in and cut out star biscuits using a 10cm cutter. Re-roll the trimmings make more biscuits.\nWith a skewer, make a small hole 1cm/½in from a point on each star - this is for hanging the biscuits. Bake for 18-20 minutes until turning pale golden around the edges, then transfer to a wire rack to cool. (If the holes have filled in during baking, re-make them with the skewer while the biscuits are still hot.)\nPut the egg white and lemon juice in a bowl and beat in the icing sugar to make a smooth icing. Using a small palette knife, spread it generously over the biscuits to about 5mm/¼in from the edges.\nMix the fruits, then scatter them in the middle of the icing with some silver balls. Leave for at least 2 hours to set. Thread with ribbon just before you hang them and eat within 24 hours. They will keep fresh for up to 1 week stored in an airtight tin."}
{"text": "Heat oven to 200C/180C fan/gas 6. Tip the onion, squash and chestnuts into a roasting tin with the oil, chopped sage and seasoning, then toss well with your hands. Roast for 20 mins or until the edges of the squash start to tinge brown. If your oven is full, you can simply fry the lot together in a large frying pan.\nAdd the rice and stir to coat it, then tip the lot into a saucepan. Add the stock and stir well. Bring to a simmer and cook for 20-25 mins or until the rice is tender and the stock absorbed. Add cheese, if using, and tip into a baking dish. \n To finish, heat grill to high, then cook until the top is browned and crisp and the stuffing is hot through."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease a 20cm square tin with a little butter and line the base with baking parchment. To make the white (un-dyed) sponge, put 175g of the butter, 175g of the sugar, 175g of the flour, 3 eggs, the vanilla extract and a pinch of salt in a big mixing bowl. Beat with an electric whisk until smooth and not streaky.\nSpoon into the tin and spread right into the corners. Bake for 25-30 mins – when you poke a skewer into the middle it should come out clean. Cool in the tin for 10 mins, then transfer to a wire rack to finish cooling. Wash the tin so it’s ready to use again.\nNow make the red sponge. Grease and line the tin as in step 1. Mix the same ingredients in a big bowl, but use the peppermint extract instead of the vanilla. When the mixture is smooth and not streaky, squeeze in a little red food colouring and whisk in, adding more until you get a strong red colour.\nRepeat step 2. Once cooked, cool the red sponge in the tin for 10 mins before placing on a wire rack to finish cooling.\nTo make the buttercream, beat all the ingredients and a pinch of salt with an electric whisk until completely smooth.\nKnead 1 tsp of the peppermint extract into each of the fondant icings, keeping them separate.\nUsing a long knife (adults might want to help) or a ruler, cut off the crusts of each sponge (sides only, not the top and bottom). Now cut each sponge into 4 long fingers.\nUse a sieve to dust a clean work surface with a little icing sugar. Roll out one block of your peppermint icing to a big rectangle – it needs to be 22cm wide and 45cm long. Turn the icing so one of the short sides is nearest to you.\nBrush the top of a white and red sponge finger with a thin layer of buttercream. Using the buttercream as a glue, stick the white sponge finger along the edge of the icing nearest to you. Now trim the icing along the near edge of the sponge so it’s neat. Brush some buttercream on top of the white sponge and on the side furthest away from you. Stick the red sponge finger next to this far side of the white finger, so there is no gap between the two. Brush the top of the red sponge with more buttercream.\nSit a second red sponge finger on top of the white sponge you’ve already stuck to the icing. Now stick another white sponge on top of your first red one – again spreading buttercream in between the second layer of sponges to stick. Brush buttercream over any cake you can still see. Now roll over your cake, as if you’re wrapping a present in paper, to surround it in the icing. When the sponge is covered, you should have an edge where the two icing ends meet – trim off any extra icing.\nUse a knife to trim the ends to make it neat. Put one candy cane in a plastic sandwich bag and use a rolling pin to break it into little bits on a chopping board. Sprinkle over your cake to decorate.\nTo make your second cake, repeat the recipe from step 8. Cakes will keep in an airtight container for 2 days."}
{"text": "Put the mayo, most of the capers, 1 whole anchovy, the tuna and most of the lemon juice into a food processor. Whizz until the tuna is completely mixed into the mayo. Season with pepper first, then taste, and add salt and more lemon juice, if you need to. If your sauce seems a bit thick, whizz in a drop of water. Can be made up to a day ahead.\nSpread the turkey and rocket over a large serving plate, then spoon over the dressing and scatter with the remaining capers and sliced anchovy. Serve straight away with crusty bread."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Oil a non-stick 12-hole bun tin and line holes with two strips baking parchment, to form a cross. Put the mushrooms in a bowl and pour over hot vegetable stock. Leave for 20 mins, then strain, reserve the stock and chop the mushrooms, if large.\nHeat oil in a pan, add onion and fry for 5 mins until softened. Add the pine nuts and fry until lightly toasted. Add the garlic, rice and cook for 2 mins.\nTip in wine, let it bubble, then add the reserved stock, mushrooms and bring to the boil. Reduce heat, cover and simmer for 10 mins, until the rice is just cooked. Remove from heat and cool, then stir in the egg, basil, pepper, and salt, if using.\nFill the tins with stuffing, sprinkle over parmesan. Bake for 20-25 mins, until golden on top. Cool in the tins, or for 5 mins if serving straight away. Remove by pulling up the parchment crosses. Make up to two days ahead. Reheat on an oiled baking sheet, at 200C/fan 180C/gas 6 for 10 mins."}
{"text": "For the meringue, heat oven to 140C/fan 120C/gas 1. Line the base of a loose-bottom 20cm square tin. Tip 25g of the walnuts into a food processor and blitz until ground as finely as possible, add the rest of the walnuts, then pulse to chop roughly. Tip the egg whites into a clean bowl, whisk until peaks have formed, then gradually add the sugar a third at a time, beating between each addition until stiff. Fold in the walnuts. Tip the meringue into the tin, then spread over the base. Bake for 2 hrs until crisp, then leave to cool. This can be done 1 day in advance and covered in cling film.\nWhile the meringue is cooking, make the sweetened purée by mixing the chestnut purée with the sugar until smooth. This can be done 1 day in advance and covered in cling film. Put a couple of large bowls to chill in the fridge.\nTo assemble, leave the ice cream to soften slightly so it’s pliable, but not melted. Working quickly, in one of the bowls mix half of the ice cream with half of the purée to make chestnut ice cream. If it’s too soft once you have mixed it, place the bowl in the freezer to firm up. Once all the ice cream is the same consistency, quickly ripple the vanilla and chestnut ice creams and half the remaining purée together. Spread over the meringue and smooth the top, then place in the freezer until frozen solid. This can be done 1 month in advance and frozen, covered in cling film. You can also freeze the rest of the purée.\nTo serve, defrost the purée, remove the cake from the freezer, then place in the fridge for 40 mins. Meanwhile, make a thin piping bag from greaseproof paper and whip the cream until stiff. Mix in the rest of the purée, continue to beat until it becomes stiff again, then tip the cream into the piping bag. Using a large knife dipped into hot water, cut the cake into 9 squares. Working quickly, pipe a ‘crazy-string’ nest of chestnut cream in the centre of each square. Top the cream with half a marron glacé or candied chestnut and serve straight away."}
{"text": "Put all of the ingredients into a small saucepan. Cover and simmer for 15 mins, then whizz to a smooth or chunky sauce – whichever is your favourite. Top with extra bay leaves or more nutmeg to serve. Can be made 3-4 hrs ahead, then reheated in a microwave to serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. Heat the oil in a large frying pan, then soften the onions for 10 mins with the pan covered. Turn up the heat, add the mushrooms and fry for about 10 mins until golden and all their liquid has evaporated. Stir in the garlic and cook for 1 min more. Tip everything onto a plate.\nPat the livers dry, then add a little more oil to the pan. Sizzle in batches for about 20 secs on each side until just golden but not cooked through. Set aside on a plate as you go. Tip in the brandy and let it reduce to 1 tbsp. Roughly chop the livers once cooled, then mix with the oniony mushrooms, brandy, bread and almost all the parsley and nuts.\nTo cook, wind bacon rashers into the wells of a 12-hole bun tin, like little nests. Spoon in the stuffing (reserving 250g for your turkey), scatter with remaining nuts, then bake, covered with foil, for 20 mins. Uncover and cook for 25 mins more until the bacon is gold. Scatter with remaining chopped parsley to serve."}
{"text": "First make the gravy – you can do this several days ahead. Heat the oil in a non- stick pan and fry the onion and carrot with the bay leaf for 10 mins, stirring frequently, until softened and golden. Meanwhile, blend the flour with 300ml cold water to make a smooth paste.\nRemove the bay leaf from the pan and pour in the stock, closely followed by the flour mixture, stirring all the time until thickened. Leave to bubble for 5-10 mins, stirring frequently, then blitz with a hand blender until completely smooth. Pour into a bowl and cover the surface of the gravy with cling film or baking parchment to prevent a skin forming as it cools. Chill.\nWeigh the turkey (you may need to use bathroom scales) and calculate the cooking time by allowing 40 mins per kg for a 4.5-6.5kg turkey, then 35 mins for every kg of turkey over that weight. As a guide, a turkey this size should take 3 hrs 20 mins-3 hrs 40 mins, plus 30-45 mins resting time.\nPack the stuffing into the neck end of the turkey, smoothing down the skin and tucking it under the bird for a neat finish. Put the onion and lemon, with some bay leaves, inside the cavity. Spread the butter over the skin that covers the breasts and lay the streaky bacon on top, to cover and protect each breast and seal in the butter. Can be done the night before, but take out of the fridge 1 hr before roasting so that it comes back to room temperature.\nOn the day, heat oven to 180C/160C fan/ gas 4. Lay the turkey on a large sheet of double-thickness foil, long enough to completely cover it, then lift into a roasting tin and season well. Pour the wine inside the cavity, then bring the foil up over the top of the turkey and seal it well. Roast for the calculated cooking time. For the final 40 mins, open the foil and remove the bacon (serve alongside the turkey or save it for a turkey sandwich). Pour off all of the cooking juices and use a little of the buttery oil that rises to the top to baste the bird. Roast until the turkey is golden and the juices that run out of the thigh are clear, with no sign of pink, when pierced with a skewer. (If you are using a digital thermometer, the thigh should be cooked to 80C and the breast to 75C.) Leave to rest on a warm platter, covered with foil and tea towels, for up to 45 mins.\nWhile the turkey is roasting for the final 40 mins, skim the fat from the pan juices and pour into a jug. The amount of juices you get is dependent on the type of turkey that you are cooking, as speciality bronze turkeys will give you less juice than a white turkey – so make up to 600ml with chicken stock if you need to. Tip the gravy base into a pan, gently heat it with a little of the turkey juices to loosen the consistency, then gradually blend in the remainder and cook until bubbling. Season.\nTo serve, carve the turkey in the kitchen and arrange on a hot platter with a little of the hot gravy poured over, or bring the whole bird to the table. Any leftover meat can be frozen in the gravy."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put the flour, cocoa, ground almonds, sugar, chocolate chips, candied peel, orange zest and a pinch of salt into a large bowl, and mix well. Make a well in the centre, then add the nutmeg (if using), egg and vanilla extract. Use your hands to bring the mix together, kneading it firmly.\nShape the biscotti dough into a log approximately 15cm x 5cm x 2.5cm deep. Transfer to a baking tray lined with baking parchment, then bake for 30 mins until firm to the touch (the log will split and crack a little on the top).\nRemove from the oven and cool for at least 10 mins. Use a sharp serrated knife to cut the log into slices 1-1.5cm thick.\nPut the biscotti back on the baking tray and reduce oven to 150C/130C fan/ gas 2. Bake for 30 mins or until the biscotti are completely hard to touch. Cool completely, then wrap in baking parchment or store in an airtight container."}
{"text": "Mix the dried fruit, grated apple or pear, Demerara sugar, marzipan, cloves and cinnamon.\nDivide the pastry into 6. Then assemble tarts one by one. Halve a chunk of pastry and roll out each halve to a circle about the thickness of a 50p piece on a floured surface. Spoon a sixth of the filling into the centre of one circle in a pile. Brush edges with egg, and lift the second pastry circle on top. Gently press down on the fruit to push out as much air as you can. Press the pastry edges to seal. Use an appropriate sized bowl, glass etc to help you trim the edges to a neat circle. At this stage, you can cover and chill the tarts overnight, or freeze for 1 month. Defrost before continuing. Brush with beaten egg, then make three small slashes with a knife in a row. Repeat with remaining pastry and filling.\nPop the tarts in the fridge while you heat oven to 200C/180C fan/gas 6. When the oven is nice and hot, brush tarts all over with egg and sprinkle each with a little more sugar. Bake for 20 - 25 mins, until golden, then eat warm with ice cream or custard."}
{"text": "Splash a little milk into the cornflour until you have a smooth paste. Gradually stir in a little more milk until quite runny, then scrape into a large saucepan. Whisk in the remaining milk, cream, egg, yolks, vanilla and sugar. Put over a low-medium heat and, stirring or whisking constantly, bring just to the boil until thickened. Sieve into a jug and stir in the Cointreau. \n."}
{"text": "Heat oven to 180C/160C fan/gas 4 and put a baking sheet on the middle shelf to heat up. Unroll the pastry, then use to line a 22cm fluted tart tin. Leave about 1cm of pastry overhanging and trim the rest. Line the case with baking parchment (scrunch it up first to make it more pliable) and baking beans. Place on the hot baking sheet and bake for 15 mins, then remove the beans and parchment and return to the oven for another 5 mins or until biscuity brown. Trim the sides of the pastry case with a serrated knife and discard the trimmings.\nPour the cream into a saucepan, scrape out the seeds from the vanilla, add these along with the pod and heat until steaming. Meanwhile, whisk the whole eggs, yolks and sugar in a large bowl until smooth. Pour the Baileys into the cream, then the cream mixture onto the eggs and mix well. Strain the mixture through a sieve and into a jug.\nWith the tart case still on the baking sheet, carefully pour the custard into the tart. Reduce the temperature to 150C/130C fan/ gas 2 and bake for 30 mins until the filling has just set but still has a slight wobble in the middle (the tart will continue to set a little once out of the oven ). Cool to room temperature, then chill in the fridge for at least 2 hrs.\nWhip the remaining cream, sugar and Baileys until it just holds its shape. Pile into the centre of the tart, leaving a border of custard exposed around the edges. Scatter with crumbled honeycomb, if you like, and serve immediately."}
{"text": "Heat oven to 140C/120C fan/gas 1. Put all the ingredients (except the apricots, sultanas and sweets) in a large bowl. Stir everything well, then spread out onto two baking trays in an even layer. Put the tray in the oven for 40 mins.\nLeave the granola to cool on the tray, then break it up into small chunks and stir in the sultanas and apricots.\nPut the granola in a jar ready for breakfast. To make it suitable for magic reindeer, put a few spoonfuls into a small paper bag and mix in some sweets.\nTie with string or a ribbon and add a fun label for Father Christmas to find."}
{"text": "Heat oven to 180C/160 fan/gas 4. In a large saucepan, mix together the creams and the milk, and bring to just under the boil. Add the potatoes and cook gently for 5 mins, carefully turning the potatoes over from time to time.\nSeason well and spoon one-third of the potatoes into a greased deep dish. Put half the gravadlax and dill on top, then add another one-third of the potatoes, then the rest of the gravadlax and dill. Finish with a final layer of potatoes.\nBake for 1 hr 10 mins or until the vegetables are completely tender. You may need to cover the top with foil after 1 hr to stop it becoming too dark. Serve with a green salad with a sharp dressing (the laxpudding will benefit from something clean to contrast with the richness of this dish)."}
{"text": "Heat oven to 200C/180 fan/gas 6. Carefully wrap the pancetta around the cheese pieces (you may not need a full slice of pancetta for each piece of cheese, depending on the size). Can be done two days ahead and kept covered in the fridge.\nPut the rosemary sprigs on a baking tray and place the cheese in blankets on top. Roast in the oven for 15 mins until golden and crispy. Serve immediately but be careful, as they will be molten hot inside."}
{"text": "Mix the marinade ingredients together and marinate the venison for a couple of hours in the fridge. Heat oven to 200C/180C fan/gas 6.\nFor the slaw, put the sprouts in a bowl and pour over the orange juice. Season with salt and drizzle over some rapeseed oil. Using your hands, scrunch the sprouts in the dressing for a few minutes to tenderise them. Grate in the apple, allowing the juice to also dress the sprouts, then toss with the remaining ingredients. Check for seasoning and add more rapeseed oil if you think it needs it. It wants to be perfectly dressed, rather than greasy.\nHeat a little rapeseed oil in a heavy-bottomed skillet or frying pan until smoking hot, then add the venison and cook for 2-3 mins until a caramelised crust has formed on the underside. Flip it over and cook for another couple of mins, making sure it's sealed all over. Place on a baking sheet and put in the oven for 5-6 mins, depending on how rare you like it. Remove from the oven and allow to rest for at least 5 mins, then slice. Spread some crème fraîche and horseradish over each plate and top with then venison. Serve the slaw on the side and scatter over the seeds, if you like."}
{"text": "Melt a knob of butter in a large frying pan, add the pears and 1 tbsp sugar, and cook for 5 mins. Tip into a bowl and leave to cool. Then add the Disaronno (if using), biscuits, cinnamon, chocolate, marzipan, and 2 tbsp sugar and mix well.\nLine a tray with baking parchment. Lay a sheet of filo on it, brush with melted butter and sprinkle with a little sugar. Top with a second sheet of filo and keep going until you’ve used all the pastry. Pile the filling down one of the long sides of the pastry, then roll it up to form a sausage. Make sure it is seam-side down, then tuck the ends under tightly. Roll up in the parchment, wrap tightly in foil and freeze.\nHeat oven to 200C/180C fan/gas 6. Put a tray in the oven to heat. Unwrap the strudel and place, seam-side down and still on its parchment, onto the tray. Brush with melted butter and sprinkle over 1 tbsp sugar. Bake for 35-40 mins, or until golden and crisp. Leave to cool for 10 mins, then dust with icing sugar."}
{"text": "Gently heat the butter, golden caster sugar and cinnamon sticks in a saucepan until the butter has melted and the sugar has dissolved.\nStir in the spiced rum, then pour into four small heatproof glasses to serve."}
{"text": "Heat oven to 160C/140C fan/gas 3. grease a deep 20cm cake tin and line with baking parchment – high enough to come 2.5cm above the top of the tin. Put the raisins, cherries, all the cranberries, orange zest and juice, and alcohol into a small pan. Bring to the boil and leave to simmer for 3 mins, until the cranberries have softened a little and most of the liquid has evaporated. Set aside to cool.\nPut the sugar, butter and vanilla in a bowl and beat with an electric mixer until pale and fluffy. Add the eggs, flour, almonds, hazelnuts and mixed spice. Whisk again until just combined, then stir through the soaked fruit and any remaining juices. Tip the cake mixture into the tin and level the top, then bake for 1 hr 20 mins, until a skewer pushed into the centre of the cake comes out clean. If the skewer has any uncooked cake mixture on it, return it to the oven for 10 mins, then check again. Leave in the tin to cool. "}
{"text": "Put the butter, sugar, condensed milk, caramel and ginger in a pan. Heat gently until the butter melts – make sure you don’t boil the sauce. Remove from the heat, then stir in the whisky until smooth. Pour into sterilised jars and allow to cool before sealing."}
{"text": "Put the sweet potato into a microwave-proof bowl, add 1 tsp water and cook on High for 2 mins. Mash in a large bowl.\nPut the chickpeas and chestnuts into a food processor and pulse until well chopped but not pasty. Tip on top of the sweet potato, then add the egg, spices, garlic and coriander. Season generously and mix well with your hands. Add the cranberries. Shape dessertspoon-sized balls of the mix into 20 or so patties. Can be made ahead and chilled for up to 3 days.\nHeat 2 tbsp oil in a large non-stick frying pan. Fry half of the falafels for 2 mins on each side until golden. Lift onto kitchen paper to drain. Repeat with the second batch. Can be made up to 2 days ahead and reheated. Let the falafel cool for a few mins before serving with the yogurt, plus a scattering of coriander."}
{"text": "Cook the sprouts and beans in a pan of boiling salted water for 3 mins, then drain well. Heat the oil in a large wok or frying pan. When hot, add the lemon zest and pine nuts. Cook for a couple of seconds, then add the vegetables and stir-fry for 3-4 mins until the sprouts colour a little. Add a squeeze of lemon juice and salt and pepper to taste."}
{"text": "Put the icing sugar into a bowl and add cold water a teaspoon at a time until the mixture is runny but thick enough to coat a spoon.\nAsk an adult to snip the marshmallows in half using wetted scissors.\nSpoon a little icing onto each cookie and attach half a marshmallow. Using a little icing, stick the other half on top at an angle. Drizzle a little more icing onto the cookie to make melting snow.\nBreak the pretzel sticks in half and place on the cookie for arms. Stick orange chocolate beans on for the noses. Stick three chocolate beans on each cookie to represent buttons.\nUsing the writing icing, pipe small blobs for the eyes and mouth. Leave to set."}
{"text": "The day before, soak the ham hocks in water overnight in the fridge, to draw out some of the salt (they may have already been soaked by the butcher, so check first).\nThe next day, drain the hocks and pat them dry. Heat oven to 160C/140C fan/gas 3. Mix the allspice, nutmeg and 1/4 tsp freshly ground black pepper together and rub into the hocks. Put them in a deep roasting tin with the clementines, cut-side up . Tuck the star anise and bay around the hocks, and pour in 200ml water. Cover the tin in foil and roast for 3 hrs.\nRemove the tin from the oven and increase the heat to 180C/ 160C fan/gas 4. Unwrap the tin and drain off the liquid. Squeeze the juice from the clementines over the hocks and return the juiced halves to the tin. Mix the Dijon, treacle and sugar in a bowl and paint half the glaze all over the hocks. Return to the oven for 15-20 mins, turning and brushing with the remaining glaze every 5 mins until the hocks are burnished and caramelised in places. Shred or slice the meat and eat warm or cold. "}
{"text": "Tie the small candy canes into groups with ribbon. Put the white caster sugar, liquid glucose and water in a pan. Heat until sugar is just melted and syrup turns clear. Take off heat and whisk the egg whites until stiff, then carry on whisking while steadily pouring in hot syrup in a stream. Keep beating until thick enough to spread, then beat in the sifted icing sugar.\nQuickly spread the icing over an 18-23cm square or round cake (marzipan covered, if you wish), swirling roughly. Stick on the candy canes and leave for 1 hr to set."}
{"text": "Preheat the oven to 180C/gas 4/fan 160C. Grease the base and sides of 2 shallow 28cm x 18cm baking tins and line each with a single sheet of greaseproof paper to come well above the rim of the tin (this makes it easy to lift out). Grease the paper.\nPack half the dough into the base of each tin, pressing it into the corners. Scatter with the whole nuts, making sure they are evenly distributed. Press them deeply into the dough to secure.\nBake for 40 minutes until the nuts and edges of the biscuits are golden. Carefully lift out of the tins, still on the paper, and transfer to a wire rack to cool.\nMelt the plain and milk chocolates in separate bowls set over pans of simmering water. Leaving the slabs of biscuit on the paper, carefully cut each slab widthways into 2cm/¾in slices (don't worry if the nuts seem to be loose - they will be kept in place by the melted chocolate).\nSpread the slices so they are 1-2cm apart and drizzle diagonal lines of melted plain chocolate over them, using a dessert spoon. Then drizzle the milk chocolate over the plain and leave in a cool place to set. Cut each biscuit in half widthways. They will keep fresh for up to a week stored in an airtight tin."}
{"text": "Lay the lamb, skin-side down, on a board – if the joint you bought is tied up, then snip the strings and unroll it. Cut several pieces of string long enough to tie around the lamb, then slide them under the joint so they’re regularly spaced out. Mix the stuffing ingredients together, and season well. Spread the stuffing out along the middle of the lamb, then fold the meat over to form a roll. Tie the string so the roll stays together, but don’t make it too tight or it will cut into the meat. Tie some string lengthways too, if necessary.\nHeat oven to 170C/150C fan/gas 3. Season the lamb evenly all over. Heat a little oil in a large frying pan, then brown the lamb all over. Start with the side where the seam meets, as this will stop the lamb breaking up when you carve it.\nTip the veg, garlic and rosemary into a roasting tin and put the lamb on top, seam-side down. Cook the lamb until the core temperature reaches 60C on a meat thermometer – this should take around 1 hr for a 2kg leg. As you rest the lamb, the temperature will continue to rise so don’t overcook it.\nLift the lamb out of the tin and, keeping it warm, rest for up to an hour. Put the roasting tin on the hob. Add the stock, bring to a simmer, then tip the lot into a saucepan, scraping up any bits. Add 500ml water and then simmer again until reduced by half. Pour through a fine sieve and serve with the lamb."}
{"text": "At least an hour before you want to make the tart, make the pastry. Tip the flour, thyme, butter and ½ tsp salt into a food processor and pulse to the texture of breadcrumbs. Add the egg yolk and milk and pulse again until it all starts to come together. Tip out and press into a ball of pastry. Wrap, then chill for at least 1 hr. Can be prepared up to 2 days ahead.\nOn a lightly floured surface, roll the pastry out and line an 11 x 33cm rectangular, fluted tart tin. (The pastry may break up as you work it, so patch over any broken bits.) Keep any excess trimmings. Chill the tart case in the fridge or freezer for 20 mins.\nWhile the tart case is chilling, tip all the ingredients for the parfait into a clean food processor with a generous pinch of salt and a good grinding of pepper. Blitz until the mix is as smooth as it’s going to get, then push through a sieve into a jug and set aside.\nHeat oven to 200C/fan 180C/gas 6. Line the tart case with greaseproof paper and baking beans, then bake on a baking tray for 15 mins. Remove from the oven and remove the paper and beans. Check for any small holes or cracks in the pastry and patch up with the reserved trimmings. Place back in the oven for 15 mins, until golden. Remove from the oven and lower the oven to 120C/fan 100C/ gas ½. When the oven has cooled suitably, slide the tart case back into it, then fill as far as you can with the parfait mix. Bake the tart for 20 mins until just set. Leave to cool, trim any untidy edges, then remove from tin.\nTo serve, cut the tart into 6 slices. Place on plates, then place small blobs of caramelised onions and a scattering of hazelnuts around the tart. Neatly place a few salad leaves around and drizzle everything with oil and vinegar. Arrange 2 fig quarters on top of each slice and serve."}
{"text": "Boil a large pan of water and add the sprouts. Boil for 8 mins, or until just cooked through but not soggy. Drain, cool, then halve. Can be chilled for up to 24 hrs.\nMelt the fig jam and balsamic vinegar together in a big frying pan or wok. When bubbling, add the sprouts and fry until they start to caramelise. Lower the heat and add the grapes, then cook for a few mins more until the grapes are hot and softening. Add the walnuts and seasoning, then tip into a serving dish. Mix the yogurt and chopped mint, and dollop over the hot sprouts. Garnish with a few extra mint leaves."}
{"text": "Heat the oil in a large frying pan and sizzle the shallots for 5 mins until starting to colour. Sprinkle over the sugar, stir well, then add the raisins and vinegar. Simmer for 5 mins to make a sticky mix, then set aside.\nBring a large pan of salted water to the boil, then tip in the sprouts. Cook for 5 mins, then drain well, add to the shallot pan and toss everything together. Serve scattered with flaked almonds and a sprinkling of paprika, if you like."}
{"text": "Knead the ready-to-roll icing until smooth, then split into three equal pieces and colour each with colouring. Roll out to approx ½cm thickness and, using a template, cut out eight stocking shapes. Set aside.\nMake the royal icing and colour as before. With the end of a skewer, dot small 'spots' all over the stocking shapes (or use a piping bag). Set aside to dry. Keep the coloured icing covered with cling film until later.\nFix the ribbon around the top edge of the cake, using a thin line of icing to help it stick. Using a little leftover coloured icing, ‘hang’ the stockings on the cake, just underneath the ribbon, in alternating colours. Top the cake with Smartie-filled boxes and scatter Smarties over the cake and cake board."}
{"text": "While the goose is roasting, tip all the vegetables into a pan of cold salted water, then bring to the boil. Boil for exactly 3 mins, then drain well. Scatter the flour over the veg in the colander, then toss well to coat.\nLadle a good layer of goose fat into a large roasting tin, then place above the goose while it is having its final 10 mins with the foil on. When you open the oven to remove the foil from the goose, remove the tin for the veg. Carefully lay the vegetables in the hot fat, then use a fish slice to turn them until completely coated. Place the veg above the goose for the final 30 mins, turn them over, then return to the oven while the goose rests for 30 mins. Cook until golden and crisp, turning the oven up slightly at the end if needed."}
{"text": "Cook the bacon in a frying pan until crispy. You shouldn’t need any oil as the fat will run from the bacon.\nHeat the vinegar in a large saucepan until just simmering. Tip in the sugar and stir to dissolve, then add the red cabbage. Cook for a further 3 – 5 minutes, tossing the cabbage through the vinegar.\nSpoon the cabbage into bowl, stir through the bacon, sultanas and season with black pepper and a little salt. Allow to cool.\nToss in the blue cheese to serve."}
{"text": "Tip the onion and chopped dill into a bowl with the horseradish and lemon juice. Stir through the soured cream, season with a pinch of salt and generous grinding of pepper, and mix well. \n.\nArrange the salmon on a board or plate, scatter with the remaining dill fronds and serve with a grinding of black pepper and the sauce alongside."}
{"text": "Clean the jar and dry well. Layer in the ingredients, starting with the caster sugar, followed by the muscovado, flour, nuts, cranberries and finally finishing with the white chocolate. Close the jar, then add a label with baking instructions, plus a ribbon or pretty cover if you like."}
{"text": "Heat half the butter in a large frying pan and soften the onions over a low heat for about 15 mins until really soft – but don’t let it brown. Add most of the sage. Meanwhile, cook the sprouts in a pan of boiling water for about 4 mins, add the peas and cook for 1 min more until just tender.\nDrain, reserving a splash of the water, then add the sprouts and peas to the onions, along with the rest of the butter, stirring well so that all the veg gets coated in the butter. Add the reserved cooking water if it looks a bit dry.\nSeason with lots of black pepper and some salt. Serve with the reserved sage on top."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put the flour, cocoa, ginger, butter and sugar in a processor, and whizz until you can’t see any lumps of butter. Dribble in the syrup and pulse to a smooth dough.\nTake about a quarter of the dough at a time and roll out between 2 sheets of baking parchment to the thickness of a £1 coin. Peel away the top layer of parchment and use cookie cutters to make shapes – leaving about 2cm between each shape as they will spread as they cook. Peel away the dough trimmings and lift the parchment with the shapes onto a baking tray. Bake for 12-15 mins until firm. Remove from the oven and use a plastic straw to make a hole for hanging. Work quickly – if the biscuits cool and harden too much, the holes won’t be as neat – then pop the tray back in the oven for 1 min to re-warm.\nContinue rolling and shaping all the remaining dough and trimmings while you bake a tray at a time, until all the dough is used up and you have at least 24 biscuits. Cool completely, then decorate and string up as you wish.\n Cut your biscuits into triangles using a template – ours was 7cm on each side. After baking, cut two hanging holes in the middle of one side. Use number cutters (or cut out with a small sharp knife like we did) to stamp out 1 to 24 from a sheet of ready-rolled icing. Make runny icing by mixing some sifted icing sugar with a dribble of water. Use small paintbrushes to paint the tops of the icing numbers with some runny icing before dunking in their favourite coloured sprinkles and edible glitters. Leave the numbers to dry for 10 mins, then use more runny icing painted on the bottom of the numbers to stick them to the biscuits.\n Stamp your biscuits out using different snowflake cutters – cakescookiesandcraftsshop.co.uk have pretty ones. Decorate each biscuit differently by painting some with runny icing (see instructions above), then dunking into edible glitters and sprinkles – it’s easiest if you tip them onto a small, flat saucer first. Add more icing sugar to your runny icing to make a stiffer consistency, spoon into a piping bag and pipe on pretty details. You can pipe a number onto each with this icing too, if you want.\n Make a stiff-ish icing using fondant icing sugar this time (this results in a shinier finish). Then thinly pipe around the outsides and holes of each biscuit. You’re making a ‘wall’ to hold in the other icing, so make sure you don’t leave any gaps. Leave to set for 30 mins until hard. Make more icing of a slightly runnier consistency. Pipe or spoon the icing onto the biscuits, ‘flooding’ the area inside your icing ‘walls’. Shake a little to evenly spread the runny icing, then immediately use the remaining stiffer icing to pipe on a number. These biscuits will need at least a day to harden before hanging. For step-by-step instructions on ‘flooding’ icing, see Edd Kimber’s Fancy iced biscuits (see 'goes well with')"}
{"text": "Mix together the fruit, dried fruit, nuts, spices and brandy. Leave the mixture in the fridge for 30 mins to allow the flavours to develop, then stir in the honey. Heat oven to 200C/180C fan/gas 6. Arrange the filo sheets with the short side facing you and, using scissors, cut the stack in 3 vertically, to make long strips. Brush the top 3 strips with melted butter.\nWorking quickly, put 1 heaped spoonful of mincemeat at the top of the first strip. Fold one corner of the pastry over it to form a triangle, then continue folding alternately left and right to form a triangular package, until you’ve used up all the strip. Repeat with the other strips, brushing with butter before folding.\nPlace on a baking sheet and brush each one with more melted butter. Bake for 15-20 mins until crisp and golden. Dust with icing sugar and serve warm (reheat later in a low oven if necessary)."}
{"text": "Put the fish on a board and cut each fillet on the diagonal into about 12 slivers. You should end up with around 48 finger-sized pieces of fish. Put the flour in a bowl and season.\nBeat the eggs in a medium bowl. Sprinkle half the breadcrumbs into a large bowl and stir in half the curry powder. Toss the fish pieces with the seasoned flour, then take one at a time and dip into the beaten egg, then coat in breadcrumbs evenly.\nPut on a tray lined with baking parchment while the rest are prepared, adding the reserved breadcrumbs and remaining curry powder to the large bowl after coating roughly half the fish pieces. Spray all the fish generously with oil and season again. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking (or to freeze, see tips below, left.\nHeat oven to 220C/200C fan/gas 7. Bake the goujons for 8-10 mins until golden and crisp. To make the dipping sauce, mix all the ingredients in a bowl, then soon into a serving dish or dishes."}
{"text": "Score the pork belly skin with a sharp knife in a cross pattern. Score down to just before where the skin meets the fat, rather than the fat itself. Bring a large saucepan of water to a simmer and add the bicarbonate of soda. Lower the pork into the water, poach gently for 5 mins, then remove it from the water and leave to cool to room temperature.\nMeanwhile, toast the fennel seeds and chilli flakes in a dry frying pan over a high heat for 1-2 mins, then tip into a bowl and leave to cool. Grind the spices in a spice grinder or with a pestle and mortar, then mix with 1 tbsp fine sea salt.\nOnce the pork has cooled, turn it skin-side down and pierce the underside of the meat all over with a knife. Rub the meat with the spiced salt rub, cover and put it in the fridge for at least 8 hrs or overnight. Can be prepared 24 hours ahead.\nThe next day, make your stuffing. Heat the olive oil in a non-stick frying pan and add the onion and fennel. Season and cook gently over a low heat for 10 mins. Add the coriander seeds and garlic, and cook for another 2 mins, then add the mince. Cook for 8-10 mins until the mince is browned. Set aside and leave to cool.\nTransfer the mince and onion mix to a bowl and add the sourdough, pine nuts, orange zest, apricots, herbs, lemon juice and nutmeg. Season well, then mix together thoroughly with your hands. Add the egg and mix again.\nLie the pork belly on a board, skin-side down. Form the stuffing into a sausage shape running all the way down the middle of the belly. Wrap the sides of the belly around the stuffing and tie with butcher’s string. Place seam-side down in a roasting tin, uncovered, and chill for at least 2 hrs, preferably overnight. You want the skin to dry out completely so that it crisps up when you roast it.\nTo cook the pork, remove it from the fridge and leave it for at least 1 hr to come to room temperature before you cook it. Heat oven to 180C/160C fan/ gas 4 and cook the pork for about 2 hrs, turning the tin every 30 mins or so. After 2 hrs, turn the heat up to 220C/ 200C fan/gas 7 and cook for another 20 mins. When the pork is done, a thermometer pushed into its centre should read 77C. If the skin looks in danger of burning, cover it with foil – but only do this once it has crackled.\nOnce the pork has cooked, remove from the oven and leave to rest for 30 mins. When you’re ready to carve, put the pork on a big chopping board. Using a sharp knife, slice the meat into rounds."}
{"text": "Put the cranberries in a pan with the sugar and orange juice. Bring to a simmer, then cook until the berries start to burst and the sauce thickens. Set aside to cool.\nHeat the oil in a small pan and fry the onion until soft. Add the bacon and garlic, and cook until the bacon starts to brown, then stir through the thyme, sage and some seasoning. Allow it to cool slightly, then mix with the pork and pistachios. Season with salt, pepper and freshly grated nutmeg. Set aside.\nHeat oven to 200C/180C fan/gas 6. Tip the flour into a bowl with 2 tsp salt. Put lard and milk into a pan with 150ml water, then heat until the lard has completely melted. Pour into the flour and beat with a wooden spoon until a ball of dough is formed. Knead briefly on a lightly floured surface until smooth.\nTake two-thirds of the pastry and roll out between two sheets of baking parchment into a circle large enough to line the base and sides of a 20cm cake tin (about 4-6cm high with a slight overhang. Press the pastry into the tin making sure to push it into the corners. Pile half the filling into the pastry and flatten into an even layer. Spread over two-thirds of the cranberry sauce, then finish with remaining pork and roughly smooth the top. Keep the rest of the cranberry sauce in the fridge to serve with the pie.\nRoll out remaining pastry between baking parchment and cut to a 20cm round. Place onto the pie and glaze the edge with some beaten egg. Fold up the overhanging pastry and press down to seal. Make a steam hole with the tip of a knife, then glaze the pie with more beaten egg. Cook for 30 mins, then reduce the heat to 180C/160C fan/gas 4. Continue cooking for 40 mins until the pastry is golden and a skewer inserted into the centre of the pie and left for 10 secs feels very hot. Cool on a wire rack. Serve with the reserved cranberry sauce. \nWatch our \n for extra tips."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the parsnips and carrots with the oil, maple syrup, white wine vinegar, thyme and some seasoning in a large roasting tin.\nCover tightly with foil and roast for 20 mins. Remove the foil and give everything a good shake, then roast for a further 30 mins on the top shelf of the oven or until the vegetables are tender and caramelised."}
{"text": "Heat the oven to 180C/160C fan/gas 4. Butter and line a 1.5kg loaf tin. \nMelt the butter and chocolate together in the \n until smooth. Sieve the flour into a bowl, then stir in the sugar and cocoa. Add the chocolate mixture, eggs, milk and 200g yogurt and blend until smooth.\nSpoon the mixture into the loaf tin and make eight dips in the surface. Top each dip with 1 tsp yogurt and a cherry. Put the loaf in the oven and bake for 1 hr, or until a skewer inserted into the middle of the cake comes out clean. Cool in the tin for 20 mins, then transfer to a \n and leave to cool completely.\nJust before serving, use a balloon whisk or electric \n to beat the cream until stiff. Spoon the cream onto the cake in dollops, top with the remaining cherries and drizzle over some of the cherry syrup. Serve straightaway. "}
{"text": "Roughly mash your cold \n with a fork, then add the \n, cumin seeds, garlic and some seasoning, and mix together. Use your hands to shape the mixture into two patties.\nHeat the oil in a large frying pan. Fry the patties for 3-4 mins each side until crisp. Pour the lemon juice over the avocado. To serve, get two plates, put a patty on each and serve with the avocado, a sprinkling of chilli flakes and a good pinch of flaky sea salt."}
{"text": "Line a 900ml pudding basin or deep cereal bowl with a double layer of cling film. Scoop the caramel ice cream into the bowl, patting it down well. Top with the conserve, followed by the vanilla ice cream. Pat down firmly, cover with cling film and freeze for at least 2 hrs or, better still, overnight.\nHeat oven to 200C/180C fan/ gas 6. Whisk egg whites until stiff, then slowly whisk in the sugar until firm and glossy. Slice the cake and arrange on a baking parchmentlined baking sheet, to make a round the same size as the top of the ice-cream bowl. Press together well to make sure there aren’t any gaps.\nLift ice cream out of bowl, remove cling film and turn onto the cake. Spread the meringue evenly over the ice cream and cake, making sure there are no gaps. Bake for 4-5 mins until nicely coloured. Serve immediately."}
{"text": "Grease and line a loaf or terrine tin (about 650g) with cling film – if you only have a standard 900g tin it will still be fine, just a bit flatter. Arrange the whole dill fronds and a few nice slivers of the smoked salmon on the bottom (this will be the top of the terrine so you want it to look quite neat).\nIn a food processor, pulse half the cooked salmon fillets, half the remaining smoked salmon trimmings and the cream cheese with some seasoning. Don’t overmix as you want it to have a bit of texture. Fold in half the dill, all the spring onions and the rest of the poached and smoked salmon so that you have some nice flakes of fish running through the pâté. Scrape into the tin, smooth the surface and chill for at least 2 hrs or up to 2 days in advance.\nTo serve, heat oven to 200C/180C fan/ gas 6. Arrange the bagel halves in a single layer on a baking tray and brush each one with some oil. Sprinkle on a little of the dill and some sea salt, then bake for about 10-12 mins, until crisp and light golden. (If the oven is full, these can be done earlier and served at room temp.) Turn the terrine tin upside down and use the cling film to remove it. Unwrap and serve on a platter with the bagel toasts."}
{"text": "Cook basmati rice, leave to cool. Heat oven to 160C/140C fan/gas 3. Grease a large ovenproof dish with some of the butter. Push the egg yolks through a sieve and roughly chop the whites.\nGently heat the cream in a frying pan until just below boiling point, then add the fish. Cover and poach for 4 mins. Place the wine in a pan with the saffron and warm to infuse. In a large bowl, mix together the rice, cayenne, curry powder, nutmeg, seasoning, chopped egg whites and saffron-infused wine. Lift the fish out of the cream and flake into the bowl – removing any bones as you find them. Scrape in the cream and gently mix together once more.\nTip everything into the buttered dish and dot the top with the remaining butter. Bake to heat through for 20 mins, then serve scattered with the parsley and sieved egg yolk, with lemon wedges on the side."}
{"text": "In a covered, non-stick pan, gently fry the onions and bay leaves in the butter for 10 mins, until soft. Add the milk and cloves and simmer for 30 mins, stirring now and then.\nTake out the bay and cloves, then blitz in a food processor until smooth. This will keep for 2 days in the fridge.\nOn the day, tip the cream into a pan, add the onion sauce, then mix well. Add the bread and stir until soft but still textured. Add milk to thin if necessary. Season and serve warm."}
{"text": "Heat oven to 200C/180C fan/gas 6 and line a baking sheet with baking parchment. Put another baking sheet in the oven to heat up. Put the membrillo, 50g butter, 50g sugar, the cinnamon and nutmeg in a saucepan, and heat until the ingredients have melted together, mashing the membrillo with the back of a spoon to break it up. Set aside to cool while you prepare the pastry and persimmon.\nOn a flour-dusted work surface, roll the pastry to the thickness of a £1 coin. Use a sharp knife to cut out a circle, about 30cm in diameter (use an upturned mixing bowl as a guide, if you like). Transfer the pastry to the parchment-lined baking sheet. Slice each persimmon into thin circles, showing off the central star.\nWhen the membrillo mixture has cooled, stir in the egg yolks, then spread over the pastry, leaving 1.5cm clear around the edges. Layer the persimmon slices over the membrillo base. Grate over a little more nutmeg, dot with the remaining butter and scatter with sugar. Fold in the edges of the pastry to create a border and brush with the remaining egg yolk. Open the oven and carefully slide the galette onto the hot baking sheet. Bake for 40-45 mins until the pastry is crisp and golden, and the persimmons are soft. Cool for 10 mins before serving with ice cream, or serve cold at teatime."}
{"text": "Fill six highball or big wine glasses with ice and divide 300ml vodka between them. Add 24 mint leaves, seeds from 1 pomegranate (about 1 heaped tsp per glass) and 600ml apple juice, then stir with a straw or chopstick to muddle."}
{"text": "Put the rum (or brandy), orange zest and juice and mixed dried fruit in a bowl and stir. Leave to soak overnight.\nHeat oven to 170C/150C fan/gas 3½. Double line a 20cm tin with baking parchment. Beat the butter and sugar together until light and fluffy. \n in the eggs one by one, then fold in the almonds and flour. Add a pinch of salt and fold in the soaked fruit mixture (and any remaining liquid in the bowl), along with the nuts, candied peel and ginger. Spoon the mixture into the tin and level the surface.\nBake for 1 hr, then turn the oven down to 150C/130C fan/gas 2 and bake for a further 2 hrs. Check the cake to see if it's pulling away from the sides of the tin and feels firm on top. If you need to, keep cooking for a further 15 mins. Cool in the tin. If storing in the tin, wrap the cake tightly first. \nTo decorate, brush the cake with the apricot jam (or glaze) and arrange your choice of candied fruit on top. "}
{"text": "Make the stuffing. Boil the potatoes for 10-15 minutes until soft enough to mash, then drain. Meanwhile, heat the butter in a large pan and fry the leeks, garlic and thyme leaves, stirring occasionally, for 8-10 minutes until soft. Mash the leeks and potatoes together with the parsley, lemon zest and salt and pepper. (This can be prepared up to a day ahead and kept in the fridge until needed.)\nPreheat the oven to fan 200C/ conventional 220C/gas 7. Pull out the two big lumps of fat from inside the cavity of the goose. Use a skewer to prick the skin all over, especially on the legs – try not to pierce the flesh. Rub lots of salt over the skin and in the cavity. Pack the cavity with stuffing, then loosely tie the legs together with string.\nLift the goose onto a roasting rack in a large roasting tin. Roast for 30 minutes. Reduce the oven to fan 160C/conventional 180C/gas 4 and roast for another 2⁄2½hours. Meanwhile, make the gravy and stuff the apples (see steps 4 and 5). Check during roasting that the fat released from the goose hasn’t risen to touch the bird – if it’s close, carefully pour it into a bowl. At the end of the roasting time, check the bird is cooked by inserting a skewer into the thickest part of the thigh to see if the juices run clear; if not, give it another 15 minutes and check again.Remove from the oven when ready and increase the heat to fan 180C/conventional 200C/gas 6, for the apples. Allow the goose to rest for 20 minutes before carving.\nFor the gravy, heat the oil in a heavy-based pan over a highish heat. Fry the goose neck, gizzard and carrots for 10 minutes until brown. Add the onion, leek trimmings and herb stalks and cook for 5 minutes. Pour over the wine and port and boil for 5 minutes until reduced and syrupy. Pour in the stock, stir well and simmer for about 20 minutes until you have a mahogany gravy. Strain into a small pan, ready to reheat before serving.\nFor the apples, mix the cranberry sauce and cranberries in a bowl. Cut a thin slice off the bottom of the apples. Score the skin all round their middles, then tunnel out the stalks and cores. Stand the apples on a shallow baking tray. Pile the cranberry mix into the cavities, top with a dot of butter and scatter over the sugar.While the goose is resting, increase the oven to fan 180C/conventional 200C/gas 6. Bake the apples for 20-30 minutes until soft and starting to split and the cranberries are oozing juice.\nReheat the gravy. Put the goose on a large platter, surrounded by the apples and sprigs of parsley. Serve with the potato stuffing, Quick braised celery and carrots and the gravy. And what to do with all the goose fat? Use it to make the duck confit and the roast potatoes."}
{"text": "Soak the dried fruit in the sherry overnight, or for as long as you can – even a 10-min soak will help. Butter six 200ml pudding moulds or dariole moulds.\nHeat oven to 180C/160C fan/gas 4. Beat the butter and sugar together until pale and fluffy. Beat the eggs, then slowly add them to the butter and sugar using an electric whisk or mixer. Sift the flour and baking powder together, then carefully fold into the egg, butter and sugar mix using a large metal spoon. Drain the fruit and fold into the mix with the mixed spice, orange or clementine zest and 4 tbsp of the sloe gin.\nMix the jam and the remaining sloe gin, then divide between the moulds. Spoon in the batter, filling the moulds two-thirds full. Fill another mould with any leftover mix. Cover each mould with a large square of foil with a pleat in the centre to allow room, as the sponges will rise a lot. Secure with string. Place the moulds in a baking or roasting dish, then fill the dish with water to come one-third up the side of the moulds. Bake for about 1 hr or until the sponges have risen and are cooked. \n.\nTo serve, remove the foil. Gently loosen the puddings with a knife and upturn them onto plates. Serve with homemade or bought custard."}
{"text": "Put the celeriac, carrots and apples in a large pan of water, bring to the boil and simmer for 20 mins until tender. Drain, tip back into the pan and mash roughly. Stir in the rest of the ingredients. Cover and keep warm until ready to serve."}
{"text": "First make the pastry. Sift the flour into a large bowl, add the butter and, using your fingertips, rub it into the flour so the mixture resembles breadcrumbs. Measure 150ml/¼ pint cold water into a jug. Stir the ground almonds and sugar into the flour mixture, then add the egg yolk and a little of the water, stirring with a knife. Gradually work in the rest of the water, stirring until you have a soft pastry ball. Wrap it in cling film and chill for 20-30 minutes.\nMeanwhile, make the filling. Preheat the oven to fan 180C/conventional 200C/gas 6. Tip the ground almonds, sugar, currants, sultanas, almonds and spices into a large bowl and stir. Melt the butter (use the microwave for speed) and add to the dry ingredients with the beaten eggs and the lemon and orange zest and juice. Mix together really well.\nRoll out the pastry on a lightly floured surface (working with half at a time is easiest) to about 5mm thickness. Cut out about 24 rounds using a 10cm round cutter. Use each round to line a muffin tin (use two trays, or bake in batches). Spoon the filling into each pastry-lined tart, so it is just shy of the top of the pastry.\nBake for 20-25 minutes until pale golden, then turn each tart out on to a wire rack and dust with icing sugar. Lovely served warm or cold."}
{"text": "Heat the honey and rosemary in a small pan with 1 tbsp boiling water. Bring to a simmer and let it bubble for around 30 secs. Remove from the heat and allow to infuse.\nHeat a frying pan and drizzle in a little oil. Add the hazelnuts and toast until golden and starting to char a little here and there. Remove from the pan, allow to cool, then chop roughly to make a rustic crumb. Mix with the lemon zest and some seasoning.\nTo make a dressing, combine the olive oil and balsamic vinegar with some seasoning. Toss the salad leaves in most of the dressing, then arrange on serving plates or a platter, layering the leaves with the pear slices. Top with shavings of manchego and the hazelnut crumb, then drizzle over some of the rosemary honey and the remaining dressing. Serve with prosciutto twists (see tip, below) for the meat-eaters."}
{"text": "Heat oven to 200C/180C fan/gas 6. Make 3-4 deep slashes length- and widthways in each potato, to make a criss-cross pattern. Sprinkle over a little sea salt and insert a sage leaf into slits of each hedgehog. Put in a roasting tin, add the fat or oil and roast for 45 mins. You can do this up to a day ahead; keep in fridge until ready to cook. Increase oven to 220C/200C fan/gas 7. Roast for 30 mins until crisp and golden."}
{"text": "A day or two before roasting, prepare the potatoes. You need chunks or whole potatoes roughly the size of a clementine, so peel and leave whole, halve or quarter accordingly. Place the potatoes in a large pan of cold, salted water – salting is important, so don’t skip it. Bring the water to the boil and simmer gently for about 15 mins until the potatoes are cooked all the way through but not on the brink of collapse. Gently drain the potatoes in a colander, but do not shake them or ruffle them up – just leave them to drain and cool. Once there is no more steam coming off them, place on a tray in a single layer and put them in the fridge, uncovered, until ready to roast.\nHeat oven to 200C/180C/gas 6 (or put them in when you turn it up for the turkey). Pour oil into a deep roasting tin to give an even layer of about 0.5cm. Place the tin in the oven for 5 mins to heat the oil, then remove from the oven. One at a time and working methodically (starting at one corner of the roasting tin and lining them up as you go) place each potato in the oil and use a spoon to turn it so it’s completely coated. Don’t worry about the oil cooling down too much. Once all the potatoes are in the tin in a single layer, not touching, place the tin in the oven and cook for 40 mins, undisturbed.\nRemove from the oven and – again, meticulously – turn each potato. Return to the oven for 20 mins, then repeat the potato-turning process again. If, at this stage, your other side dishes allow you to, turn the oven up to 220C/200C fan/gas 7 and give the potatoes a final 20 mins. By now you should have potatoes that are everything a roastie should be: deep, golden and crunchy on the outside with an extra-fluffy middle – just sprinkle with a little sea salt to serve."}
{"text": "Heat 1 tsp of oil in a large saucepan. Add the bacon and fry over a medium-to-high heat for 4-5 mins or until golden, then set aside.\nPut the remaining oil, the onion, carrot, celery and a pinch of salt in the pan. Cook gently over a low heat for 8-10 mins, stirring occasionally, until the veg is soft but not coloured. Add the garlic and herbs, and cook for 2 mins more\nTip in the celeriac, potato, borlotti beans and chicken stock. Bring to the boil, then simmer, uncovered, for 10-15 mins. Add the cooked turkey, orzo and the bacon, and cook for 10 mins.\nJust before serving, tip in the kale, give everything a good stir and return to the heat for about 2 mins or until the kale has wilted."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line 10 holes of a muffin tin with cases (or grease some individual cake moulds). Beat the butter, flour, sugar, baking powder, eggs, yogurt, zest and 2 tbsp orange blossom water in a large bowl with an electric whisk until lump-free. Spoon into the cases (or fill cake moulds three-quarters full), and bake for 18-22 mins until golden and risen – a skewer poked in should come out clean (check cake moulds after 15 mins).\nDrizzle with remaining orange blossom water while warm, then cool. Dust with icing sugar to serve."}
{"text": "Separate the cauliflower into even-sized florets, cutting round the core, then bring a large pan of salted water to the boil. Add the cauliflower and boil for 8 mins or until just tender. Drain in a colander and allow to steam-dry. Shake the cauliflower if necessary to remove as much water from the crevices as you can. Arrange in a large casserole dish.\nTo make the sauce, pour the milk into a pan with the butter, bay leaves and cornflour, and heat gently, stirring all the time, until it thickens into a smooth, creamy sauce. Remove the bay leaves, add 100g of the cheese and season to taste. Pour over the cauliflower and scatter with the remaining cheese. If cooking now, go straight to step 3; alternatively, cover and chill. Can be made a day ahead.\nHeat oven to 220C/200C fan/gas 7. Scatter the bread and walnuts over the cauliflower and bake for 25 mins until golden."}
{"text": "Heat oven to 220C/200C fan/gas 7. Roll the pastry out on a lightly floured surface a little thinner than a £1 coin. Stamp out 12 circles about 8cm wide, keeping all the trimmings. Use the circles to line a 12-hole, non-stick bun tin. Put a small spoonful of mincemeat in each one, but be careful not to put too much, as the suet will melt and bubble out if it has no room to spare. Re-roll the pastry trimmings and cut out another 12 circles a little smaller than the last. Brush the edges of the pastry with beaten egg, then add pastry lids, pinching the two edges together. Make a small cross with a knife in the centre of each pie. The pies can now be frozen in the trays for up to 3 months and either defrosted and cooked as stated or cooked from frozen.\nBrush the lids with a little more egg, sprinkle with sugar and bake for 15-20 mins until golden brown. Leave to cool slightly and serve warm."}
{"text": "Line two 19 x 9 x 6cm loaf tins with baking parchment. Tip the sugar, cream, butter and glucose syrup into a medium to large saucepan. Heat to dissolve the sugar and melt the butter, stirring now and again.\nOnce dissolved, put a sugar thermometer in the pan, making sure the measuring tip is completely immersed in the syrup – if not, transfer the mixture to a smaller pan, but be aware the syrup will bubble up. Increase the heat and bring the syrup to a steady boil. Keep bubbling, stirring occasionally to stop the sugar from catching, until the mixture reaches 116C – this is known as the soft-ball stage.\nRemove the pan from the heat and leave to sit undisturbed for 5 mins until the temperature drops to 110C. Stir in a good pinch of salt.\nKeep the sugar thermometer in the pan and begin beating the mixture with a wooden spoon, quite vigorously, until the temperature cools to about 60C. By this time the fudge will be really thick and will have lost its glossy shine. Remove the thermometer and continue beating for a few mins more. This process is important when making fudge, as it creates small sugar crystals, which give the fudge its lovely smooth and creamy texture.\nWorking quickly, divide the mixture into 2 heatproof bowls. In one bowl, stir in the mashed banana. In the other, stir in the clementine zest, juice and 1/4 tsp of freshly ground black pepper.\nBefore it sets, quickly pour the fudge mixes into your prepared tins and smooth over the surface. Sprinkle the cooked bacon over the top of the banana fudge. Leave both to cool at room temperature overnight – don’t put the fudge in the fridge as it will become sticky and won’t set properly. Cut into bite-sized pieces and put in a box to give as a present. Banana fudge keeps in a sealed container for up to 1 week, clementine fudge for 2 weeks."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put the dates in a bowl, pour over 250ml boiling water and set aside. Butter a 1.5-litre pudding basin and put a disc of baking parchment in the base.\nPut the butter, sugar, flour, baking powder and eggs in a large bowl, then beat with an electric hand whisk until well blended. Add the cooled date mix and beat again to make a sloppy batter\nStir in the fruits, pecans and ginger, then pour into the pudding basin and cover the basin with pleated baking paper and foil (see tips, below). Put the basin in a roasting tin half-filled with boiling water, then steam in the oven for 3 hrs until a skewer inserted into the pudding comes out clean.\nMeanwhile, make the brandy syrup. Put the sugar and 75ml water in a pan and stir over the heat until syrupy. Stir in the brandy and remove from the heat. When the pudding is ready, remove from the oven, take off the foil and paper, and push a skewer into the centre – it should come out clean. Pour over the brandy syrup so it soaks into the pudding, then cover until ready to serve. Will keep in the fridge for a week.\nTo serve, warm the pudding in the turned-off oven once you have taken out the potatoes, or microwave on High, covered with cling film, for 5 mins. Warm the butterscotch sauce (see related recipes) in a pan or in the microwave on Medium for 2 mins. Turn out the pudding onto a plate, pour over some of the sauce and serve the rest in a jug. Top with the holly sprig and serve with good-quality vanilla ice cream"}
{"text": "Up to 2 days before, crush together the peppercorns and seeds using a pestle and mortar, or in a saucepan with the end of a rolling pin or similar. Brush the beef fillet all over with the mustard, then roll in the peppercorn mix to coat. Cover and chill.\nTwo hours before you are ready to start cooking, take the beef out of the fridge to come to room temperature.\nHeat oven to 200C/180C fan/gas 6. Heat the oil in a pan big enough to hold the beef, and brown the beef all over, seasoning with salt. In a roasting tin, use the onions as a bed to sit the beef on – pat on any spices that have fallen off. Roast for 20 mins for rare, 25 mins for medium, and 35 mins for well-done beef.\nLift the beef from the tin and rest on a platter, covered with foil to keep it hot, for about 30 mins. Set the tin with the onions and roasting juices over the hob and stir in the oil, cornflour and crumbled stock cubes. Mix in the jelly, then gradually stir in the wine and 400ml boiling water, scraping up any stuck bits from the bottom. Simmer for 15 mins until reduced a little. Season, then sieve into a clean pan to keep warm, discarding the onions. Slice the beef, scatter over the thyme, if you like, and serve with the gravy."}
{"text": "Tip all the ingredients into a saucepan. Bring to a simmer and cook for 5 mins (or a little longer if the berries are frozen ). Cool, then chill for up to four days or freeze for two months. Serve at room temperature."}
{"text": "Bring a large pan of salted water to the boil. Cook the Brussels sprouts for 2 mins, then drain and leave to steam-dry. Meanwhile, put the butter and chorizo in a large frying pan over a medium heat for 5 mins until the butter caramelises and smells nutty, and the chorizo begins to brown. Tip in the sprouts and fry for 5-6 mins over a high heat until they’re tender, starting to crisp and are coated in the browned butter. Once the sprouts are cooked, toss in the blanched almonds."}
{"text": "For the dressing, put the wine, vinegar, cloves and cinnamon in a saucepan. Cook for 15-20 mins until the liquid has reduced by 3/ 4 (to about 75ml ). Add the orange zest and juice to the pan with the crème de cassis, and set aside to keep warm.\nNext, shred the cabbage as finely as possible. Heat a wok until very hot, then add the goose fat and fry the cabbage and ginger for 10 mins. Toss through the dressing and cook for 5 mins more until the cabbage is softened but retains a good bite, serving sprinkled with sea salt."}
{"text": "Start by pouring the white wine and Madeira into a large saucepan. Add the lemon, dried apricots, cardamom pods, star anise, vanilla pod and honey. Bring to a simmer then strain into a jug through a fine sieve. Stir in the rosewater before serving."}
{"text": "Heat oven to 200C/180C fan/gas 6. Add the potatoes to a pan of cold salted water, bring to a boil, then simmer for 5 mins until partly tender. Drain and steam dry for a few mins in a colander.\nReturn the potatoes to the saucepan, and add the oil, paprika and plenty of salt and pepper. Cover with a lid, then shake the pan around to roughen the edges of the potatoes and thoroughly coat them in the paprika and oil. Tip the potatoes into a large roasting tin, making sure they are evenly spaced apart. Scrape in all the fluffy potato mess – these make the best crispy bits!\nRoast the potatoes for 1 hr 15 mins, turning halfway, until extremely fluffy and crisp."}
{"text": "Pour the red wine into a large saucepan. Add the clementine, cinnamon stick, star anise, dried figs, cloves and black peppercorns. Heat very gently until simmering, then turn off the heat.\nFish out the whole spices and peppercorns with a spoon, then stir in the brandy. Ladle into mugs, or heatproof glasses to serve. You could drop in a slice of clementine to each."}
{"text": "Soak the dates, cashews, apricots and mixed spice in the brandy overnight.\nThe next day, tip the mixture into a \n and add the seeds from the vanilla pod and the almond milk. Blitz until smooth, then pour into eight tall glasses (use a sieve, if you like) with ice and grate some nutmeg on top."}
{"text": "At least 3 hrs before (or preferably a day), toss the lamb with half the cumin, coriander, sweet and hot paprika in a large bowl. Cover and leave in the fridge to infuse.\nHeat oven to 160C/140C fan/gas 3. Heat 1 tbsp of the oil in a large flameproof casserole dish over a high heat and season the spiced lamb well. Working in batches, fry until completely brown, then set aside. Add more of the oil as you need it and get some deep colour on the meat – this will add to the flavour of the tagine.\nOnce the lamb is browned, pour any remaining oil into the dish,reduce the heat to medium and add the onions, garlic and remaining ground spices. Cook for 5 mins until softened, then stir in the cinnamon sticks and cardamom pods. Return the lamb to the dish along with the tomatoes, plus 1 /2 a can of water and the honey. Bring to the boil, season, cover with a lid and put in the oven for 2 hrs 15 mins.\nBring the tagine out of the oven, give it a good stir and tip in the cranberries. Return to the oven, with the lid off, for a further 15 mins until the lamb is completely tender.\nTaste the tagine for seasoning and remove the cinnamon sticks and cardamom pods. Scatter over the pistachios, yogurt and mint leaves, then serve out of the dish at the table with couscous."}
{"text": "Heat the apple juice with the whole spices, ginger, zest and sugar. Bring to the boil, then simmer for 10 mins.\nRemove from the heat and leave to cool, then strain the syrup into small bottles."}
{"text": "Fry the onion in the oil until beginning to soften. Tip in the mixed spice, then fry a few seconds more.\nAdd the remaining ingredients. Season, then stir well. Cover and simmer for 20 mins, stirring every now and then, until tender.\nOn the day, reheat in a pan."}
{"text": "Heat the oil in a large pan and gently cook the onion and garlic for 10 mins until soft. Add the beetroot and vinegar to the pan and cook down until sticky. Take the pan off the heat, then stir in the crème fraîche. Blitz with a hand blender, or tip into a food processor and blitz to a purée. Stir in the grated horseradish and serve. The purée can be made up to a day ahead and heated in a pan or in the microwave."}
{"text": "Boil the carrots in salted water for 20-25 mins until tender. Drain in a colander and leave to steam-dry for 1-2 mins. Return to the pan with the butter and roughly mash if you would like a little texture in them, or blitz with a hand blender for a silky-smooth purée. Season well and stir in the tarragon. Will keep in the fridge for 3 days. Reheat in the microwave for 2-3 mins, or in a pan."}
{"text": "Put the cranberries and kumquats in a pan with 300ml/⁄½ pint water. Bring to the boil and simmer very gently for 5-6 minutes, or until the skins start to pop.\nStir in sugar until dissolved, simmer for 4-5 minutes until thick and jam-like. Add stem ginger and more sugar if you like. Cool before serving. Relish can be stored in a covered container in the fridge for up to 5 days."}
{"text": "Make the stock. Put the neck, giblets and wishbone from the goose into a large saucepan with the vegetables and bouquet garni. Cover with cold water and bring to the boil then simmer, half covered, for 11⁄2-2 hours. Strain the stock when it is ready. (You can make and strain the stock up to 24 hours ahead, and keep it in a covered container in the fridge.)\nMake the stuffing. Melt the butter in a heavy saucepan, add the onions, cover and sweat on a gentle heat for about 5 minutes. Tip in the apples, thyme and orange juice and cook, covered, until the apples are soft and fluffy – about 10 minutes.\nBoil the potatoes in their skins for about 20 minutes until tender. Drain and peel when cool enough to handle, then mash and add to the fruit and onion mixture with the zest and seasoning. Allow to get quite cold before stuffing the goose.\nPreheat the oven to 180C/gas 4/fan 160C. Season the cavity of the goose with salt and freshly ground pepper and rub a little salt into the skin. Stuff the cavity loosely and roast for about 2 hours. To test if it’s done, prick a thigh at the thickest part: the juices that run out should be clear. If they are still pink, the goose needs a little longer.\nPut the goose on a serving platter and put it in a very low oven while you make the gravy. Spoon the fat from the roasting tin and save it in a covered container in the fridge – it will keep for months and is great for roast potatoes. Pour about 600ml/1 pint of the strained stock into the tin and bring to the boil on the hob. Using a small whisk, scrape the tin well to dislodge the flavourful meaty deposits. Taste, then strain and serve in a hot gravy boat. Serve the goose garnished with bay leaves and hand the gravy and apple sauce separately."}
{"text": "Soak the prunes and apricots in the wine or juice, preferably for 3 hrs or more. Smear a piece of bacon with a little mustard, then use it to wrap round a prune or apricot and a sausage. Repeat with the remaining ingredients to make 24 and arrange on a baking tray.\nHeat oven to 220C/200C fan/gas 7, brush with a little oil and bake for 18-20 mins until cooked and golden."}
{"text": "Put all the ingredients in a saucepan and stir over a gentle heat until the sugar has dissolved. Increase the heat, cover and simmer for 5 mins until the cranberries have burst and the sauce has thickened. Transfer to a bowl and leave to cool, then remove the cinnamon and cardamom."}
{"text": "Heat oven to 180C/160C fan/gas 4. Butter, then line a 23 x 32cm baking tray. Using an electric hand \n, beat the egg whites, lemon juice and a pinch of salt until stiff.\nAdd 1 tbsp of the caster sugar, then whisk until the mixture makes stiff peaks. Repeat with the rest of the sugar, spoon by spoon, until the mix is thick and shiny. Spread into the tin, then bake for 15 mins or until crisp to the touch and lightly golden in places. Leave to cool.\nSimmer the cherries, orange juice, sugar and cloves for 10 mins, or until the cherries are soft but still holding their shape. Mix the cornflour with 2-3 tsp cold water to make a paste, stir into the cherries and cook for a couple mins more until the juices thicken. Leave to cool. \nTo assemble, sift icing sugar over a large piece of parchment, then carefully flip the meringue onto it. Remove the tin and parchment. With a short end facing you, score a line 2cm into the meringue.\nWhip the cream, icing sugar and vanilla until thick but not stiff, then spread over the meringue. Spoon over about half of the cherry sauce and scatter with the grated chocolate. Roll up the roulade, starting with the scored short end and using the paper underneath to help. \nFreeze by setting on a parchment-lined tray then, once firm, wrap the parchment around it and cover with cling film. \nTo serve, drizzle with the melted white chocolate. Top with a few of the whole cherries and serve the remaining sauce on the side."}
{"text": "Put all the ingredients except the pears in a large pan and cover with a tight- fitting lid. Cook on a low heat for 1 hr, then stir through the pears. Cover and cook for 1 hr more until the cabbage is really tender. If at any point the cabbage looks dry, add a splash of water. If there is still liquid in the pan at the end, turn the heat right up to evaporate it. Season with a little salt and serve. The cabbage can be prepared ahead and either chilled or frozen. Then reheat in the pan or in a microwave."}
{"text": "Bring the cream to the boil in a small pan. Remove from the heat and stir in the chocolate until it has melted. Stir in the liqueur and pour into a bowl. Cool, then chill until firm, about 4 hrs, or overnight.\nSprinkle a sheet of greaseproof paper with icing sugar and another with cocoa powder. Take a teaspoon and scoop nuggets of truffle mix out of the bowl and onto either the paper with cocoa powder or icing sugar. Use two teaspoons to coat the nuggets then transfer them to paper sweet cases. Pack into paper sweet cases in boxes and chill. Store for up to 2 weeks."}
{"text": "Heat oven to 200C/180C fan/gas 6. Tip the cream cheese and pesto into a bowl and mix well.\nUnroll the pastry on a lightly floured surface and cut in half lengthways. Spread the pesto mix over one half, pop the other piece of pastry on top to create a sandwich, then cut in half lengthways to create 2 long rectangles. Divide each rectangle into short strips, about 1cm thick. Twist each pastry strip and place on a baking tray lined with parchment.\nBrush with egg and bake for 20-25 mins until risen and golden brown."}
{"text": "Using two ice cube trays, put one or two cranberries in each square, fill with water and freeze until solid. Can be done a week ahead.\nPour the cranberry juice, vodka and grapefruit juice into a punch bowl or large pouring jug and add the lime slices. Add some ice and half the cranberry ice cubes. Divide the remaining cranberry ice cubes between the glasses, then pour in the punch."}
{"text": "Trim the turkey breast. Its natural shape does not suit the rolled and wrapped Wellington. The thicker neck end can first be trimmed to establish a more cylindrical shape. Trimmings from 2kg/4lb 8oz breasts and upwards, will be enough for the 350g/12oz needed for stuffing. Once trimmed, tie the breast with a 2cm/1in gap between each loop of string, to give a rounded shape.\nHeat 2-3 tablespoons of cooking oil in a large frying pan or roasting tray. Season the turkey before pan frying until golden brown all over. Remove from the pan and cool. The breast can now be refrigerated to firm up before removing the string.\nMake the stuffing: cook the onions in a knob of butter for a few minutes until softened. Remove from the heat and leave to cool. Roughly chop the turkey trimmings before blitzing in a food processor until smooth. Add sausages and continue to blitz for 30-40 seconds until mixed in. Season and add the eggs. These can be blitzed into the meat for a further minute until the texture thickens.\nSpoon the stuffing into a large bowl. Mix in the onions and remaining stuffing ingredients along with extra seasoning, if desired. The stuffing can now be chilled while the bacon and pastry are prepared.\nThe streaky bacon needs to be rolled thinner. This extends the length of the rashers helping them to wrap around the turkey and stuffing. The easiest method to follow is to lay 3-5 rashers between two sheets of cling film and press with a rolling pin as if rolling pastry. The rashers will easily thin and extend this way. Peel away the top layer of film and remove the rashers and put on a tray. Repeat until all rashers are pressed. Chill until needed.\nRoll the puff pastry on a lightly floured surface to a rectangle approximately 45 x 35cm/18 x 14in. The rashers of bacon can be laid on top of the pastry, leaving a 3-4cm/1½in border all round. Slightly overlap the rashers as they are laid on the pastry (you'll need about 14-15 rashers).\nSpread the cranberry stuffing over the bacon, first mixing it well if it is chilled and set. Keep back a few heaped tablespoons. Remove the string from the turkey and lay the breast lengthwise and presentation side down on top of the stuffing. The reserved stuffing can now be spread along the centre top of the turkey. Lift 4-5 rashers at a time and press them against the breast. Continue until all the rashers on both sides have been lifted and pressed. The remaining rashers can now be laid lengthwise along the top, covering the stuffing that was spread there.\nBring one long side of the pastry up and over the turkey. Brush the other long side with beaten egg, along the 3-4cm/1½in border, then seal. Brush both ends with beaten egg and fold up to seal in all the ingredients. Turn the Wellington so that the presentation side is up and put on a lightly oiled baking tray, or one covered with greased parchment. Chill.\nTo cook the Wellington: preheat the oven to 200C/Gas 6/170C in a fan assisted convection oven and bake for 1 hour 15 minutes to 1 hour 25 minutes maximum. After 45 minutes, brush the Wellington with egg to help colour the pastry. For the most golden of finishes, brush again before the last 15-20 minutes. Once cooked, remove from the oven and rest for 15-20 minutes before lifting carefully on to a carving board with two large fish slices.\nWhile the Wellington is baking the sauce can be made: melt a knob of butter in a pan, once bubbling add the shallots or onions and cook on a medium high heat until a rich deep golden colour. Add the honey and continue to cook for a few minutes until bubbling and almost caramelising. At this point add the red wine vinegar and red wine. Bring to the boil and reduce by half. Add the water or stock and return to simmer. Mix the flour with 25g/1oz butter. Whisk into the sauce a little at a time until completely whisked in. Return the sauce to the boil before reducing to a simmer and cooking for a few minutes. Strain through a sieve and season. Slice the Wellington and serve with Noisette potatoes and buttered Brussels sprouts."}
{"text": "Combine 125g sugar with all the cream in a heavy-based saucepan. Heat gently, stirring occasionally, until all the sugar has dissolved, then bring to the boil. Boil fiercely for 3 mins, stirring to prevent the mixture bubbling over the pan or sticking, then immediately remove from the heat.\nWhizz the pulp from 7 of the passion fruits in a food processor to separate the seeds from the juice. Sieve and stir this juice into the cream along with the lime juice – the mixture should visibly thicken. Leave to cool for 10 mins, then pour into 10 small pots or cups. Arrange the cups on a tray (make sure it fits in your fridge) and, when cool, cover the whole tray with cling film – be careful not to let it touch the surface of the cream. Chill for 3 hrs to set, or up to a day ahead.\nMeanwhile, make the shortbread. Heat oven to 180C/fan 160C/gas 4. In a large bowl, use a wooden spoon to mix the butter, flour, ground rice, 50g of the coconut, the egg yolks, vanilla and remaining 225g sugar until the dough comes together. Roll out on a lightly floured surface and, using starshaped cutters, stamp out biscuits. Spread over baking parchment-lined baking trays, sprinkle with the remaining coconut and sugar, then bake for 8-10 mins. Leave to cool.\nTo serve, scoop the pulp from the last passion fruit and drizzle a little over each pot. Arrange the coconut stars on the side."}
