{"text": "First make the pastry. Tip the flours into a food processor with ½ tsp salt and the diced butter. Pulse until you can’t feel any lumps, then tip in the walnuts. Mix the egg yolks with 3 tbsp cold water, then dribble this into the machine while you pulse again until the pastry comes together. Tip the pastry out onto a floured surface, lightly bring it together into a ball, then roll out and line a deep 20-23cm tart tin with overhang. The pastry may crack, but just patch it back together, then cover and chill for 1 hr.\nTo make the filling, melt the remaining butter in a large pan, then add the shallots and soften for 10-15 mins, until golden and squishy. Stir in the thyme for 1 min, then remove from the heat. Beat the eggs in a jug with the crème fraîche and cream. Crumble in the cheese and season with pepper and a small amount of salt.\nHeat oven to 200C/180C fan/gas 6. Blind bake the pastry for 20 mins, remove the baking beans and paper, then bake for a further 15-20 mins until golden and sandy. Reduce the oven temp to 180C/160C fan/gas 4. Add the cooled onions to the cream mixture and pour into the case. Sit the fig halves on top, cut side up, sprinkle with some more thyme and bake on the middle shelf for 1 hr-1hr 10 mins until the tart is browning and has a slight wobble – the cheese middle will firm up on sitting. Cool for about 15-20 mins, then remove from tin and serve with a green salad."}
{"text": "Pour 100ml out of the vodka bottle – you can keep this in the freezer for Christmas cocktails. Mix the rose water and caster sugar together until the sugar dissolves, then pour into the vodka bottle using a funnel.\nWash any sugar off the Turkish delight, then put it in the bottle. Screw on the lid and leave to stand for up to a month, swirling occasionally until the Turkish delight dissolves. Serve with soda water and ice, or drizzle neat over vanilla ice cream for a boozy treat."}
{"text": "Heat oven to 200C/180C fan/gas 6. Fry the chorizo until crisp on both sides. Skewer the cooked, peeled king prawns onto cocktail sticks and add a slice of chorizo to each, then transfer to a baking sheet and bake for 5 mins until warmed through.\nTo make the gremolata, mix lemon zest with some parsley and garlic. Sprinkle over the prawn and chorizo skewers to serve."}
{"text": "Put the sweet potatoes in a bowl, cover with cling film and microwave on high for 5 mins until tender but still holding their shape. Uncover the bowl and leave to cool a little.\nMeanwhile, heat the oil in a wide non-stick frying pan and add the onions. Cook for 5-8 mins until starting to caramelise. Add the sprouts and stir-fry over a high heat until softened. Push the sprouts and onions to one side of the pan and add the sweet potatoes, squashing them down in the pan with the back of a spatula. Leave undisturbed for 5 mins until starting to crisp on the underside. Season, add the nutmeg, mix in the sprouts and onions, and flip the potato over, trying not to break it up too much. Cook for a further 5 mins until really crispy.\nMeanwhile, poach 3 eggs in a pan of barely simmering water. Serve the hash topped with poached eggs."}
{"text": "Heat a large frying pan with the olive oil and boil a large pan of salted water. Add the cubed chorizo to the frying pan and cook for 5 minutes, stirring, until the oils are released into the pan. Halve and finely slice the Brussels sprouts. Add these to the frying pan, season and cook for 10 mins, stirring now and then, until tender.\nCook the spaghetti following pack instructions. Whisk the egg yolks, single cream and milk with the grated Parmesan and a good grind of black pepper.\nWhen the pasta is cooked, drain, reserving a cup of the cooking water, and add the pasta to the frying pan. Turn the heat to very low and add the egg mixture. Toss everything together for 2-3 mins until the sauce has thickened, adding a splash more water if it looks to dry. Serve with extra Parmesan."}
{"text": "Cover the cake with jam, marzipan and ready-to-roll icing), taking the icing to the edge of the board.\nTo decorate, roll out several marble-sized balls of the 100g ready-to-roll icing to make snowballs, then set aside. Roll two larger balls, one a little bigger than the other, to make the head and body of the snowman, then leave to dry for at least 30 mins.\nMeanwhile, ice the gingerbread trees. Beat the egg white with the icing sugar to make a smooth paste. Put about one-third of the icing into another bowl, then mix in a speck of green colouring and a few drops water so that it’s fairly runny and very pale green. Spread this over three of the gingerbread trees and leave to dry. Spoon another third of the icing into a piping bag fitted with a fine writing nozzle. Pipe rough fir-tree-like branches over the remaining trees. Once the green iced trees have dried to the touch, pipe branches over those, too.\nWhen the icing has set, fix the trees onto the cake and around the edge using spots of the remaining thick royal icing. Put the smaller snowballs around and on top of the cake. Pipe eyes and a mouth onto the head of the snowman and insert the nose. Fix the snowman’s head on with a spot more icing, position him on the cake, then carefully tie a ribbon scarf with the shorter length of ribbon. This is easiest if you start with too much ribbon, tie it, then trim with scissors. To finish, attach ribbon around the base and secure woth a double-sided tape."}
{"text": "Quarter the cabbage, remove the core and shred the leaves. Blanch in a pan of boiling salted water for 3 mins, then hold under a cold tap to cool. Drain well. Heat the goose fat in a pan and sauté the shallots, rosemary sprig and garlic cloves for 5 mins, until golden. Discard the garlic and rosemary, toss in the cabbage, stir-frying until reheated. Season and serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. To make the candied walnuts, shake the walnut halves in 2 tbsp water, then toss in the sugar. Scatter over a baking sheet and bake in the oven for 6-8 mins until golden brown. Remove from the oven and allow to cool.\nCarefully peel the rind off the brie and discard. Put the gooey inside in a medium-sized bowl. Using a spoon or small whisk, whip the brie until pale and spoonable. To make the dressing, whisk the oil and vinegar together, then season.\nIn a large bowl, combine the walnuts, dates and rocket, then mix with some of the dressing. Place a spoonful of whipped brie in the middle of each serving plate and arrange the salad around it. Scatter over the croutons, drizzle with a little extra dressing and serve."}
{"text": "Make the syrup first. Gently heat all the ingredients together until the sugar dissolves, then boil for 1 min or until just thickened. Leave to cool.\nMeanwhile, trim the rounded top off the panettone (this is cook’s perks for later!), then cut the rest into 4 horizontal slices using a serrated knife. Beat the mascarpone, orange zest and caster sugar together.\nStack up the slices, drizzling a little of the orange syrup over each piece as you go, and using about 2 tbsp of the mascarpone to sandwich each layer together. Once you’ve finished stacking, cover with the rest of the mascarpone in swirls and whirls – a palette knife is the best tool for the job. Scatter with a few silver balls if you like, then serve straight away, or chill for up to 2 hrs, then scatter with the balls at the last minute."}
{"text": "Heat oven to 200C/180C fan/gas 6. Roughly halve the pastry, but make one half a tiny bit bigger. Roll the slightly smaller half out on a floured surface to a circle about 15cm in diameter. Spread over the mustard, leaving about a 2cm gap around the edge. Mix the mascarpone, breadcrumbs, chopped sage and garlic together and season generously.\nArrange a few squash slices, overlapping, to cover the mustard. Spread with some of the mascarpone mixture. Repeat, making slightly smaller circles with the squash each time, and spreading mascarpone between each layer until the top is just one slice of squash and you have made a rough dome shape on the pastry.\nThinly roll out remaining pastry. Use to cover the squash dome, gently pressing down on the veg to push out as much air as you can. Press the pastry edges to seal. \n Brush with beaten egg, then poke a tiny steam hole in the top and gently score patterns over the surface. Dip a few sage leaves in the remaining egg and stick on top. Transfer to a baking sheet and bake for 35-40 mins until a skewer poked through the steam hole goes through the veg easily."}
{"text": "Heat oven to 220C/200C fan/gas 7. Bring a large pan of water to the boil, add the sprouts and cook for 5 mins. Drain and refresh in cold water.\nToss the sprouts with all the other ingredients in a bowl and season with a pinch of salt and a good grinding of black pepper. Tip onto a large baking tray in a single layer. Put in the oven and roast for 30 mins, tossing halfway through, until the bacon is crispy and the sprouts are golden and tender."}
{"text": " For 10 shots mix 700ml tomato juice with 50ml vodka, juice from 1 lemon and a good splash of Tabasco and vegetarian Worcestershire sauce in a jug. Season then chill. To serve, pour into 10 shot glasses, add a thin cucumber stick to each as a stirrer, and top with a small spoon of creamed horseradish.\n Toast 1 tbsp each of cumin and coriander seeds and 85g hazelnuts, then whizz in a food processor until finely chopped. Mix with 50g sesame seeds and salt to taste, then serve in small bowls with 24-36 hard-boiled quails’ eggs, halved, alongside for dipping.\n Buy mini croustade cases from the supermarket, then put a small spoonful of sour cream in each case. Finely dice ripe avocados and mix with a little lime juice, some poppy seeds and finely snipped chives, then pile on top of the sour cream.\nPeel a parsnip per person, then cut into chunky chips and roast with sunflower oil and seasoning at 220C/200C fan/gas 7 for 20-30 mins until crispy and golden. Mix a 200ml tub crème fraîche with 2 tbsp grainy mustard, 2 tbsp maple syrup and some seasoning and serve the hot parsnip chips alongside for dipping.\n For the salsa, finely dice 200g fresh or canned pineapple and mix with 1 finely chopped red onion, 1 finely chopped red chilli and juice of 1-2 limes to taste. Use a 250g pack halloumi per 5-6 people, slice into chunky strips, thread onto small soaked wooden skewers and grill, turning, until crispy. Serve with the salsa.\nCook and cool bought falafel, then skewer each one with a chunk of cucumber, small cube of feta and a cherry tomato. Serve with pots of houmous and tzatziki on the side.\nTo feed a crowd, finely shred 3 peeled carrots, dice ½ a cucumber and finely slice 4 spring onions. Mix together with a squeeze of lemon juice and 1 tbsp toasted mustard seeds. To serve, pile into bought mini poppadom crisps, top with a small dollop of mango chutney and scatter with coriander leaves.\n Skewer wedges of fig and cubes of blue cheese onto small cocktail sticks or skewers, then drizzle with a little runny honey and scatter with thyme leaves to serve.\n Melt together 200g dark chocolate and 200ml double cream, then crumble in 100g leftover cooked Christmas pud (buy a vegetarian one), then chill. When firm enough, use a melon baller or roll into balls, then dip the tops in some melted white chocolate, scatter with edible decorations, then chill to firm.\n Knock up a batch of scone dough (from a packet or find recipe on bbcgoodfood.com), adding some dried cranberries and orange zest into the mix before stamping out 4cm rounds and baking. When cool, split and spread generously with orange or jaffa curd (we used Waitrose) and top with a small dollop of clotted or thick double cream."}
{"text": "For the sorbet, whizz the compote with the sugar until smooth-ish, then tip into a freezer-proof container. Freeze until solid.\nMix the cherries and the brandy and leave to soak for a few hrs.\nHeat oven to 160C/140C fan/gas 3. Line the base of a round, 20cm loosebottomed tin with baking parchment. Mix the flour, cocoa, brown sugar, baking powder, bicarb and xanthan gum in a big bowl. Whisk the oil, rice milk and agave syrup, then add to the dry ingredients and stir in with a wooden spoon. Add the cherries and any brandy, then scrape into the tin. Bake for 35-45 mins until crisp on top but fudgy in the centre. Cool in the tin.\nCarefully lift the torte onto a serving plate. Dust with cocoa and icing sugar, and serve with the cherry sorbet."}
{"text": "Heat the butter in a large frying pan and fry the beef fillet for 5 mins, turning it to seal and brown it all over. Remove from the pan and leave to cool. Add the shallots to the buttery meat juices and cook, stirring, until softened and golden. Turn off the heat and tip out two-thirds of the shallots into a bowl. Add the horseradish and some black pepper to the bowl, then blitz with a hand blender to make a coarse purée.\nMeanwhile, pour the red wine and stock into the pan with the remaining shallots. Blend the cornflour with 3 tbsp water, add to the pan with the redcurrant jelly, and stir until thickened. Season to taste and allow to bubble for at least 5 mins until it has become a sauce. Cool and chill until ready to serve.\nLay 8 slices of prosciutto in 2 overlapping rows. Spread the horseradish mixture on top and scatter evenly with the herbs. Place the fillet on top, cover the ends with the last 2 slices, and tightly wrap the prosciutto around the beef. Chill until ready to cook.\nRemove the beef from the fridge at least 30 mins before you are ready to cook it. Heat oven to 220C/200C fan/gas 7. Put the meat on a baking-parchment-lined \n and roast for 30-40 mins, depending on how well done you like it. (To test how done the beef is, insert a digital thermometer into the centre – it should read 50C for rare, 55C for medium rare and 60C for medium.) Leave to rest for 10-15 mins, then carefully slice with a very sharp knife and serve with the wine sauce. Scatter with extra thyme, if you like."}
{"text": "Boil the sprouts for 3 mins until starting to soften slightly, then drain. Fry the pancetta until crisp, then remove from the pan and set aside. Add the chestnuts and sugar, tossing in the pan, then add the stock and reduce by half. Add the sprouts and pancetta back to the pan and warm through to serve."}
{"text": "Put the milk, quartered onion, mace and bay leaves in a pan, and bring to a simmer. Turn off the heat, set aside for 1 hr to infuse, then strain.\nMeanwhile, bring a large pan of water to the boil. Tip in the cauliflower and cook for 5 mins until just tender. Drain and set aside, uncovered, in a colander to steam-dry.\nPut the pan back on the heat, then add the knob of butter and the chopped onion. Gently soften onion for 10 mins until really soft but not coloured.\nIn a medium-sized pan, melt the butter, then stir in the flour to form a paste. Cook for 2 mins, then gradually stir in the strained milk to form a smooth sauce. Bring to the boil and simmer, stirring often, until thickened and smooth. Stir in the softened onion and season well with salt and nutmeg.\nHeat oven to 220C/200C fan/gas 7. Tip the cauliflower into an ovenproof dish and pour over the sauce. Can be covered and chilled for up to 2 days at this stage or frozen. Scatter the cauliflower with the breadcrumbs, then bake for 30 mins until the sauce is bubbling and the top is golden and crisp."}
{"text": "To make the pastry, tip the flour, almonds and sugar into a food processor then pulse in the butter until the mixture resembles breadcrumbs. Pulse in up to 5 tbsp cold water until mixture comes together as a dough. Wrap in cling film and chill for 1 hr.\nTo make the filling, tip the cranberries into a pan with the sugar and cornflour and stir well. Stir in the orange curd, then cook for a few mins until thickened. Add the pears and cook a few mins more, stirring frequently. Cool.\nHeat oven to 190C/170C fan/gas 5 with a large baking sheet inside. Roll out the pastry and use to line 8 x 10cm individual Yorkshire pudding tins (or 10cm individual tart tins). Spoon in the cooled filling. Roll out the rest of the dough and stamp out 4 x 9cm rounds to make lids. Cut out the centres with a medium star cutter.\nCarefully cover half the pies with the pastry lids and place the stars on a baking tray. Crimp the edges of each pie (if using straight edged tins) with your finger and thumb, brush the pies and stars with the egg then dredge with sugar. Bake the stars for 8-10 mins and the pies for 15-20 mins until golden. Dredge with more sugar once out of the oven. Place a star on the open pies and serve with cream or ice cream."}
{"text": "Preheat the oven to 190C/gas 5/ fan 170C.Wash the turkey inside and out and dry well with kitchen paper. Season inside the bird with salt and pepper.\nCoarsely crush the peppercorns with a pestle and mortar and add the sea salt. Finely grate the lemon rind on top and mix together. Quarter the lemon and put inside the body cavity along with a few bay leaves.\nIf you are stuffing the turkey, stuff the neck end only, pushing it towards the breast. Don’t overfill, as the stuffing will expand on cooking. Any leftover stuffing can be shaped into walnut-sized balls and cooked around the turkey for the last half-hour. Secure the neck end flap with a small metal or wooden skewer.\nTie the turkey legs together with kitchen string to give it a good shape.Weigh the turkey and calculate the cooking time at 18 minutes per 450g/1lb.\nSet the turkey in a large roasting tin. Brush liberally all over with melted butter. Sprinkle the salt and pepper mix evenly over the breast and legs.\nCover the turkey loosely with a large square of foil and roast for the calculated cooking time, basting with the pan juices every hour. Half an hour before the end of the cooking time, remove the foil and string.Re-tie the legs with a rasher of bacon and arrange the rest in a lattice over the breast. Place any stuffing balls around the turkey. Spoon or siphon off 6 tbsp of pan juices into a saucepan for the gravy, then return the turkey to the oven.\nAt the end of the cooking time, transfer the turkey to a serving platter. Cover tightly with foil and leave to rest for 15-45 minutes.\nMeanwhile, make the gravy. Heat the 6 tbsp of pan juices in the saucepan. Whisk in the flour and cook for 3 minutes until golden. Gradually whisk in the turkey or chicken stock and port, cooking until the gravy is no longer lumpy. Stir in the lingonberry preserve (or cranberry sauce) and mustard and simmer for 5 minutes. Then taste the gravy and season if necessary. Skim off the fat from the juices in the roasting tin, then add about 150ml/1⁄4 pint of the pan juices to the gravy. Heat through then transfer to a warmed gravy boat.\nCarve the turkey and serve."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Put the salmon fillets in a shallow ovenproof dish in a single layer. Roughly crush the peppercorns with a pestle and mortar, or tip into a cup and crush with the end of a rolling pin. Mix with the paprika, lime zest and a little sea salt. Brush the salmon lightly with oil, then sprinkle over the pepper mix. Bake for 12-15 mins until the salmon is just cooked.\nMeanwhile, tip the chickpeas into a colander, rinse well under cold running water, then drain. Heat the oil in a pan, add the garlic, then gently cook for 5 mins without browning. Add the chickpeas and stock, then warm through. Crush the chickpeas lightly with a potato masher, then add the spinach and stir well until the leaves are wilted. Add the lime juice and some salt and pepper, then heat through. Serve with the salmon."}
{"text": "For the base, blitz the biscuits in a food processor or bash in a bag to make crumbs. Stir in the butter, then press into the base of a 22cm springform cake tin. Chill.\nFor the praline, line a tray with baking parchment and lightly oil it. Tip the caster sugar into a frying pan and place over a high heat. Cook for 5 mins, without stirring, until dissolved and you have a dark amber caramel. Throw in the chestnut pieces, then quickly tip onto the baking parchment and leave to harden. Break or chop into small pieces and set aside.\nFor the filling, blitz the chestnut purée in a food processor with the icing sugar and 1 tbsp of the rum. Set 3 tbsp of the mix aside. In a large bowl, whisk the cream with the caster sugar and vanilla until it holds its shape, then whisk in the soft cheese. Beat in the pieces of praline, then gently fold through the chestnut purée so that it ripples the cream. Spoon onto the biscuit base. Bang the cake tin gently on the work surface to level and smooth over the top. Cover with cling film and freeze for at least 12 hrs or up to 1 month.\nFor the drizzle, mix the remaining rum with the reserved chestnut purée and enough water to make it just runny. If serving the cake within 2 days, chill the drizzle; if keeping for longer, freeze and defrost when needed.\nPut the cheesecake in the fridge to thaw a little 30 mins before serving. Using a sandwich bag with a corner tip cut off, pipe the drizzle over the top of the cake in a zig-zag pattern. Carefully remove from the tin and serve in small wedges – with a glass of rum if you fancy it."}
{"text": "Put the golden caster sugar, 200ml water and ground ginger into a saucepan. Add the cinnamon stick and bring to a gentle boil. Simmer for 5 mins until the sugar has dissolved, then stir in a little edible gold glitter, if you like. Pour into a 500ml sterilised bottle (see tip below).\nTo decorate, tie a cinnamon stick around the neck with a pretty ribbon, if you like. Will keep for up to 1 year."}
{"text": "Heat oven to 180C/160C fan/gas 4. Mix the dates with the hot milk and set aside for 20 mins. Mix the raisins with the rum and do the same. Grease 9 dariole or small pudding moulds and sit them in a deep roasting tin or baking dish. Put the kettle on.\nWhizz the dates and milk together in a food processor until you have a smooth purée, then scrape into a large bowl and mix with the oil and eggs, before stirring in the bicarbonate of soda, flour and sugar. Finally fold in the rum-soaked raisins and any rum left in the bowl. Divide between the darioles, then carefully pour boiling water into the tin or dish so it comes two-thirds to halfway up the sides of the darioles. Bake for 20-25 mins on a low shelf in the oven.\nCheck the puds are done with a skewer, then lift out and cool a little. For the sauce melt the butter, sugar and cream together, then turn up the heat until it bubbles and comes together into a smooth, shiny sauce. Stir in the rum and raisins and cool. Turn out the puddings from the moulds, scraping around the sides of each with a blunt cutlery knife first. Line up in a shallow baking dish and cover with cling film. Keep the puds and sauce somewhere cool for up to 24 hrs.\nTo serve spoon a little sauce and raisins over each pud, then pour the rest around (if the sauce has separated a little just gently reheat and stir back together). Cover the whole dish with a tent of foil. When the Christmas dinner is ready turn the oven down to 120C/100C fan/gas ¼ and reheat puddings for about 30-40 mins until hot. Serve with crème fraîche."}
{"text": "Pop the onion in a pan with the milk, cream, peppercorns and bay leaves. Bring to a simmer, then turn off the heat and leave to infuse for 30 mins. Pour the milk through a sieve into a jug, then return it to a cleaned pan.\nStir in the breadcrumbs, bring back to the simmer and cook for a few mins (add a splash more milk if you like your sauce thinner). Stir in the butter, season with salt, white pepper and nutmeg, then pour into a warm serving jug or bowl. "}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease a 22cm springform cake tin with soft butter and line the bottom with baking parchment. Shake a little flour around the buttered edges.\nMelt the chocolate and butter together over a pan of simmering water, or in a microwave. Once melted, whisk together until smooth and add the espresso powder and chillies and chilli powder, if using. Whisk the egg yolks with the brown sugar and caster sugar, either in an electric mixer or with an electric hand whisk, for 5-10 mins until thick and pale. In a separate bowl, using a clean whisk, beat the egg whites and cream of tartar until soft rounded peaks form.\nPour the chocolate mixture onto the beaten yolks and sugar, and gently mix until smooth. Add the almonds and flour and mix again. Spoon the egg whites into the chocolate mixture and gently fold together. Pour the batter into the prepared tin and bake for 40-45 mins until the cake is set but with a slight jiggle in the centre. (If the cake is starting to brown too quickly, cover with a piece of baking parchment.)\nLeave to cool in the tin – it will sink a little as it cools. Run a knife around the inside of the cake tin to loosen. Remove the baking parchment and place on a cake stand. Whisk the cream and espresso powder until soft peaks form. Serve on the side or spoon on top of the cake dusted with a little cocoa powder."}
{"text": "Quarter the cabbage, then cut out the white core at the bottom and discard. Finely shred the cabbage and tip into a large mixing bowl with the onions, apples, beetroot and walnuts. Finely grate over the zest from the oranges.\nCut a little from the top and bottom of each orange, so they sit flat on your work surface. Use a small, serrated knife to cut away the peel and pith in strips down the orange. Holding each orange over a bowl, cut away the segments, letting them and any juice drop into the bowl. Squeeze any juice left in the membranes into the bowl, too. Fish out the segments, roughly chop and add to the salad.\nWhisk the red wine vinegar, redcurrant jelly, honey and oil into the orange juice with some seasoning, then stir into the salad. "}
{"text": "Once the marzipan is dry on your cake, brush it all over with water just to dampen the surface. Cut off 750g of the icing, re-wrap the rest, then dust the worktop with icing sugar. Knead the icing until pliable and smooth, then roll out and lay over the cake in the same way as you did with the marzipan (see 'Goes well with' recipe). Leave to dry completely overnight.\nFor the stars, cut the remaining icing in half. Knead a small spot of icing colour (you can always add more later) into one half until evenly pale blue. Cut in half, then work a little more colour into one piece to make it darker.\nPiece by piece, roll out the white and blue icings a little thicker than a £1 coin. Stamp out about 40 stars, re-rolling any trimmings, then push the piping nozzle or straw through the middles to make holes. Lift onto a rack, then dry in a cool, dry place for 24 hrs, or longer if you can. Once dry, knot an 80cm length of ribbon loosely at one end, then thread with stars. Untie the knot, then tie the ribbon in a bow, making sure that the stars are slanting in the same direction.\nOnce the cake is dry, pick up the wreath of stars carefully, then lay it on top of the cake. Fix the remaining ribbon around the bottom of the cake using a little tape or glue."}
{"text": "Melt 50g butter in a pan and gently fry the onion until softened. Add the garlic and thyme and fry for 1 min more. Tip in all the mushrooms and toss to coat in the butter. Cook on a high heat for 5-8 mins until soft. Pour over the brandy and lemon juice, then cook for 2-3 mins more or until all the liquid has evaporated. Turn off the heat, add the herbs and seasoning, then allow to cool.\nOnce cooled, remove the thyme. Mix the mushrooms with the remaining butter, then divide between 4 ramekins. Chill until firm, or for up to 2 days, then serve a ramekin, topped with a thyme sprig, between 2 to share with toasted bread and dressed salad leaves."}
{"text": "Tip the carrots into a deep frying pan with the butter, thyme and honey. Cook for 5 mins until starting to brown. Pour in 250ml water, bring to the boil and cook until the water has evaporated and the carrots are tender. Turn down the heat and cook the carrots slowly, stirring, until glazed."}
{"text": "Pulse the almonds in a food processor until most are finely chopped. Remove and transfer to a bowl. Whizz the figs until they form a sticky paste, then add this to the almonds with the remaining ingredients. Mix well, then shape into a sausage and allow to dry, uncovered, in the fridge or a cool, dry place for a week.\nWrap and tie in baking parchment if giving away, then slice and serve alongside your favourite cheeses. Will keep in a cool place for up to 2 months."}
{"text": "Melt the sugar, golden syrup and butter in a saucepan, then bubble for 1-2 mins. Leave to cool for about 10 mins.\nTip the flour, bicarbonate of soda and spices into a large bowl.  Add the warm syrup mixture and the egg, stir everything together, then gently knead in the bowl until smooth and streak-free. The dough will firm up once cooled. Wrap in cling film and chill for at least 30 mins.\nRemove the dough from the fridge, leave at room temperature until softened. Heat oven to 200C/180C fan/gas 6 and line two baking trays with baking parchment.\nRoll out the dough to the thickness of a £1 coin, then cut out gingerbread people with a cutter. Re-roll the excess dough and keep cutting until it’s all used up.\nLift the biscuits onto the trays and bake for 10-12 mins, swapping the trays over halfway through cooking. Leave to cool on the trays for 5 mins, then transfer to a wire rack to cool completely. Use the icing to decorate the biscuits as you wish, and stick on sweets for buttons. Leave to dry for 1-2 hrs. Will keep for up to three days in an airtight container."}
{"text": "Heat oven to 170C/150C fan/gas 3 and roast the almonds for 5-10 mins until they are a pale golden colour. Cream together the butter, sugar, rum and a pinch of salt, then add the flour until the dough just comes together – it will be soft. Roughly chop the almonds and add them to the dough. Carefully roll out the dough on a well-floured surface to a 4-5mm thickness and cut out small cookies roughly 3-4cm across. Freeze the cookies on a baking sheet for 20 mins to harden.\nBake the cookies in the oven for about 20 mins until just set – they will still be very pale. Lay out on a wire rack and dust icing sugar on both sides while they are still warm, being careful not to break them as you turn them. The icing sugar will melt. When they are cool, sprinkle them extremely generously with more icing sugar so that they are completely white. Store in an airtight container for up to 2 days, or freeze for up to 2 months."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the sausages in a bowl with the honey until all are well coated. Wrap each sausage and prune in a piece of bacon, then skewer with a cocktail stick. Put on a baking sheet and cook for 30 mins."}
{"text": "Place the raw ham in a large, clean bucket. Add enough water to cover and soak overnight, or up to 24 hrs ahead, changing the water twice.\nHeat oven to 180C/160C fan/gas 4. Drain and place the ham in a large roasting tin, cover tightly with foil and bake for 3 hrs.\nRemove the ham from the oven and turn the heat up to 200C/180C fan/gas 6.Using a sharp knife, carefully slice the rind off the ham, leaving about 1-2 cm of fat; cut a diamond-shaped pattern into this. In a small bowl, mix together the sugar and mustard, then rub all over the ham. Roast for 30 mins until the ham is tender and the outside nice and sticky.\nBring to the table on a large platter lined with bay leaves. To serve, cut 1cm-thick slices off the ham to go alongside the rye bread, pickles and mustard sauce (Make your own sauce with our recipe below)."}
{"text": "Line the base and sides of a 20cm cake tin with a round and two or three strips of plastic cut from two A4 clear plastic folders. Crush the amaretti biscuits fairly finely and mix into the melted butter, stirring well. Press into the base of the tin, smoothing with the back of a metal spoon.\nTip the cheese into a large bowl, beat briefly to soften, then beat in the sugar, lemon zest and juice. Whip the cream until it just holds its shape, then fold into the mixture.\nPour the lemon mixture into the tin and smooth the top. Freeze for 4 hours. For the topping, slice the lemons as thinly as possible. Put in a pan, cover with water and bring to the boil, reduce the heat and simmer for 20 minutes. Drain well.\nTip the sugar into a small pan and add 3 tbsp water. Heat gently to melt the sugar, then add the lemon slices, increase the heat and cook until the lemons are caramelised (about 4-5 minutes). Cool to room temperature, then arrange in overlapping circles over the top. Drizzle over any syrup, then return to the freezer. (Can be frozen for up to 2 months.)\nRemove the dessert from the freezer 2-3 hours before serving, peel off the plastic and set on a serving plate. (Timing is not too critical, as it won’t collapse, just become softer.) Tuck it away in the fridge until you are ready to serve."}
{"text": "Heat oven to 180C/160C fan/gas 4. Butter 6 x 150ml ovenproof pudding moulds and put a disc of baking parchment in the base of each.\nTo make the sponge, put the butter, chocolate and coffee in a bowl over a pan of simmering water. Gently heat until melted, add the vanilla and stir to combine. Set aside to cool a little. Sift the flour, cocoa and bicarb into another bowl, then scatter in the sugar, breaking up any clumps of sugar with your fingers. Mix the eggs and yogurt in a jug. Add the chocolate mixture and the egg mixture to the flour, and stir everything with a spatula until there are no visible lumps of flour. Divide the mixture between the 6 moulds, put on a baking tray and cook in the centre of the oven for 30 mins or until a skewer pushed into the cakes comes out clean. Leave to cool for 10 mins, then turn out onto a wire rack and cool completely. Can be made up to 5 days ahead, wrapped well in cling film and stored in a sealed container; or freeze for up to 6 weeks.\nWhile the cakes cool, make the chocolate mousse. Melt the chocolate in a small bowl over a pan of simmering water. Leave to cool for 5 mins, then stir in the egg yolk. Whisk the egg white in another bowl until stiff, add the sugar and continue to whisk until glossy and thick. Pour the cream into a third bowl and lightly whisk until thick. Tip the cream into the chocolate and stir to combine. Add the beaten egg white and, using a metal spoon, fold together until there are no streaks of egg white remaining. Chill until needed.\nLine each pudding mould with cling film. Remove the tops of the cakes with a small serrated knife to create a flat surface. Carefully split the cakes into 2 or 3 layers through their middles. Reassemble the cakes in the pudding moulds, soaking each layer of sponge with the liqueur and layering with chocolate mousse. Cover the cakes with any overhanging cling film and press down gently. Chill the cakes for at least 3 hrs or for up to 2 days before serving.\nMelt the white chocolate in a small bowl over a pan of barely simmering water. Turn each cake out and unwrap. Drizzle the top of each with a little white chocolate, letting it drizzle down the sides. Decorate using a small sprig of real or artificial holly. Leave the white chocolate to set for 20 mins before serving."}
{"text": "Bring a pan of salted water to the boil. Add the Brussels sprouts and cook for 4-5 mins until just tender, then drain and leave to cool a little before slicing in half vertically.\nMeanwhile, heat 3 tbsp olive oil in a large frying pan over a medium heat, add the garlic and cook until golden but not burnt, around 4 mins. Use a slotted spoon to remove the garlic and discard. Add the chilli flakes and a big pinch of salt to the oil, then put the sprouts cut-side down in the pan, and leave them to cook for around 10 mins. Don’t be tempted to move them – this ensures that they get some colour. Add the remaining olive oil and the lemon juice, then cook for a few mins more.\nTip onto a large serving platter, top with lemon zest and season. These will hold in a low oven for 20 mins while you get everything else ready."}
{"text": "Heat oven to 200C/180C fan/gas 6. Mix the oil and chutney together and season well. Divide everything except the sausages and herbs between two large roasting tins, pour over the oil and chutney mixture and toss together. Put both trays in the oven for 25 mins.\nAdd the sausages and herbs to the trays and bake, stirring halfway through, for 30-35 mins more or until the vegetables are soft and the sausages are cooked through. If one tray is browning more than the other, swap them round."}
{"text": "Put the red wine, cinnamon, star anise, cloves, lemon zest and sugar in a large pan. Cook on a low heat for 10 mins.\nRemove from the heat and cool, leaving to infuse for about 30 mins.\nTo serve, heat without boiling, stir in the sloe gin (if using) and pour into mugs or heatproof glasses."}
{"text": "Tip all the ingredients, except the walnuts, into a preserving pan. Warm over a low heat, stirring occasionally, until the sugar dissolves. Turn up the heat a little, then let the mixture boil until the Bramley apples have broken down to a pulp, but the eating apples still hold their shape. This can take from 45 mins to 1 hr. You can tell that it is ready by running your wooden spoon through the mixture. Your spoon should briefly leave a channel in the mixture, and there shouldn’t be liquid pooling into the space.\nMeanwhile, tip the walnuts into a small pan and cook over a low heat until they are lightly toasted, stirring frequently to ensure that they don’t burn. Sterilise your jars.\nWhen the chutney is ready, stir in the walnuts and cook briefly, then pot the mixture into the jars. Will keep for at least a year."}
{"text": "Heat oven to 200C/180C fan/gas 6. Pop the carrots in a pan of boiling water and cook for 4-5 mins until tender. Spread the carrots out in one layer on a baking tray. Carefully toss with olive oil, seasoning and half the maple syrup. Bake for 20 mins, turning once.\nNext, place the pastry rectangle on a baking parchment-lined baking sheet. Score a 1cm border. Prick the centre area with a fork and put in the oven for 12 mins with the carrots.\nFry the shallot in butter until totally soft, then stir through the mushrooms. Fry for several mins until mushrooms are tender and the mixture is dry. Spread out on a plate to cool. Whizz a third of the mushroom mixture with the nuts, cream cheese, tarragon and seasoning, so you have a coarse texture. Tip into a bowl and stir through the remaining mushroom mix.\nRemove the pastry base from the oven and gently press down the centre area with the back of a spoon. Spread the mushroom mix inside and lay the glazed carrots on top. You may need to tuck the ends round to fit the carrots in. Drizzle over the remaining maple syrup and bake for a further 12-15 mins until the pastry is golden. Sprinkle with a few tarragon leaves and some more chopped nuts to serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss all the veg with the oil and garlic in a large roasting tin, then roast for 40 mins until starting to soften and turn golden. Remove the tin from the oven, drizzle the veg with honey and return to the oven for 10-20 mins more until golden."}
{"text": "Put the first 5 ingredients into a large bowl and mix. Rub in the butter. Or you can do this in a food processor. Put 200ml milk, treacle and brandy into a pan and warm until the treacle melts. Stir well.\nBeat one of the eggs and the oil into the liquid, then add the whole lot to the dry ingredients and mix to a smooth dough. Let it sit for 10 mins, then knead for 1 min on a lightly floured surface until smooth and springy. Put into an oiled bowl, cover with oiled cling film and leave to rise in a warm place until doubled in size. Leave it overnight in the fridge instead if you have time – bring the dough back up to room temperature before step 3.\nLightly flour the work surface. Tip the dough from its bowl and press out into a rectangle about A4 size. Scatter over the fruit and zest, knead in until even, then roll out the dough to a rectangle approximately 50 x 15cm. Squash the marzipan into a cylinder, then roll into a thick sausage the same length as the dough. Sit it in the middle of the dough, wet the dough a little around the edges and roll it around the marzipan.\nHeat oven to 200C/180C fan/gas 6 and line 3 baking sheets with baking parchment. Dip a large sharp knife into some flour and slice into 14 rounds, discarding the very end bits. Flatten each bun and its marzipan middle a little with your hand. You can freeze them at this stage. Put onto the sheets well spaced, then cover with oiled cling film and leave to rise until about half their size again. Beat the second egg with 1 tbsp milk and brush it all over the buns. Sprinkle with almonds.\nHeat oven to 200C/180C fan/gas 6 and bake for 15 mins or until risen and golden. After a few mins cooling, lift onto a cooling rack. Melt the icing sugar with 4 tbsp just-boiled water, then brush the syrup all over the buns – be generous with it. Dust with a little more sugar to serve. Best eaten within 48 hrs."}
{"text": "Heat oven to 200C/180C fan/ gas 6. Put the potatoes in a pan of cold water, bring to the boil and simmer for 5 mins. Meanwhile, put the butter and oil into a large, shallow roasting tray and heat in the oven. Drain the potatoes in a colander, giving them a good shake to fluff the edges up a little. Toss in the hot oil in the tray and roast for 20 mins.\nAdd the garlic, rosemary and chipolatas to the tray, toss well together and roast for a further 50 mins until the potatoes are crunchy and golden brown and the sausages are cooked through."}
{"text": "Place the onions in a large heatproof bowl and pour over boiling water to cover. Leave to cool. Once cool, trim roots and tops and peel. Sprinkle the salt over the peeled onions, stir and leave overnight.\nNext day rinse the onions well and dry with kitchen towel. Place the vinegar and honey into a large pan and gently heat just to dissolve the honey into the vinegar, but do not boil.\nPack the onions into clean, sterilized jars. Pour over the hot vinegar mixture to fill the jars, and check there are no air pockets. Seal the jars and leave to cool. The onions will be ready to eat after about 1 month or better if kept for 2. Once opened store in the fridge."}
{"text": "Heat the oil and butter in a large, shallow ovenproof casserole dish. Add the onion and cook for 10 mins until really soft. Push the onion to one side of the dish and add the sausages, browning them all over (skip this step if you’re using cooked leftovers).\nRemove the sausages from the dish and set aside to cool a little. Stir the mustard powder, flour and stock cube into the oil and butter for 1-2 mins, then add the white wine. Bubble for 1 min, scraping the bottom of the dish to release any tasty bits, then add the stock. Stir to make a smooth sauce, season and bubble for 5 mins. Heat oven to 200C/180C fan/gas 6.\nCut the sausages and stuffing into bite-sized chunks, add to the sauce with the turkey, mustard, crème fraîche and parsley. When bubbling, remove from the heat. Crumble the potatoes in your hands over the top of the filling, so you have some larger and smaller chunks. Scatter with cheese and bake for 40 mins until the potatoes are crisp and the filling is bubbling around the edges."}
{"text": "Tear 6 slices of Serrano ham in half. Core a pear and cut into 12 slices. Place a piece of pear at the bottom of the ham slice. Add a 3cm piece of goat's cheese and a few rocket leaves. Roll up and secure with a cocktail stick."}
{"text": "Heat oven to 220C/200C fan/gas 7. Halve the pastry, then roll out each half on a lightly floured surface to about the thickness of a £1 coin. In the centre of 1 pastry sheet, spread the jelly into a circle roughly the same size as the cheese. Sit the cheese on top.\nBrush the pastry around the cheese with some beaten egg. Lift the second sheet of pastry on top and gently press over the cheese, squeezing out the air as you go, then seal it all the way around – press down with your fingers over all the excess pastry to seal really well. Use scissors to cut away excess pastry, leaving about a 4cm border around the cheese. Use the prongs of a fork to press the edges – this looks pretty and seals the pastry even more. Lift onto a baking tray lined with baking parchment. Brush all over with egg, then add a sesame-seed star, if you like.\nBake for 20-25 mins until the pastry is brown, crisp and well risen around the edges – if your star is getting too dark, cover with a square of foil after 20 mins. Sit for 5 mins before cutting and catching the cheesy centre as it oozes out."}
{"text": "Heat oven to 180C/160C fan/gas 4. To make the pastry, whizz the pecans in a food processor until finely ground, then pulse in the remaining ingredients with a pinch of salt until the dough just comes together. Lightly flour your hands to prevent sticking, then roll the dough into 12 small balls. Use your fingers to gently press them into the bottom and up the sides of a 12-hole mini muffin tin. Chill in the fridge while you make the filling.\nToast the pecans in a dry frying pan for 3-5 mins until lightly toasted and smelling aromatic. Cool a little, reserve 12 of them, then roughly chop the rest. Whisk the remaining ingredients with a pinch of salt, then stir in the chopped pecans.\nBake the pastry cases for 5 mins, then remove from the oven. If the pastry has puffed up a little, gently press it down with a teaspoon or your fingers. Spoon 1-2 tsps of the filling into each of the pastry cases, then top each with a whole pecan. Bake for 15-20 mins or until the crust turns golden and the filling is set. Leave to cool a little in the tin. Eat warm on their own, or with some cream whipped up with maple syrup."}
{"text": "Heat oven to 220C/200C fan/gas 7. Bring a pan of water to the boil, then tip in the potatoes. Cook for 4-5 mins, drain well, then return to the pan. Put on the lid and shake a couple times.\nSet a heavy-bottomed roasting tin on the hob over a medium heat and add the oil. When it’s really hot, add the potatoes and fry for a few mins.\nAdd the bacon and sprouts, mix everything together, then put in the oven and bake for 30 mins until the bacon is crisp and the sprouts are tender."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Dry the duck with kitchen paper and liberally season all over with coarse salt. Put the thyme and bay leaves inside the cavity, then place the duck on a rack over a roasting tray.\nCook for 10 mins or until the skin begins to turn golden, then reduce the heat to 180C/fan 160C/ gas 4. Cook for a further 45 mins, basting the bird with honey every 5 mins or so for the final 20 mins of cooking. Your bird will now be roasted to medium – cook 10 mins more, if you like your duck well done. Set aside to rest, uncovered, for 10 mins.\nMeanwhile, make the creamed cauliflower. In a pan, cook the caulifl ower and shallots in the butter over a low heat for 20 mins until softened and any liquid has evaporated. Spoon into a liquidiser with the cream and whizz to a purée. Season and keep warm.\nFor the garlic crisps, thinly slice the garlic cloves using a really sharp knife or a mandolin. Place the slices in a pan along with the milk and slowly bring to the boil.\nRemove from the heat and strain the garlic slices, discarding the milk (or save it for mashed potato). Leave the garlic to drain on kitchen paper. Cover the bottom of a frying pan with the oil and heat. Fry the slices, a couple at a time, until golden and crisp, then remove with a slotted spoon.\nTo serve, carve the duck and serve alongside the creamed caulifl ower and sprigs of watercress, sprinkled with the crisp garlic slices."}
{"text": "Stir the flour, spice, suet, breadcrumbs and sugar in a large bowl. Tip in the fruit, peel, cherries (if using) and carrot, then stir well to mix. Add the remaining ingredients and beat until thoroughly combined.\nSpoon the mixture into a buttered 1.2 litre pudding bowl (with a buttered disc of greaseproof paper in the bottom) and press down well, leaving room for the pudding to rise a little during steaming. Cover with a circle of buttered greaseproof paper, then cover with pudding cloth or foil and tie securely with string.\nStand the bowl on an upturned saucer in a saucepan and half fill with boiling water. Cover tightly and steam for 8 hours, topping up the water as necessary. Leave to cool in the pan.\nRemove the pudding from the pan and discard the cloth or foil and paper. Then cover with fresh greaseproof paper and cloth. Store your pudding in a cool, dry place until required - you can feed it with a few tablespoons of brandy once in a while. Before serving, steam again for 2-3 hours."}
{"text": "Heat the curry paste in a pan for 1 min. Pour in the coconut cream and stir to combine. Add the lime zest, brown sugar and lentils. Bring to a simmer and cook for 10 mins, adding a squeeze of lime juice and seasoning. Stir through a handful chopped coriander and serve with warmed naan breads. Sprinkle extra coriander on the dhal if you like. Great warm or at room temperature."}
{"text": "Heat oven 220C/200C fan/gas 7. Heat the oil in a pan and cook the onion for 5 mins until soft, then set aside to cool. In a food processor, pulse the flour and butter together until the mixture looks like crumbs, then add the sage, cooled onion and enough milk to make a soft but not sticky dough. Tip out onto a floured surface, knead briefly, then roll out to 1cm thickness. Using a 1.5cm cutter, stamp out mini scones. Brush tops with egg, put onto a baking sheet and bake for 8-10 mins until risen and golden.\nTo serve, split the scones, spread each side with cranberry sauce, then sandwich together with the turkey."}
{"text": "Push a small hole in the middle of the cupcake cases with a pencil and put aside for later.\nDip the pastry brush in the sunflower oil and paint a very thin layer of oil over the insides of the fromage frais pots.\nPut the chocolate in a bowl and heat in the microwave in 30-sec bursts until runny, stirring after each blast. Or melt it in a heatproof bowl set over a pan of simmering water (get an adult to help you). If you’re using different types of chocolate, you should melt them separately.\nCarefully pour the melted chocolate into the pots. Put a lolly stick in the middle of each and sprinkle your chosen decorations around it.\nSit a cake case on top of each pot so that it covers the chocolate and the stick pokes through the hole. Put them in the fridge to set overnight.\nThe next day, carefully pull the chocolates out of the pots and throw away the paper cases. Wrap each in cellophane tied with string and write a tag to read: ‘Simply stir into hot milk.’"}
{"text": "ICE THE CAKE: Melt the apricot jam, then sieve and brush a little all over a 23cm cake (see Apricot & almond fruitcake recipe to the right of this recipe). On a clean surface lightly dusted with a little sifted icing sugar, roll out the marzipan to a circle large enough to cover the cake – use a piece of kitchen string to help you check. Lift up the marzipan by hanging it over your rolling pin, then drape over the cake. Gently pat and smooth the marzipan down the sides of the cake, then trim any excess from the bottom.\nColour the regal icing with a little blue food colouring, then cover the marzipan using the same method as you covered the cake, firstly brushing the marzipan with more apricot jam. Trim the base.\nADD SOME SNOW: Use your hands to roll two-thirds of the remaining regal icing into a long, thin sausage on an icing sugar-dusted surface. It should be long enough to go round the cake – use a piece of kitchen string to help you measure it. Use a rolling pin to roll the sausage into a strip about 5cm wide. Use a small, sharp knife to straighten one edge, and trim the other into a wiggly edge.\nKeep all the trimmings, and squash half into 2 wobbly circles for the snowmen to sit on. Brush the strip, circles and the very bottom edge of the cake with a little runny icing made with 100g sifted icing sugar and a splash of water. Scatter the desiccated coconut over the strip and circles, gently pressing to stick and cover. Starting with one end of the strip, stick it round the base of the cake. This can be a bit fiddly, so if you’re nervous, simply halve the icing from the start and do in 2 half-length strips, using a little more coconut to hide the joins on the cake.\nSHAPE THE SNOWMEN: Roll the remaining third of regal icing into 2 large balls, 2 medium balls and 2 small balls. Stick together, squashing slightly, into 2 snowmen. Brush 4 cocktail sticks with a little brown food colouring and stick into the snowmen for arms.\nADD BUTTONS AND NOSES: Push a few whole cloves into one snowman as buttons. Use a little orange food colouring to dye a little of the strip trimmings, and shape a little around the pointy end of 2 cloves to look like carrot noses. Use another clove to make little holes where the noses will go, dab a bit of runny icing into the holes and stick on the noses, pushing them into the holes to help hold them.\nSMILEY FACES: Use a black or brown writing icing pen to dot on smiley mouths and eyes – I find it helps to mark tiny holes with the end of a cocktail stick first. It stops you making mistakes and helps the icing stay in place.\nMAKE THE HAT: Dye another lump of regal icing trimmings with food colouring (we used green). Shape most into a woolly hat shape, pressing a slight dip into the bottom with your thumb where it will sit on the snowman’s head. Roll a little ball to stick on top of the hat; attach it with more runny icing. Then roll and cut a thin strip to stick round the base of the hat. Use a cocktail stick to make markings like a woolly hat and rough up the ball on top. A little more runny icing will help it stick onto your snowman’s head.\nAND LASTLY, THE SCARF: Knot the strawberry laces together at one end. Tightly plait a 10cm length and knot at the end again. Using scissors, snip the ends, leaving about 1cm for tassels after the knot, then wrap around the neck of the other snowman. Sit the wobbly snowy islands on top of the cake and a snowman on each one."}
{"text": "Chop the parsnips into large chunks. Boil for 15 mins or until really soft, then use a slotted spoon to drain into a colander. Blanch the sprouts in the same pan.\nIn a bowl, mash the parsnips with the butter and milk, then stir through the sprouts and spring onions. Serve with a knob more butter. "}
{"text": "Rinse the lentils, then put them in a pan and cover generously with water. Bring to the boil, then turn down the heat and simmer for 25-30 mins until tender. Drain well and leave to cool. Put the shallot in a bowl with the mustard, vinegar and seasoning. Mix well and whisk in the oil.\nPut the eggs into a small pan and cover with water. Bring to the boil, then simmer for 3 mins. Cool quickly under running cold water and peel off the shells. Put in a bowl of cold water until ready to serve.\nStir the dill into the dressing and pour it over the lentils. Spoon onto 6 plates, then halve the eggs and put one half on each plate with two slices of smoked salmon. Sprinkle with black pepper, scatter over a few dill fronds and serve."}
{"text": "Cook the pearl barley with the stock cube according to pack instructions. Reserve 4 tbsp of the cooking stock, then drain the grains well. Bring a large pan of salted water to the boil, then add the parsnips, and cook until really soft. Drain well, tip back into the pan to steam dry for a few minutes, then roughly mash. Mix the ground flax or linseeds with the reserved stock water, and leave to go gluey.\nPut the butter and oil in your largest frying pan with the onions and garlic. Fry gently until soft and golden, then stir in the mushrooms, rosemary and sage. Fry the mushrooms until golden too, and any liquid that comes out has evaporated. Scrape into a big mixing bowl and set aside to cool.\nGrease a 22-24cm savarin or ring tin generously with butter, then line with thin strips of overlapping baking parchment if it’s not a non-stick tin. Add the mashed parsnip, cooked pearl barley, gluey seed mix, grated hard cheese, chopped parsley and whole hazelnuts to the fried mushroom mixture. Season generously with salt and nutmeg, then mix everything together really well. Spoon the filling into the tin, and press down firmly to fill the tin and flatten the top. Keep in the fridge for up to 24 hrs before baking.\nHeat the oven to 200C/180C fan/gas 6 and cover the tin with foil. Bake for 45 mins, until a skewer poked into the centre of the mixture comes out piping hot. Use a small palette or cutlery knife to release the filling all the way around, then sit a serving plate on top and flip over. Carefully lift off the tin, and top the wreath with some parsnip crisps and whole pumpkin seeds to serve – plus some extra rosemary sprigs if you like. Slice into wedges and enjoy."}
{"text": "Put the clementine zest and juice, vodka and honey in a pan, season and bring to a simmer. Bubble for 10 mins until reduced by half. Add the clementine slices and simmer for a further 5 mins until the clementines are softened and a little sticky. Remove them from the liquid and transfer to a plate. Bubble the liquid until thickened to a glossy glaze.\nHeat oven to 180C/160C fan/gas 4. Line a baking tray with foil or baking parchment and place the salmon in the middle – or on an angle to help it fit if you need to. Using a sharp knife, cut the salmon into 8 fillets, cutting through the flesh but not the skin, as this will hold the whole thing together. Cut the thinner end into slighter wider fillets, so everyone gets a similar portion. Brush the salmon with the glaze, making sure you get in between the gaps, and save a little for brushing on at the end. Lay the candied clementine on top, down the centre, and bake for 20 mins.\nWhile the salmon is cooking, make the beetroot crème fraîche by mixing all the ingredients together in a bowl with plenty of black pepper and a little salt – save a few chives to sprinkle on top. When the salmon is cooked, reheat the remaining glaze, adding a splash of water if it is too thick, and dab it over the top (wash the brush first as it will have come into contact with the raw salmon). Serve the salmon and sauce as part of a buffet, and let everyone dig in."}
{"text": "Grease and line a 900g loaf tin with baking parchment. Line the base with a row of biscuits. In a bowl, whisk the lemon zest and juice, mascarpone, cream, sugar and 50g lemon curd until thick and holding its shape. Transfer roughly 1 /4 of the mixture to a bowl and chill in the fridge for later.\nLayer the mascarpone and biscuits into the tin, and add the remaining lemon curd in spoonfuls between the layers. Break some biscuits to fill any gaps. You should have about four layers of biscuits, finishing with a layer of cream. Wrap the tin in cling film and chill for at least 8 hrs, or up to 48 hrs.\nWhen you’re ready to serve, unwrap the tin and turn the pudding out onto a platter or board. Peel off the parchment. Crush 4 of the mini meringues to a rubble texture and stir through the reserved mascarpone mix. Spread across the top of the pudding, then press the remaining mini meringues and lemon slices on top. Leftovers will keep for one day."}
{"text": "Heat oven to 200C/180C fan/gas 6. Unroll one of the pastry sheets onto a lightly floured surface, and spoon on teaspoonfuls of mincemeat, spaced about 2.5cm apart. Brush round the mincemeat with a little egg. Unroll the second sheet of pastry, keeping it on its wrapper, then roll out just a touch bigger. Using the wrapper to help you, flip onto the mincemeat-dotted sheet.\nPress and shape the pastry around each dollop of mincemeat, squeezing out as much air as you can. Slice up the sheet into individual parcels using a sharp knife or pizza cutter. Prick each with a fork, then seal the edges around each one by pressing with a fork. Lift onto baking trays, brush with a little more beaten egg and bake for 18-20 mins until golden and crisp.\nWhile the pies are baking, mix sugar and cinnamon on a plate. When done lift the pies, a few at a time, carefully into the sugar and gently turn to coat."}
{"text": "Bring a large pan of salted boiling water to the boil. Tip in the roots, bring back to the boil and cook for 3 mins. Drain well, then tip onto a large, lipped roasting tin. Whisk together the syrup, mustard and oil with some seasoning, then gently toss with the veg. Cover with cling film for up to 24 hrs.\nBring to room temp before cooking. After the turkey comes out, roast at 220C/200C fan/gas 7 for 30 mins until golden and sticky."}
{"text": "Heat oven to 180C/160C fan/gas 4. Tip all the mincemeat ingredients into a casserole dish or roasting tray – be sure to include half the kirsch from the jar of cherries. Mix everything together, then cover with a lid or a sheet of foil. Bake for 35-40 mins until all the sugar has melted, the mixture is bubbling slightly at the edges and the liquid has reduced (the mixture firms a bit as it cools, so be careful not to over-reduce). Set aside to cool completely. Can be made up to three days in advance and chilled in the fridge.\nTo make the pastry: tip the flour and coconut oil to a \n and pulse until the mixture resembles breadcrumbs. Add the sugar and pulse to just combine, then pour in the vodka and 2 tbsp ice-cold water and pulse until the pastry is just coming together. Add another 2 tbsp water if a little dry, then tip the dough onto a clean surface and pat into a disc with your hands. Wrap in cling film and chill in the fridge for at least 30 mins.\nTake the pastry out of the fridge. Cut off one-third of the pastry and keep covered under a tea towel. Cut the rest into five chunks and, one chunk at a time, squeeze with your hands until malleable, then roll out on a well-floured surface to a thickness of 0.5cm. Cut out circles using a 9cm cookie cutter and line 18 holes of two 12-hole cupcake tins. Repeat with the rest of the pastry chunks, re-rolling off-cuts where necessary.\nPut a heaped spoonful of mincemeat in the middle of each circle, then put the pies in the fridge. Take the remaining pastry from under the tea towel and roll out to 0.5cm thickness. Transfer to a baking sheet lined with baking parchment. Chill for 15 mins to firm up.\nHeat oven to 180C/160C fan/gas 4. Remove the pastry sheet from the fridge and use an 8cm cookie cutter to cut out nine circles, then use a star cutter to cut out the middles. Bring the mince pies out of the fridge and top half of them with the stars and the other half with the stamped-out circles. Use your fingers to seal the tops and bases, then brush the tops with milk. Bake for 30 mins until the pastry is crisp and the tops are golden. Cool a little, then dust with a little icing sugar to serve."}
{"text": "Trim and discard the cauliflower leaves. Turn the cauliflower upside-down on a chopping board and use your knife to carefully cut out the stalk and core, leaving a cavity – the florets should still be holding together.\nBring a large pan of salted water to the boil. Submerge the cauliflower and cook for 7 mins, then remove with two slotted spoons and set aside to steam dry. Add the kale to the pan and cook for a min or so until wilted. Drain, then run under cold water to cool. Squeeze out the excess liquid and roughly chop.\nTo make a linseed ‘egg’ (this will bind the stuffing together), mix the ground linseed with 3 tbsp water and set aside for 5-10 mins until gluey. Meanwhile, heat 2 tbsp oil in a frying pan, add the onion and a pinch of salt, and cook until softened, then stir in the remaining stuffing ingredients, including the kale, and cook for a min or so more. Remove from the heat and season, then put in a \n with 150ml water and the linseed egg and blitz to a thick purée. Transfer to a piping bag.\n \nPipe the stuffing mixture into every nook and cranny of the cauliflower, getting in as much of the purée as you can – see our tip below. Transfer to a baking tray lined with parchment. Can be made up to this point in the morning and kept in the fridge.\nHeat oven to 200C/180C fan/gas 6. Mix the remaining chestnuts with the breadcrumbs and some seasoning. Spoon the remaining oil all over the cauliflower, then pat on the breadcrumb chestnut mix. Roast for 45 mins until golden brown and tender (place under a hot grill for the last part of cooking time if it needs to crisp-up). Serve with any crisp bits that have fallen onto the baking tray."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Heat half the oil in a medium frying pan, then gently fry the onions for 12-15 mins until softened and lightly browned. Tip the onions into a bowl and mix with the artichoke hearts, season if you like and set aside. Heat the remaining oil in the same pan (there’s no need to clean it) over a high-ish heat. Add the mushrooms, then stir-fry for 2-3 mins until soft, throw in the garlic and thyme and continue to cook for a minute. Remove from the heat, season well and allow to cool.\nOn a floured surface, roll out the pastry into a rough circle about 40cm in diameter and drape over a large baking sheet.\nPile the onions and artichokes into the middle of the pastry and spread them out evenly, leaving a 10cm border around the edge, then pile the mushrooms on top.\nBring the edges of the pastry up over the filling. Brush the exposed pastry edge with the egg glaze. Bake for 20-25 mins until the pastry is crisp and golden brown. Sprinkle with parsley and serve immediately with the sour cream and relish."}
{"text": "Whisk the dressing ingredients in a jug, season with salt and set aside.\nTo make the salad, peel the clementines and slice whole. In a bowl, gently toss the chicory and watercress with the fennel and onion. Place slices of clementine on opposite sides of each plate, mound a pile of leaves in the middle, then scatter over the feta. Stir the parsley through the dressing and drizzle over the salad."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Bring a large pan of water to the boil, then cook the peppers for 5 mins. Remove and drain, cut side down, on some kitchen paper.\nHeat 1 tbsp of the oil in a frying pan and cook the onion for 3 mins until tender. Add the cumin and chilli or cayenne pepper and cook for a further 2-3 mins. Add the courgette, then cook for 4 mins until tender.\nRemove from the heat, then stir in the sweetcorn, avocado, cheese, coriander and seasoning. Spoon the filling into the peppers, then stand them in a baking dish. Drizzle with remaining oil, then bake for 30-35 mins until the peppers are very soft.\nLeave to stand for about 5 mins, then serve warm with soured cream, a chilli bean salad and corn chips."}
{"text": ": Put about half the flour in a food processor with the butter. Whizz until you can’t see any lumps of butter remaining (if you don’t have a food processor, rub the butter into all of the flour with your fingertips, until it resembles fine crumbs). Tip the buttery flour into your largest mixing bowl and mix in the remaining flour, spices and bicarbonate of soda with a pinch of salt. Stir in the sugar.\nWhisk the eggs with the golden syrup and stir into the flour mixture with a wooden spoon. Using your hands, knead together into a smooth dough. Use straight away, or chill or freeze until ready to bake.\n Heat oven to 200C/180C fan/gas 6. Roll out a quarter of the dough at a time on a sheet of baking parchment, to the thickness of 2 x £1 coins. Use a small, sharp knife to cut around the cottage templates (see the 'try' section below to print off the template) – remember that each time you’ll need 2 x ROOF, 2 x END and 2 x SIDE for one cottage. Remove the trimmings and lift the gingerbread, on its parchment, onto baking trays. Re-roll trimmings to cut out all the shapes you need.\n Bake the gingerbread one tray at a time (so it cooks evenly), on a high shelf in the oven for 8-12 mins, until rich brown and firm to the touch. Give each tray 3-5 mins to cool, then carefully sit the templates back onto the relevant shapes and trim any edges to neaten \n. Keep these trimmings for nibbles. Use a small knife, or heart-shaped cutters, to cut out any doors and windows you want to have. If you want to fill your cottage with lights, use the end of one of the SIDE templates to cut out a little door in the back END of the cottage.\nFor a roof like ours, roll out remaining gingerbread to about half the thickness of the walls. Use a 3-4cm cutter to stamp out rounds – to fully cover the roofs, you will need about 75 round biscuit tiles. Bake as above, but for 6-9 mins – as they are thinner, they will bake quicker. Let all the biscuits cool completely.\n Sift 250g of the icing sugar into a bowl, dribble in water, stirring in until you have a thick-ish icing. Tip the preserving sugar or pearl sugar into a shallow bowl and get a couple of cooling racks ready. Dip the round roof tile biscuits into the icing, one by one – covering about a quarter of the biscuit in icing \n. It looks nice if they’re all a bit higgledy-piggledy. Dip into the preserving sugar to stick, then sit on the cooling racks and leave to dry.\nPut the egg whites in a large bowl, sift in the remaining 500g of icing sugar, then stir to make a thick, smooth icing. Spoon a little into a piping bag with a very small nozzle. Spoon half of the rest into a piping bag that has a slightly larger nozzle (or spoon into large food bags and, when ready to ice, snip off the corner to turn into a piping bag). Keep the rest covered in the bowl. Use the small piping bag to pipe any icing decorations you want onto the END that is going to be the front of your cottage. Leave to dry.\n Arrange the wall biscuits as you are going to assemble them. Swap to the big bag of icing with a medium nozzle to pipe generous snakes of icing along the SIDE edges \n and stick the walls together. Pipe extra icing where the walls join each other on the inside of the cottage, and support the sides using your icing balls \n.\nTo decorate the roof, scrape any excess icing and sugar from the underside of the roof tiles with a small knife, so they can lie flat. Start at the bottom of one and work along in a row, using the icing in the bowl, spread good-sized blobs of icing on the underside of the top of each tile biscuit to stick \n. Let the bottom row overhang the edge of the ROOF. Continue working up, sticking a row at a time, sitting the row above in the gaps of the row below, so the tiles sit in a diamond pattern rather than straight lines down the ROOF \n. You’ll need to cut some of the tiles on the edges to fit – just use a big sharp knife and be brave (you should have a few spares available in case you have any accidents). Repeat to cover the second ROOF, then leave the completed ROOFS with the half-built cottage for a few hrs at least, or preferably overnight, until set.\nWhen ready, remove the supports from the cottage and stick on the ROOFS \n. This bit can be fiddly, so you may need an extra pair of hands. Shape your icing balls to support the bottoms of the ROOFS. Hold the biscuits on firmly for a few mins until the icing starts to set \n. Set again for a few hrs, or overnight.\n To finish decorating like ours, roll marble-sized balls of the ready-to-roll icing and stick them along the ROOF top – this is perfect for hiding the join. To make the icicles, start with the nozzle at a 90-degree angle to the ROOF and squeeze out a pea-sized blob of icing. Keeping the pressure on, pull the nozzle down and then off – the icing will pull away, leaving a pointy trail. Repeat all around the front of the cottage, covering the gap between the ROOF and roof tiles too, if you like."}
{"text": "Put the potatoes in a pan of cold water with a little salt. Bring to the boil, cook for 3-4 mins until nearly tender, then drain and set aside.\nMeanwhile, heat 1/2 tbsp oil in a large, non-stick frying pan. Cook the onion for 8-10 mins over a low heat until soft. Add the potatoes and sausagemeat, turn the heat up to medium and brown everything for 5-6 mins. Scatter the kale over and wilt for 2 mins, then stir in the sage.\nPour in the remaining oil and push the hash to one side of the pan to make room for the eggs. Crack the eggs in and fry to your liking. Divide the hash between two bowls and top with a fried egg."}
{"text": "Put the mascarpone, double cream, caster sugar and sherry in a bowl and whisk until thick enough to hold its shape. Break 200g of the after-dinner mints into small pieces, then beat these into the cream mixture. Spoon into tiny glasses or bowls and chill until needed. Add 1 more thin after-dinner mint to each dessert before serving"}
{"text": "Using a sharp knife, thinly slice each potato about two-thirds through, so the bottom of the potato holds the slices together. One way of doing this is to insert a metal skewer through the length of each potato, close to the base, before slicing. Sit the potato on a chopping board with the skewer nearest the board, then thinly slice down. Pull out the skewer and move on to the next spud.\nHeat the fat in a large roasting tin in the oven for 5 mins, then carefully roll in the potatoes with some sea salt. Roast at 200C/180C fan/ gas 6 along with the turkey for its final 30 mins. When you take the turkey out to rest, increase heat to 220C/200C fan/ gas 7, give the tin a good shake and roast potatoes for a further 30 mins until crisp and cooked through."}
{"text": "Lightly oil a 20cm square brownie tin with coconut oil and line the base with baking parchment. Melt the chocolate with the coconut oil and golden syrup in the microwave in 30-second bursts until smooth and glossy.\nBreak the ginger nuts into small pieces in a bowl, then add the dried cranberries and pistachios. Scrape in the chocolate mixture and give everything a good mix to combine, then spoon the tiffin into the tin. Use the back of the spoon to smooth out the top and press it down, then chill in the fridge for 2 hrs or until set hard. Once set, cut into 25 mini squares. Will keep for a week in the fridge."}
{"text": "Melt the butter in a small pan, add the onion and cook until soft, about 8 mins. Leave to cool.\nMix the onion with the remaining ingredients, apart from the oil – the best way to do this is with your hands. Roll the stuffing mixture into 24 walnut-sized balls and put on a baking tray. \n.\nWhen the turkey comes out of the oven, turn the heat up to 220C/200C fan/ gas 7. Drizzle the stuffing with oil and cook on a middle shelf for 30 mins. Swap to the top shelf for the final 10 mins if they need browning."}
{"text": "Heat oven to 190C/170C fan/gas 5. Wash and dry the turkey, removing any feathers. Lift up the skin that covers the neck opening, then push the stuffing up and under the skin, securing it tightly underneath with a skewer or 2 cocktail sticks. Weigh stuffed turkey, then calculate cooking time, allowing 40 mins per kg (20 mins per lb). Put a few pieces of onion and a few herbs into the cavity, then tie the legs together with string.\nPut the remaining onions in a single layer in the tin, then add a good bed of herbs. Add the neck and all of the other giblets, except for the liver, to the tin, then sit the turkey on top of the herby onions. Coat the breast all over with butter. Pour the wine into the tin, cover with foil, then roast according to your timings. Keep checking the tin – if it looks a little dry, add a splash of water. While the bird cooks, mix the salt, crushed green peppercorns and thyme leaves.\nThirty mins before the end of cooking, remove the foil. Brush the turkey again with butter, then scatter over and press in the salt, pepper and thyme mix. Roast for the remaining cooking time, uncovered, until golden. To be reassured that the turkey is ready, pierce thigh through its thickest part; the juices should run clear. If not, give it 15 mins more and test again. Remove the turkey from the tin and leave to rest without covering (this will keep skin crisp). The turkey will stay hot for up to an hour, so there’s no need to panic.\nNow make the gravy. Drain the fat and juices from the tin into a jug, keeping the onions but discarding the neck and giblets. Place the tin on the hob, then pour in the wine, scraping up the flavour-filled crusty bits with a wooden spoon. Reduce until the wine has almost all disappeared. Spoon the fat from the juices and discard, then add the juices, onions and stock to the tin. Boil down for about 5 mins until reduced and a little syrupy, stir in redcurrant jelly, then season. Strain into a jug; any resting juices should go in now, too. Lift the turkey onto a platter with the Bacon-wrapped sausages (see recipe below), dotting herb sprigs around to decorate. Serve with cranberry and bread sauces."}
{"text": "Bash 6 cardamom pods in a pestle and mortar until they split.\nMelt the marmalade in a pan, then whisk in the vodka. Add the crushed pods. Don’t boil the mix, simply warm it for a few mins. Leave to infuse off the heat for 20 mins, then strain.\nAdd the Cointreau and lemon juice and chill (or keep in the freezer). Serve in glasses with a little more marmalade in the bottom, ice and a cardamom pod floating on top."}
{"text": "The day before, soak 4 wooden skewers in water for 20 mins. Wash the ducks inside and out with cold water, drain and pat dry with kitchen paper. Mix together the sugar, star anise, ginger, spring onions and a few good pinches of salt, then use this to fill the cavities. Close the cavities with wooden skewers and set aside.\nIn a small bowl, mix the maltose and 2 tbsp of the vinegar. Add the remaining vinegar to a jug of boiling water and pour over the ducks. (The boiling water opens up the pores, while the vinegar helps to strip some of the waxiness from the skin, so it will be more receptive to the maltose, which adds sweetness and a lacquered caramel colour.) Smear the maltose mixture over the ducks, then place them in a large plastic container and put in the fridge overnight, uncovered.\nTo cook, heat oven to 220C/200C fan/ gas 7. (Fan ovens are particularly effective for roasting duck.) Put a little water in the bottom of a large roasting tin, place the ducks on a rack over the top and cover with foil. Roast for about 45 mins. Take off the foil and roast for another 45 mins – the duck must be well done, there is no such thing as a rare Chinese roast duck! Take the duck out of the oven and let it rest for a good 20 mins before carving."}
{"text": "First make the stuffing. Pour the madeira or wine into a bowl, then crumble in the mushrooms. Fry the onions in the butter for 10 mins, until golden. Cool, then mix with the thyme leaves, the mushrooms and their soaking liquid, and all remaining ingredients, apart from 8 of the chestnuts and the bacon. Season well.\nSet aside half of the stuffing. Line a greased 500g loaf tin with bacon. Pack the rest of the stuffing into the tin, then bring the rashers round over the top and secure in place with cocktail sticks. Use the reserved chestnuts to fill the spaces where the bacon meets. Chill until ready to cook. This will keep in the fridge uncooked for 2 days or can be frozen for up to a month.\nPrepare the turkey. The night before, put the onion quarters, reserved lemon halves and thyme sprigs in the cavity between the legs. Pack the reserved stuffing into the neck end. Secure the neck skin with skewers and tie the legs together. Weigh the turkey. Calculate the cooking time at 40 mins per kilo, plus 20 mins.\nPut a large sheet of extra-wide foil in a large roasting tin and put the turkey on top. Smear the breast with the butter, then grate over half of the nutmeg and season well. Cover with bacon, then pour over the glass of madeira or wine. Seal the foil well to make a parcel. Chill overnight.\nOn the day, take the turkey out of the fridge 1 hr before roasting. Heat oven to 190C/fan 170C/gas 5. Put the turkey in the oven; then, 90 mins before the end of cooking, remove foil and bacon, and drain off the juices from the tin to use in the gravy. To test whether the turkey is cooked, push a skewer into the thickest part of the thigh – the juices should run clear. If they are pinkish, cook for 15 mins more, then test again.\nTransfer the turkey to a platter, cover with foil, then a couple of tea towels, and allow to rest for at least 30 mins before carving. Meanwhile, cook the stuffing loaf for 30 mins and reheat the bacon. Garnish with watercress and serve the stuffing loaf separately."}
{"text": "Beat the eggs and yolk with the vanilla. In a large bowl, mix the flour, yeast, sugar and ½ tsp salt. Add the warm milk and egg mixture, then beat to a very soft, sticky dough with a wooden spoon. Cover with cling film and leave in a warm place until the dough has doubled in size.\nDrop large muffin wraps into 10 clean, 200g size cans (or use a muffin tray), or line them carefully with baking parchment so that the paper comes well above the cans to make a collar.\nBlend the butter, fruit and peel into the risen dough, preferably with your hands. Cut into 10 equal pieces and drop a piece into each prepared can. Cover again and leave until they are very well risen.\nHeat oven to 190C/170C fan/gas 5. Gently brush the panettone with milk, scatter over the almonds and bake for 25-30 mins until golden. "}
{"text": "Fry the pancetta in a large non-stick frying pan for 4-5 mins until crispy and golden, then add the Brussels sprouts and cook for a further min. Pour in the chicken stock and simmer for 15-20 mins until the sprouts are tender and the stock has reduced. Melt in the butter, season well and serve."}
{"text": "Beat the butter with sifted icing sugar and a little green food colouring. Spread the mixture on an 18-20cm square sponge or chocolate cake. Use matchstick chocolates or black liquorice laces to mark the branches of a Christmas tree, then dot on assorted chocolates to look like decorations."}
{"text": "To make the gratin, peel and slice the potatoes no thicker than a 50p piece using a mandolin, if you have one. Bring the milk, cream, garlic, herbs and some seasoning to the boil in a large saucepan, then turn down the heat and simmer for a few mins.\nSlip the potatoes into the hot milk mixture and simmer for 10 mins until just cooked. Drain the potatoes in a colander over a bowl to catch the liquid – reserve the milk. While the potatoes are simmering, heat half the butter in a frying pan until foaming. Fry the mushrooms for 2 mins until just wilted, season with salt and pepper and set aside.\nRub 2 small gratin dishes (or 1 medium) with the remaining butter, sprinkle over the thyme leaves and grate over some of the cheese. Fill the dishes halfway with potato slices, moisten with a little milk and grate over more cheese. Fill up the dishes with potato slices, add enough milk to cover, then top with the mushrooms and the rest of the cheese.\nFor the chicken, mix about two-thirds of the butter with the lemon zest and half the juice, the parsley, paprika and some salt and pepper. Lift the skin slightly away from each breast, spread or pipe the flavoured butter under the skin, then stretch the skin back over. Chill up to a day in advance, if you like.\nHeat oven to 220C/200C fan/gas 7. Heat the remaining butter in an ovenproof frying pan until foaming. Pan-fry the chicken, basting constantly with the butter until starting to brown. Add the shallot, garlic, thyme and stock. Place the chicken, skin-side up in its pan, on the higher shelf of the oven, and the gratins on the lower shelf. Roast both for 25-30 mins, then remove the chicken and rest for 15 mins, while the gratins continue to cook.\nTo finish, remove the chicken from the pan. Place the pan back on the heat, squeeze over the remaining lemon juice and bring everything to a hard boil. Pass the sauce through a sieve, pressing down firmly on all the soft shallot and garlic. Heat a drizzle of olive oil in another frying pan and reheat the leeks until they start to colour. With the gratins cooked, you are now ready to plate up.\nLine six leeks up in a row in the middle of each plate. Carve the chicken on a slant into five thick slices. Neatly fan out each chicken breast over the leeks. Spoon the sauce over the chicken and around the leeks, and serve with the potato gratin."}
{"text": "Heat oven to 220C/200C fan/gas 7. Toss the parsnips and potatoes in 2 tbsp of the olive oil and tip into a roasting tin along with the garlic cloves. Roast for 40 mins or until the veg is completely soft. Remove from the oven and leave to cool a little. Squeeze the garlic from their skins, then discard the skins. Tip everything into a \n, along with the nutmeg, flour and nutritional yeast, season well, then pulse until well combined and holding together as a dough.\nBring a large pan of salted water to the boil. Tip the dough onto a floured surface, cut into four chunks and roll each into a sausage about 35cm long and 2.5cm wide. Use the back of a table knife to cut each sausage into small pillow-shaped gnocchi, each around 2cm long. Cook the gnocchi in batches for 1 min or until they float to the surface. Remove from the water with a slotted spoon and drain on kitchen paper.\nIn a frying pan, heat the rest of the oil over a medium heat until shimmering. Add half the gnocchi and fry until lightly golden on each side, around 3-4 mins. Transfer them to a tray using a slotted spoon while you cook the second batch. When all the gnocchi are golden, return them all to the pan to warm through before dividing between four plates. Sprinkle over some black pepper, then top with the thyme leaves, toasted walnuts and a drizzle of olive oil, if you like."}
{"text": "Put the potatoes, garlic and bay leaves in a large lidded sauté pan. Pour over the wine, add the butter and put the lid on the pan. Set over a medium heat and simmer for 1 hr until the wine has completely evaporated and the potatoes are coated in the buttery juices.\nReduce heat to low, then sizzle the potatoes in the buttery mixture, shaking the pan and turning the potatoes occasionally until they are completely cooked through, and the skins are brown and crisp. Serve scooped straight from the pan with a sprinkling of sea salt."}
{"text": "In a mixer using the blade attachment, cream together the butter and sugar. Add the eggs, one at a time, and mix for 4 mins. Add the flour, baking powder and milk, and mix for a further 4 mins on slow, then mix in the chocolate.\nHeat oven to 200C/180C fan/gas 6. Cut 16 squares of baking parchment big enough to act as cases for the holes of your muffin tins. Using a piping bag or a spoon, fill the muffin cases with the mixture. When all the cases are filled, share the cherries equally between the muffins, pushing them into the mixture as you go. Bake for 25 mins, then serve warm or cold."}
{"text": "Place the chestnuts and berries in a small pan, pour over enough water to just cover. Bring to the boil then remove from the heat, cover and leave to infuse until cool. Once cool, drain chestnuts and discard berries. Meanwhile, heat the oil in a medium-size pan and fry the onion until soft. Add the fennel and cook for 3-4 mins.\nHeat oven to 180C/160C fan/gas 4. Grease a 1lb loaf tin with oil. Transfer mixture to a mixing bowl and stir in the chestnuts and remaining ingredients with some seasoning. Put into the tin, smooth the top a bit, and cook for 35-40 mins until light golden. Leave to cool for a few mins in the tin before removing.\nWhile it’s cooking make the cranberry relish. Place the cranberries in a small pan and pour over 150ml of water. Bring to the boil and cook until they’re soft. Reduce the heat and add the sugar. Simmer until the mixture has thickened. Remove from the heat and allow to cool. Add the orange and serve with the loaf."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Line two baking sheets with baking parchment. Unroll one of the pastry sheets onto a lightly floured surface, with the long edge nearest you. Spread with mincemeat, top with the second sheet of pastry, then cut in half, widthways, down the middle.\nFor each piece, cut into 4 strips down, measuring 6cm, 4cm, 2cm, and 1cm in width. Next, cut across evenly to make 12 ‘ladders’ of pastry. Dip the knife in flour if it sticks. Brush with egg. Chill for 10 mins.\nBuild the trees on the baking sheets. Stack the strips, mincemeat middles facing up, starting with the longest and finishing with the smallest. It helps them look more tree- like if you fold them a little in the middle, too. Once stacked, squash with your hand to flatten into a tree shape. Can be frozen for up to a month. Bake for 20 mins (25 mins from frozen) or until the pastry is golden and the mincemeat bubbling. Leave to cool on the tray for 5 mins, then lift onto a wire rack with a palette knife and let cool completely. Dust with icing sugar to serve."}
{"text": "Gradually mix the Madeira into the flour until smooth. Heat the stock in a pan, then pour in the flour mixture and mustard, stirring until thickened. Chill until ready to serve, covering the surface with cling film to stop a skin forming. On the day, reheat in a pan with the turkey juices until bubbling."}
{"text": "Quarter the red cabbage and remove the core, then finely shred. Tip into a large pan with the red onion, brown sugar, cider vinegar, red wine, butter and cinnamon stick and season well. Bring to a simmer, then cover with a lid, lower the heat and cook for 1 1/ 2 hrs, stirring every so often. Remove the lid and continue cooking for 30 mins until tender. "}
{"text": "Wash and cut up the apples into small chunks, leaving the peel and cores in. Tip the apple into a large pan with the spices, orange peel and bay leaves, reserving 2 star anise, 4 cloves and 2 bay leaves for the jars. Cover with 600ml water. Bring to the boil, then turn down the heat and simmer with a lid on for 1 1⁄2 hrs.\nPour the apple mixture into a jelly bag or a sieve lined with muslin or a J-cloth, suspended over a large bowl. Leave to drip for 2 hrs (until it stops dripping) or overnight. Do not be tempted to push the liquid though the sieve or your jelly will become cloudy.\nMeasure the juice – you should have about 600ml. Pour the liquid into a large pan along with the jam sugar and vinegar.\nSet over a low heat to dissolve the sugar, stirring constantly. Once dissolved, turn up the heat and bring to the boil. Boil rapidly for 15 mins, or until setting point is reached, skimming away any scum that rises to the surface.\nPour jelly into hot sterilised jars and place a star anise, bay leaf and 2 cloves into each jar. Chill for 3-4 hrs or overnight until set."}
{"text": "Peel, core and roughly chop the apples and pineapple. Peel and roughly chop the onions. Mix together the apples, pineapple, onions, cranberries, dates, raisins, garlic and ginger.\nPut the mix of fruit and vegetables in batches through the food processor until finely chopped. Tip into a large wide pan or preserving pan.\nAdd the spices, salt and vinegar and bring to the boil. Simmer for 20 mins until the apple is pulpy, then add the sugar and stir to dissolve. Bring to theboil, then simmer for about 40-45 mins, until the chutney is thick and pulpy.\nPot into warm, sterilised jars. Seal, label and store for at least a month in a cool dry place."}
{"text": "Soak the dried mushrooms in 350ml boiling water and set aside until needed. Blitz ¾ of the chestnuts with 150ml water until creamy. Roughly chop the remaining chestnuts.\nHeat 2 tbsp olive oil in a large \n. Fry the shallots with a pinch of salt until softened, then add the garlic, chopped chestnuts and rosemary, and fry for 2 mins more. Add the wild mushrooms, 2 tbsp oil and some seasoning. Cook for 3 mins until they begin to soften. Drain and roughly chop the dried mushrooms (reserve the soaking liquid), then add those too, along with the soy sauce, and fry for 2 mins more.\n the wine, reserved mushroom liquid and chestnut cream together to create a sauce. Season, then add half to the mushroom mixture in the pan and cook for 1 min until the sauce becomes glossy. Remove and discard the rosemary sprigs, then set the mixture aside.\nHeat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil and get a large bowl of ice water ready. Drop the lasagne sheets into the boiling water for 2 mins or until pliable and a little cooked, then immediately plunge them into the cold water. Using your fingers, carefully separate the sheets and transfer to a clean tea towel. Spread a good spoonful of the sauce on the bottom two thirds of each sheet, then, rolling away from yourself, roll up the shorter ends. Cut each roll in half, then position the rolls of pasta cut-side up in a pie dish that you are happy to serve from at the table. If you have any mushroom sauce remaining after you’ve rolled up all the sheets, simply push it into some of the exposed rolls of pasta.\nPour the rest of the sauce over the top of the pasta, then bake for 10 mins or until the pasta no longer has any resistance when tested with a skewer.\nMeanwhile, put the breadcrumbs, the last 2 tbsp olive oil, sage leaves and some seasoning in a bowl, and toss everything together. Scatter the rotolo with the crumbs and sage, then bake for another 10 mins, until the top is golden and the sage leaves are crispy. Leave to cool for 10 mins to allow the pasta to absorb the sauce, then drizzle with a little truffle oil, if you like, before taking your dish to the table."}
{"text": "Put the sugar, golden syrup and butter in a saucepan. Bring to a simmer, then bubble for 1-2 mins, stirring until well combined. Set aside to cool for 10 mins.\nTip the flour, bicarbonate of soda and spices into a large bowl. Add the warm syrup mixture and the egg, stir to bring everything together, then gently knead in the bowl until smooth and streak-free. The dough will feel a little soft now, but will firm up once cooled. Wrap the dough in cling film and chill for at least 30 mins.\nRemove the dough from the fridge and and leave at room temperature until softened. Heat oven to 200C/180C fan/gas 6 and line two baking trays with baking parchment.\nWorking with half the dough at a time (keeping the remaining dough well wrapped), roll out to the thickness of a £1 coin, keeping the dough in a rough rectangle shape. Cut the dough into long strips, roughly 8cm wide, then cut each strip into ‘jumpers’ (see step-by-step). Cut out a V-neck for the collar and trim slim triangular pieces from either side to create sleeves (see step-by-step). Continue rolling and shaping the dough until you have about 20 jumper shapes. Arrange over the trays and bake for 8 mins until a few shades darker and puffed up a little. Cool on the trays for 5 mins, then transfer to a wire rack to cool completely. Un-iced, the biscuits will keep in a sealed container for up to 2 weeks.\nFor ‘flooded’ biscuits, mix 100g fondant icing sugar with enough water to make a thick but pipeable icing – it should hold its shape when piped. Transfer the icing to a piping bag fitted with a fine round nozzle and pipe a line around the edge of each biscuit. If you have any icing left, tip it back into a bowl and add the remaining icing sugar, then add enough water to make an icing a little looser than the first batch, but not too runny. Divide the icing between as many bowls as the number of colours you’d like to use, then add a tiny bit of colouring to each and mix well until you have a vivid colour.\nIf you have disposable piping bags, transfer the icings to different bags and secure the open ends (see tip).\nTo pipe your jumpers using the 'flooding' method, pipe the runnier icing onto the biscuit, then use a cocktail stick to encourage it to fill every corner up to the piped border. Once dry, you can add details like fluffy collars and cuffs or spots and stripes with the thicker icing.\nTo pipe your jumpers with a cable knit effect, pipe lines of coloured icing (we used white) vertically across the jumper. Use a toothpick to drag up and down through the icing to create a wave effect.\nFinish off with sugar sprinkles if desired - we used mini gingerbread men, snowflakes, white ‘mimosa’ balls and gold polka dot sprinkles (see tip)."}
{"text": "Heat oven to 170C/150C fan/gas 3-4. Line 2 baking trays with baking parchment. Melt butter, sugar and syrup in a pan, stirring until the sugar melts. Take off the heat. Sieve the flour, bicarb and ground ginger into a bowl, pour in the wet ingredients and add the stem ginger. Stir to make a stiff dough.\nRoll the warm dough out on a surface dusted with flour until about ½cm thick. Stamp out biscuits using a cutter, lift onto the baking trays and cook for 10 mins or until golden. Cool completely, then lift off parchment. \nPack the biscuits in an airtight box, bag or jar, then put in a gift box with the cups and coffee and tie with a ribbon."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line one baking sheet with parchment. Place the flour, baking powder, butter, fennel and poppy seeds with ½ tsp salt in a food processor, then whizz for a minute until the butter is completely mixed with the flour. Add 100ml water and pulse until the mixture comes together to a firm dough that’s not sticky – you may need another tbsp or so of water, if it still feels.\nRoll out dough on a lightly floured surface as thinly as you can. Stamp out lots of different sized circles using a selection of round and fluted biscuit cutters of 4cm, 5cm and 6cm diameter. Brush a little milk over the surface of the biscuits, and prick all over with a fork. Start to arrange in a circle on the baking sheet, overlapping each other. If you want to serve a cheese in the centre, check that it will fit. Scatter over a few more fennel and poppy seeds and bake for 15 - 20 mins until the biscuits feel dry and sandy with a slightly golden colour around the edges - they may still feel soft but will harden up when cooling. Cool on the baking sheet. Serve with cheese & chutney. Will keep in an airtight container for up to 2 weeks."}
{"text": "Put the dates, raisins, milk and brandy or rum in a small saucepan and bring to the boil. Simmer for 5 mins until the fruit is soft and the liquid has been absorbed – don’t worry if it looks a little curdled. Leave to cool. Meanwhile, generously butter a 1.2-litre pudding basin.\nTo prepare your steamer, place a snugly fitting upturned bowl or saucer in the base of a large, deep saucepan, big enough to hold your pudding basin. Cut out a large circle of baking parchment and one of foil, both 5cm wider than the rim of your pudding basin. Make a sharp pleat down the centre of both, then butter one side of the parchment – this will be your lid. Set aside. Boil the kettle for the steamer.\nIn a mixing bowl, beat the butter and sugar with an electric whisk until pale and fluffy. Add the eggs, beating again until well combined. Finally, add the flour, mixed spice, orange zest, date mixture and a pinch of salt, and stir everything well with a spatula until there are no visible lumps of flour. Tip the cake mixture into your pudding basin. Cover the bowl with the parchment, butter-side down and pleat on top, then the foil. Push the sides of the lid down, then tie a piece of string securely under the lip of the basin. Use any overhanging string to create a handle to help you lift the pudding.\nStand the pudding basin on top of the upturned bowl or saucer in the saucepan and fill the pan with enough boiling water to come halfway up the side of the basin. Bring to a gentle simmer, then cover the pan with a lid and leave to steam for 2½ hrs, topping up with boiling water if the level gets low. Check the pudding is cooked by inserting a skewer into the centre. If the skewer has any uncooked mixture on it, return it to the pan to steam for another 15 mins, then check again. Once cooked, you can cover the pudding with clean baking parchment and foil and keep for up to a week. Re-steam the pudding for 1 hr before serving."}
{"text": "Put the cream and milk into a large pan and gently bring to just below boiling point. Meanwhile, in a large bowl, whisk together the yolks, cornflour, sugar, clementine zest and juice. Gradually pour on the hot milk mixture, whisking the sugar mixture constantly.\nWipe out the saucepan and pour the custard mixture back into it. Heat gently, stirring with a wooden spoon, until the custard is thickened, coating the spoon. Eat hot or cold."}
{"text": "Put all the ingredients for the pudding into a big bowl and stir together until well mixed. Don’t be put off by the consistency of the mixture – it is quite wet. Lightly oil a 1.5 litre pudding basin. Tip the mixture into this and press down. Make a cover for the pudding basin using a double layer each of oiled greaseproof paper and aluminium foil. Make a pleat in the middle of these sheets to allow for expansion of the pudding. Press it over the top of the pudding basin and secure it well with a double piece of string. Use a little extra string to make a handle for ease of lifting in and out of the boiling water.\nCook the pudding in a large pan with a well-fitting lid. There should be enough boiling water to come two-thirds up the sides of the basin at all times – so keep an eye on it. Cook the pudding for 3 hrs.\nTo make the topping, cook the cranberries in the maple syrup until they burst open and become syrupy. Once the pudding is cooked, remove the cover and carefully tip it onto a large serving plate. Spoon the hot cranberry and maple syrup over the top and serve straight away."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line the holes of a 12-hole muffin tin with paper cases.\nBeat the butter, sugar and vanilla in a medium bowl using an electric mixer until light and fluffy.\nBeat the eggs into the butter mixture one at a time. Add half the sifted flours and half the buttermilk, and mix on low speed until just combined. Mix in the remaining flours and buttermilk.\nDivide the mix evenly among the paper cases. Gently smooth the tops (this will help the cupcakes to rise evenly).\nBake for 25-30 mins or until lightly golden and cooked when tested with a skewer. Allow to stand for 5 mins in the tin before transferring to a wire rack to cool.\nTo make the ganache, put the chocolate in a bowl, bring the cream to a simmer and pour it over the chocolate. Stir until smooth. Cool until firm.\nIce the cupcakes with ganache, then with brown fondant icing. Use the rest of the colours for the ears, eye and nose. Attach ears to the head by pushing a 3cm piece of spaghetti a little way into the ear, then pushing the other end into the head. See below to download more detailed instructions. Remember to warn people that not every element of the decoration is edible!"}
{"text": "Break cauliflower into florets, cutting any larger ones into thin slices. Mix with carrots, red onion, capers and chopped parsley. Whisk white wine vinegar with Dijon mustard, season, then whisk in olive oil and mayonnaise.\nPour over the salad and mix well. Can be stored in the fridge for up to 3 days."}
{"text": "Heat oven to 160C/fan 140C/gas 4 and grease and line a deep, 20cm round cake tin. Whizz the chocolate in a food processor until crumbs. Tip the flour, sugar, cocoa, oil, 150ml soured cream, eggs, vanilla and 150ml water into the largest mixing bowl you have. Whisk with an electric whisk until smooth, then quickly stir in 150g of your whizzed-up chocolate bits. Scrape into a tin, and bake on the middle shelf for 1 hr 20-1 hr 30 mins, or until a skewer inserted in the centre comes out clean. Cool in the tin.\nWhile the cake is baking, make the icing. Combine remaining chocolate bits and soured cream with 2 tbsp soft brown sugar in a small saucepan and heat, stirring, until the chocolate is melted and you have a smooth icing. Leave to cool.\nWhen the cake is cool, slice it into 3 even layers. Spread 2 layers with chocolate icing.\nTo make the angel frosting, put the sugar, vanilla and liquid glucose in a pan with 125ml water. Bring to the boil and cook just until the sugar has melted and the syrup turns clear. Take off the heat. Meanwhile, beat the egg whites until stiff, then continue beating, gradually pouring in the hot sugar syrup in a steady stream, until the mixture is fluffy and thick enough to spread – this might take a few mins as the mixture cools. Beat in the icing sugar. Work quickly and spread a tiny bit over each chocolate-covered layer. Assemble cake and swirl remaining frosting over entire cake."}
