{"text": "Cut the apples in half widthways. Remove and discard cores, then stand the apples in a microwave-safe dish. Break the marzipan into small chunks and mix with the mincemeat and lemon zest. Spoon into the centre of the apples and pour over the lemon juice.\nCover the dish with cling film, pierce several times and microwave on High for 4½ minutes. If you don't have a turntable and the apples are not cooking evenly, turn the dish halfway through.\nRemove the cling film and leave to stand for 5 minutes before serving."}
{"text": "Brush the top of the Christmas cake with honey. Roll out the marzipan, then trim to fit the top of the cake, using the cake itself or the cake tin as a template. Lay the marzipan on top of the cake, then press down lightly.\nLightly beat the egg whites with a fork, just to break them up, then gradually beat in the sifted icing sugar until you have an icing that forms soft peaks. Beat in the glycerine to stop the icing from getting too hard. Spread and thickly swirl the icing over the marzipan, then scatter with silver dragees. Decorate by wrapping round a silver ribbon and then the clear snowflake ribbon."}
{"text": "First soak the dried porcini in 400ml of kettle-hot water and set aside. Pat the beef fillet with kitchen paper to dry it of any blood then season with salt and then heavily with black pepper. Heat the olive oil in a large frying pan until very hot then spend 8-10 mins searing and turning the fillet with tongs until it’s well browned on all sides. Hold it up to sear both ends as well. Set the beef aside on a tray to catch any juices and turn the heat off the pan but don’t clean it.\nDrain and squeeze out the dried porcini but reserve the juice and tip the porcini into a food processor with the other mushrooms and thyme. Season everything with salt and pepper and pulse until finely chopped but not completely smooth. Place the beef pan back on the heat with the butter and when it starts to sizzle add the shallot and cook for 2 mins until softened. Turn the heat up and tip in the mushrooms, add a splash of Worcestershire sauce and cook everything for 10-12 mins until you have a paste that comes away from the side of the pan. Tip into a bowl to cool, stir through the parmesan if using and set aside. Turn off the heat from the pan but don’t clean it. The beef can be seared and the mushroom mixture can be made several hours in advance.\nFor the first stage of assembly get a large sheet of cling film and overlap the prosciutto slices on it in a row, tip the mushroom mix on top then cover with another sheet of cling film. Either with your hands or a rolling pin, pat it down or roll it out to a thin layer that just covers the prosciutto. Remove the top sheet of cling film and sit the fillet down the centre of the mushrooms. Using the edge of the cling film lift and roll the prosciutto and mushrooms to encase the beef then use the cling film to roll everything into a tight sausage. For the best results now place the sausage in the freezer for 30 mins to firm up – do not leave for longer of cooking times will be affected.\nOn a lightly floured surface, roll the pastry to a rectangle a little larger than a magazine, trim the edges to neaten and save the trimmings. Lightly brush the pastry all over with beaten egg. Carefully unwrap the prosciutto parcel and lay in the middle of the pastry. Like wrapping a parcel or making a spring roll fold the shorter edges over the fillet then roll the whole thing around the fillet to encase. For a really neat finish get another clean sheet of cling film and roll the Wellington into a sausage tight sausage again. Place in the fridge and chill for at least 30 mins or up to a day.\nHeat oven to 220C/200C fan/gas 7 with a sturdy, lightly oiled baking tray in it. Re-roll the pastry trimmings and use to make 6 leaves. Unwrap the Wellington, brush all over with egg then decorate with the leaves. Brush the leaves with more egg. Sprinkle with flaky sea salt and transfer, sealed side down to the heated baking tray. Bake the for 10 mins then reduce the heat of the oven to 200C/180C fan/gas 6 and continue to bake for 25 mins for rare meat, 30 mins for medium rare, 35 mins for medium and about 45 mins for well-done, making sure the pastry doesn’t burn (you can cover it with foil if it starts to become too dark. Remove from the oven and leave for 10 mins to relax.\nTo make the gravy, heat the butter in the mushroom pan and fry the shallot, thyme and bay, scraping the crispy bits of the pan with a wooden spoon. Scatter over the flour and brown then splash in the brandy, sizzle for a minute, then add the red wine and boil to a purple paste. Pour in the mushroom soaking liquid, avoiding the gritty bits at the bottom, crumble in the stock cube and any juice from the resting beef and simmer for 5 mins until you have a tasty gravy, season to taste.\nUsing a very sharp knife carefully carve the Wellington into 6 thick slices. You can trim the pastry ends and serve them separately. Serve on heated plates with a jug of gravy."}
{"text": "To make the tangerine curd: place the tangerine zest and juice in a saucepan and bring to the boil, reduce by half before mixing in the caster sugar and chopped butter. Once the butter has melted, let it cool for a few minutes then gradually mix in the egg yolks. Stir over a low heat for 3-4 minutes until thickened. This stage can also be achieved in a bowl set over a pan of simmering water, stirring continuously for 20-25 minutes until thickened. Once thickened transfer to a clean bowl and leave to cool slightly before covering with cling film or greaseproof paper. Alternatively, store in a sterilised jar.\nTo make the ice cream: whisk the crème fraîche and yogurt into the curd and flavour with Grand Marnier. The mix can now be churned in an ice cream maker for 20 minutes before freezing. An alternative method is to freeze the mix for several hours without churning, but you do need to stir it every 20 minutes to break up the crystals until it sets properly. If this second method is followed, remove the ice cream from the freezer about 20-30 minutes before serving to loosen its consistency.\nTo make the syrup: boil together the tangerine zest and juice with the caster sugar and allow to reduce by a third before adding the Grand Marnier. Mix the arrowroot or cornflour with the orange juice or water and whisk into the simmering syrup. Once returned to a gentle simmer, cook for just 2 minutes before removing from the heat. The candied orange peel, if using, can be added while the syrup is warm. Allow to cool. An alternative method is to reheat the syrup just before serving, adding the peel while the syrup is warming.\nTo make the meringues: preheat the oven to 120C/Gas ½/fan oven 100C. Whisk the egg whites to soft peaks, then gradually whisk in two-thirds of the caster sugar. Continue to whisk to reach stiff peaks. The remaining sugar can now be added. Continue to whisk until the meringue has a good thick creamy consistency. The cornflour and lemon juice can now be whisked in, whisking for another minute.\nThe meringues can be kept naturally shaped by spooning individual portions on to lightly oiled parchment paper on a baking tray. Or spoon the meringue into a piping bag fitted with a 1cm/½in plain tube and piping large domes onto the paper. Whichever choice is made, it is important to leave ample space between the meringues to allow them to swell and rise. These can now be baked for 45-50 minutes, about 1 hour maximum. During this time they will take on a light colour, forming a crisp shell that coats the marshmallow centre. The meringues can be cooked at a higher temperature - 150C/Gas 2/fan oven 130C - to give slightly more colour. If so, cooking time will be slightly less, around 40-45 minutes.\nWhen assembling the dish there are two options: if dome-shaped meringues have been made, it is best to crack the tops, placing five or six tangerine segments on top of each if using. The ice cream can now be scooped or scrolled using a warm tablespoon, before sitting on top of the meringue. The syrup with candied fruit can now be drizzled over to finish. The alternative is to simply sit the ice cream and meringue side by side, decorating with segments, if using, and drizzling over the syrup. Whichever you choose, either can be finished with a light dusting of icing sugar, if desired, and perhaps a leaf or sprig of holly."}
{"text": "Cook the green beans in boiling, salted water for 3-4 mins, until just tender. Drain and cool under cold running water. This can be done the day before – just keep the beans covered in the fridge.\nWhen you’re ready to eat, heat the butter in a large frying pan until foaming, add the shallots and cook for 4-5 mins, until soft but not coloured. Throw in the beans and toss to coat. Cook for 1-2 mins until heated through, then season. Serve with the pork."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toast the mustard seeds in a dry pan on the hob for a few mins until they begin to pop. Carefully (as it will spit) add the vinegar, sugar and seasoning, then stir to dissolve. Leave to cool, then drizzle the dressing over the vegetables and give everything a stir. Can be stored in an airtight container in the fridge for up to 7 days.\nToss the nuts with the rest of the ingredients, except the rosemary, and season generously. Spread out on a baking tray and roast for 15 mins, stirring once. Add the rosemary and roast for 5-10 mins more until the nuts are golden – keep an eye on them as they burn easily.\nAllow to cool completely, stirring occasionally to stop them from sticking. Can be stored in an airtight container in the fridge for up to 7 days. Sprinkle over the slaw before serving."}
{"text": "Heat grill to a medium-high setting. Cook the bacon under the grill until really crisp, turning halfway through cooking. Remove, drain on kitchen paper and leave to cool.\nPut the bacon in a food processor and whizz until finely chopped. Add the butter and some black pepper, and blend again until combined. Transfer to a dish, or roll in cling film and chill for up to 3 days, or freeze for 2 months.\nBring a large pan of salted water to the boil. Add the kale and cook for 3-4 mins until tender. Drain well, then top with half the butter (see tip, below), and toss to help it melt and coat the kale."}
{"text": "Heat the oil in a large lidded pan, then gently cook the onion and juniper for 10 mins until the onion has softened, but not coloured. Tip in the cabbage and fry for 10 mins, stirring, until it just starts to cook down. Pour in the apple juice, season to taste, then cover and leave to simmer for 45 mins, stirring occasionally, until the cabbage is tender and the liquid has almost all gone.\nAdd the cranberries, turn up the heat a little and continue to cook for about 5 mins until they have burst. Check the seasoning and serve."}
{"text": "Preheat the oven to 190C/gas 5/fan 170C. Roll the pastry out to a 5 mm thickness (as thin as you can for a delicate crust). Use to line a 23cm shallow loosebottomed flan tin and leave the pastry hanging over the sides. Prick the base and chill or freeze for at least 30 minutes.\nIn a large bowl, mix the treacle with the golden syrup, lime zest and juice, and rum. Stir in the breadcrumbs and coconut. Put the flan tin on a baking sheet. Spread the syrupy filling over the pastry base. Bake for 15 minutes, then turn the oven down to 160C/gas 3/fan 140C (to stop the mixture bubbling over) and bake for another 15 minutes, until the filling is just set and the pastry starting to brown at the edges.\nMeanwhile, whisk the rum, cream and icing sugar together until the mixture stands in soft peaks and the whisk leaves a trail. Transfer to a bowl, cover and chill until needed. Cool the tart slightly before trimming the pastry edges with a sharp knife. Serve warm with the rum cream."}
{"text": "Melt the butter with the bay leaf in a pan or in a bowl in the microwave for 1 min. Add the shrimps, mace, a good pinch of cayenne pepper, the lemon juice and some seasoning. Mix everything together well.\nTip the mixture into a shallow soufflé or gratin dish, or a jar, put the bay leaf on top and sprinkle with a pinch extra cayenne. Chill for at least 2 hrs, or up to 3 days before serving."}
{"text": "Heat oven to 220C/200C fan/gas 8. Halve the pittas and cut into wedges. Brush with 2 tbsp olive oil; sprinkle with salt and chopped dill. Cook for 10-12 mins until crisp.\nFlake the hot smoked trout fillets and mix with soured cream, chopped gherkins and chopped dill. Serve with the crisps."}
{"text": "THE DAY BEOFRE: Take a pheasant, fully extend one of its legs, and cut through the skin attaching it to the breast. Note where it's hinged to the carcass and sever between the two joints. Repeat with the other leg. Turn the bird over on to its breast and cut away the backbone where it's attached to the breast. Poultry shears are best for this, but strong scissors or a knife will do. Reveal the wishbone and cut it free, then break away as much of the carcass as you can, leaving the whole two-sided breast (the crown) intact. You will need to sever two more little joints to free the crown entirely and trim off a few flappy, fine ribs from below the breasts, then remove any yellow fat, bits of skin, shot or bloody parts from the crown itself. Repeat with the other two pheasants, then wrap each crown in cling film and put in the fridge.\nPreheat the oven to 140C/gas 1/fan 120C. Tidy up the legs, then wipe them with damp kitchen paper. Pack the legs skin-side down into a roasting tin or baking dish just large enough to take them in a single layer. Strew with the juniper berries, herbs, garlic and salt and pepper, then pour in enough oil to barely cover. Roast for about 2 hours or until very tender, turning the legs halfway through.\nWhen the legs are cooked, remove them from the oven and leave to cool immersed in their cooking fat before refrigerating (still in the fat) overnight.\nIN THE MORNING: When you are ready to finish the cooking, bring both crowns and legs to room temperature, and preheat the oven to 230C/gas 8/fan 210C. Season the crowns well with salt and pepper. Cut the wodge of pancetta in half widthways, separate the half slices, then drape them across the crowns to cover them completely. Scrape off all the gubbins from the legs and discard.\nPut the crowns in a roasting tin, leaving enough space for the legs, and roast for 12 minutes. Add the legs and roast for 8-15 minutes more, depending on the size of the birds and how you like your game cooked. Leave the pheasants to rest in a warm place for 5-10 minutes before slicing the whole breast off each side of the crowns and serving with the legs and pancetta."}
{"text": "Shave the light brown crust from the outside of the French stick with a bread knife and discard it. Cut the bready centre into cubes, about 5cm across.\nIn a saucepan, bring the milk, onion, bay leaf, butter, allspice and 3 tbsp of cream to the boil, reduce the heat then add the diced bread.\nGently simmer, uncovered, for 5 minutes. Add a little salt and freshly ground black pepper, then allow to cool and remove the onion and bay leaf. The sauce can be refrigerated in a covered container overnight.\nTo serve, warm through gently in a pan, adding extra double cream to give a light, creamy consistency. Grind over some black pepper and serve."}
{"text": "Toast the nuts and make the dressing first as they will need to cool. Heat oven to 200C/180C fan/gas 6. Put the walnuts onto a baking tray and toast for 5 mins or until dark golden. Cool. Put the wine or Port in a small saucepan with the vinegar and sugar. Boil for 3 mins or until slightly syrupy (it will thicken as it cools, so don’t get carried away), then take off the heat and set aside.\nWhen ready to serve, shave thin slices from the pears using a large sharp knife, mandolin or potato peeler. Mingle them together with the leaves, bresaola, cheese and nuts on a large platter. Season the dressing, then drizzle over the salad, followed by the oil. Enjoy straight away."}
{"text": "Heat oven to 220C/200C fan/gas 7. Halve the parsnips, then cut the thicker end in two lengthways. Boil for 5 mins, then drain well and leave to steam-dry for a few mins. Meanwhile, pour the oil into a shallow roasting tin or a lipped baking tray and heat in the oven for 3 mins.\nRemove the tin from the oven and carefully add the parsnips to the hot oil. Turn them to coat, and make sure they aren’t overcrowded (otherwise they won’t crisp up). Roast for 30-35 mins or until golden and crisp, turning them halfway through the cooking time.\nAbout 10 mins before the parsnips are ready, tip the sugar and 2 tbsp water into a small frying pan. Heat very gently until the sugar has dissolved. Turn up the heat and bring the liquid to the boil. Measure 3½ tbsp cold water into a jug. Keep swirling the pan around until the sugar reaches a rich, dark-reddish caramel colour, then remove from the heat. Stand well back and add the water (it will splutter!). Return to the heat, add the butter and the salt, and stir to remove any lumps. The caramel should be runny, so add a splash more water if needed. Pile the parsnips into a serving dish, then drizzle over the salted caramel."}
{"text": "Bring a large pan of water to the boil, then drop in the green beans and cook for 4-5 mins until they are just cooked but still bright green and with a slight crunch.\nWhile the beans are cooking, heat the butter in a large shallow pan and soften the shallot. Add the mustard and crème fraîche, and bring to a simmer to combine. Add the drained beans and lemon juice, stir until evenly coated, then serve straight away."}
{"text": "Heat oven to 180C/160C fan/gas 4. Heat the butter or oil in a flameproof casserole dish and gently cook the onion for 15 mins until just starting to turn golden. Add the rice and cranberries, and stir a few times until coated. Season well and pour over the stock.\nFloat the bay leaves and thyme on top of the stock, and put a circle of baking parchment on top of that. Cover with a lid and put in the oven for 45 mins until the rice is tender. Stir through the parsley, almonds and orange zest. Serve hot, or leave to go cold and serve as a salad, dressed with olive oil and lemon juice."}
{"text": "Cut the cucumber on the diagonal into slices about 0.5-1cm thick. Twist the strips of salmon around the cucumber slices, then arrange on a serving plate.\nMix together the crème fraîche, lemon juice and a little salt, then dollop a little on top of the salmon. Sprinkle over some black pepper and lemon zest before serving."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the sprouts on a large baking tray, drizzle with oil and season, then roll around the tray to help the seasoning stick. Tear each slice of pancetta in half and wrap each piece around a sprout - you won't have enough to wrap each one. Roast for 20 mins.\nMeanwhile, whizz the cheese (only 1 tbsp of the Parmesan), milk and cornflour together in a food processor. Stir through the mustard, then transfer to a shallow baking dish or an ovenproof pan (ours was 15cm across and 3cm deep) and scatter with the remaining Parmesan. Reduce oven to 160C/140C fan/gas 3 after the sprouts have had their initial cooking time. Place the cheese dish on the top shelf of the oven and bake for 15 mins, with the sprouts on the tray below.\nRemove the sprouts and turn on the grill. Cook the fondue under the hot grill for 2-3 mins until golden brown. Serve the fondue with skewers for dunking the sprouts and chunks of bread."}
{"text": "Half-fill each of 6 glasses with champagne, then carefully pour in the orange juice until the glass is full."}
{"text": "Peel the carrots and celeriac and grate in a food processor. Mix together with the onion and nuts. Whisk the oil and vinegar with some mustard, salt and pepper and toss with the salad immediately to stop the celeriac going brown. Cover and keep in the fridge for up to a day."}
{"text": "Preheat oven to 190C/gas 5/fan 170C. Peel the potatoes and cut into big chunks. Put them in a large saucepan of boiling salted water, sprinkle in the turmeric and give a good stir. Bring back to the boil, then cover and simmer the potatoes for 4 minutes.\nPour the oil into a roasting tin and put in the oven to heat through for 5minutes. Drain the potatoes well in a colander and give a gentle shake to rough up the surfaces a bit – but not too much or they’ll break up. This rougher surface will give you crisper potatoes.\nCarefully tip the potatoes into the hot fat in the roasting tin, tossing with a big metal spoon to coat. Scatter with a light sprinkling of paprika and roast, without turning, for about 11⁄4 hours or until golden and crisp. Sprinkle the potatoes with Maldon sea salt flakes and freshly ground black pepper and serve immediately"}
{"text": "Heat oven to 200C/180C fan/gas 6. Finely chop the leaves from 2 rosemary sprigs and mix with the oil, maple syrup and plenty of seasoning. Toss with the butternut squash on a large baking tray and roast for 20 mins.\nRoughly chop the pecans so they stay pretty chunky. Break the remaining rosemary sprig into shorter sprigs, then scatter with the pecans over the squash, and toss together, turning over the squash wedges. Return to the oven for another 20 mins until the squash is tender and caramelising at the edges. Serve straight away, or at room temperature."}
{"text": "Mix all the ingredients for the dressing together with some seasoning. Combine the salad leaves, fennel, apple and dill in a large bowl. Just before serving, pour over the dressing and toss together."}
{"text": "Heat oven to 200C/180C fan/gas 6. Cut the polenta into 18 chunky chips and the prosciutto into 18 strips. Put the polenta in a bowl along with the oil and a good grinding of pepper, and mix together. Wrap a strip of prosciutto around a polenta chip, then pop onto a baking tray. Repeat with the remaining chips and sprinkle over the Parmesan.\nBake for 25-30 mins until golden, turning them over after 15 mins. Serve with tomato ketchup, if you like."}
{"text": "Squeeze any excess water out of the grated potatoes, then tip into a bowl and mix well with the egg, flour, baking powder, onion and chopped sage leaves. Season well. Heat 2 tbsp oil in a large non-stick frying pan over a medium heat, and spoon the mixture in to make 4 röstis, flattening them down with the back of a spoon into disc shapes. Cook for 5 mins each side until golden brown and crisp, then drain on kitchen paper. Can be made up to 8 hrs in advance and kept in the fridge (see tip).\nWhen ready to serve, heat the remaining 1 tbsp oil in the frying pan over a medium heat. Add the whole sage leaves and cook for 20 secs until crisp but still green. Drain on kitchen paper and top each rösti with a fried sage leaf."}
{"text": "Mix the yogurt and mustard together, then spread over the bread and top with the beetroot slices, overlapping them to make an even base.\nFor the pastrami tartines, cover the beetroot completely with the pastrami slices, then cut each into six fingers and top each one with a sliver of gherkin.\nFor the mackerel tartines, cut each piece of bread into eight squares. Top with the mackerel and red onion, then snip over some of the dill. Keep them chilled until ready to serve. "}
{"text": "If your gammon needs to be soaked to draw out some of the salt (ask your butcher), place in a clean bucket or a preserving pan and cover with cold water. Chill overnight, or for up to 3 days.\nHeat oven to 160C/140C fan/gas 3. If the ham has been soaking, drain it well and place in a large, deep-sided roasting tin. Pour in the apple juice and top up with 400ml water. Add the spices, bay leaves and orange zest. Cover the ham tightly with a few large sheets of foil, scrunching it around the edges of the tin so no steam can escape, then bake for 5 hrs. Meanwhile, mix together the ingredients for the glaze in a saucepan, then bubble until reduced to a sticky glaze. Score the apples around their equator with a small, sharp knife.\nRemove the ham from the oven and increase the temperature to 200C/180C fan/ gas 6. Carefully transfer the ham to a board – the easiest way to do this is to leave it to cool for 10 mins, then pop on clean washing- up gloves to lift it. Pour away the cooking liquid and discard the aromatics. Use a small, sharp knife to cut and peel away the rind, leaving a thin layer of fat attached to the meat. Line your roasting tin with a few sheets of foil and place the ham in the middle, fat-side up. Use a sharp knife to lightly score the fat in a criss-cross pattern. Return the ham to the oven and bake for 30 mins until the fat starts to crisp and caramelise.\nIf the glaze has become a little thick, splash in a drop of water to loosen it, then brush all over the ham. Place the whole apples in the tin too, and return to the oven for another 20-30 mins, basting the ham every now and then, until dark and sticky all over.\nBefore serving, mash the whole apples (discard the stalks, skin and pips) with a little of the sticky sauce from the roasting tin. We decorated our ham with star anise, sprayed with edible gold spray, and arranged bay leaves and orange peel around the board. Serve warm slices of the ham with the apple sauce, or cold in sandwiches. Will keep for up to 1 week in the fridge, or slice and store in the freezer for up to 2 months."}
{"text": "Put the potatoes and milk into a medium pan, add water to just cover, season, then bring to the boil. Simmer for 15 mins or until tender. Add the rosemary a few mins before the end of cooking to infuse. Drain off all but a few tbsp of the cooking liquid.\nRoughly crush the spuds, fold in the truffle oil and cream, then tip into a small baking dish, adding a few rosemary leaves to decorate. Flash under the grill for a few mins to colour the top. If making ahead, reheat in the oven at 200C/fan 180C/gas 6 for 15 mins until just bubbling and starting to turn golden."}
{"text": "Put the milk and clotted cream into a non-stick pan. Scrape out the seeds from the vanilla pod, add pod and seeds to the milk and cream, and bring almost to the boil. Set aside for 20 mins.\nCream the egg yolks and sugar together in a bowl. Bring the milk and cream back to the boil, remove the vanilla pod, then pour the mixture onto the egg yolks, stirring all the time.\nStrain the mixture back into the cleaned-out pan and cook over a gentle heat, stirring constantly, until the mixture has thickened and lightly coats the back of a wooden spoon. Do not let the mixture boil or it will curdle. Pour back into the bowl and leave to cool, then cover and chill overnight. The next day, churn in an ice-cream maker, stirring the stem ginger and syrup into the mixture just before freezing. If you do not have an ice cream machine, you can pour the mixture into a shallow container, cover and freeze until firm but not rock hard, then whizz in a food processor until smooth. Re-freeze and repeat the process 2-3 times more. Store in the freezer until needed."}
{"text": "Whisk together the mustard, vinegar and oil in a small bowl until well combined. Stir in the double cream. Peel the celeriac and cut into really fine strips using a mandolin or very sharp knife. Then cut into matchsticks about 5cm long. Mix into the dressing along with the parsley.\nCut each prosciutto slice in half down the middle, then cut each piece lengthways so that you have 4 small strips. Place 1 tsp of the celeriac mixture onto each strip, then roll them up tightly. Secure each strip with a toothpick, place on a plate and leave in the fridge for at least 20 mins to firm up. Can be made a few hours ahead and kept in the fridge until ready to serve."}
{"text": "Heat oven to 150C/fan 130C/gas 2. In a small pan, bring the cream to the boil with the orange peel, then set aside to infuse. Tip 140g/5oz sugar into another saucepan with just enough water to make it sludgy. Bring to the boil, then turn the heat down to a simmer and boil to make a darkish caramel. Add 2 tbsp of the orange liqueur (watch out as it will splutter). Leave it to settle slightly, then pour the caramel over the base of 6 x 250ml ramekins and set aside.\nBeat the cream cheese and the remaining 85g/3oz sugar together in a large bowl, then beat in the eggs and the remaining orange liqueur. Strain in the infused cream, then beat everything together to make a custard. Skim off any froth and set aside.\nBoil the kettle. Place the ramekins in a deep roasting tin. Divide the custard between them – it will only come to halfway – then bring the tin to the oven and fill with hot water from the kettle so it comes halfway up the outside of the ramekin dishes. Bake the cheesecakes for 40 mins or until just set, then remove from the oven and the tin. Leave to cool, then chill at least overnight. These can be made up to 2 days ahead and left to chill.\nUp to 2 days before serving, make the bases. Crumble the biscuits into a food processor, then blitz to fine crumbs. Add the melted butter and pulse until everything is mixed. Line a flat baking tray with greaseproof paper, tip the base mix onto it, then top with another sheet of greaseproof paper. Gently roll the mix out until large enough to cut 6 bases the same size as the ramekins out of it. Chill.\nTo make the caramel squiggles, heat the sugar with a little water in a saucepan and boil to make caramel, then set aside to cool slightly. Line a tray with baking parchment and grease with a little oil. Drizzle the caramel up and down so that all the strands of caramel stick together to create stars, then leave to set.\nTo serve, use a cutter the same diameter as the ramekin to cut out 6 bases from the biscuit mix. Lift the bases onto 6 plates. Unmould the cheesecakes, saving the caramel sauce in the ramekin. Top the bases with the crème caramels, drizzle the sauce over and around the plates, garnish with a star and serve."}
{"text": "Mix a few drops of peppermint into the white, red and green icing. Divide the white icing in 2 and wrap half in cling film along with the green icing.\nRoll the remaining half of white icing into a long, thin sausage shape, then do the same with the red icing. Lay the 2 sausages next to each other, and twist together. Gently roll the twisted length with the palm of your hand until the 2 sausages are joined and smooth. Slice into 12cm lengths, then bend the end of each one to make a hook. Line a baking sheet with baking parchment, then spread out the candy canes. Repeat with the remaining white icing and green icing, then leave the canes to dry out for at least 24 hrs before packaging."}
{"text": "Heat the goose fat in a frying pan and toss in the bread, with a the parsley sprigs, turning until golden and crisp. Drain on kitchen paper, season well and keep warm, uncovered."}
{"text": "Preheat the oven to 200C/Gas 6/fan oven 180C. Scoop the potatoes into balls, rinsing well once all are cut. The potatoes can now be dried on a clean tea towel ready for pan-frying.\nHeat 2 tablespoons of cooking oil in large frying pan and pan fry 2-3 handfuls of potatoes on a medium to high heat until golden brown, then transfer to a roasting tray. Repeat until all are coloured. The potatoes can now be finished in the oven for 15-20 minutes until they're tender.\nOnce the potatoes are cooked, remove the tray from the oven, add the butter and season with salt and pepper. The Noisette potatoes are now ready to serve."}
{"text": "Arrange the leeks in a wide, lidded pan, so they’re no more than 2 leeks deep at any point, then pour over enough boiling water to cover. Cover the pan and cook for 4-6 mins until just tender. Drain, refresh in cold water, then drain again. Now set aside until you are ready to serve.\nWhizz the nuts in a food processor until finely chopped but not powdery, or chop by hand. Mix with the oil, citrus juices and vinegar. Season well.\nTo serve, heat a griddle or frying pan and toss the leeks in some oil. Griddle batches for 1 min on each side until slightly charred and warmed through, then put onto 4 plates. Stir the parsley into the nutty dressing, spoon over and serve."}
{"text": "Finely chop the liquorice and put in a small pan with about 5cm water. Boil for 30 mins, topping up with water to keep the liquorice covered at all times, mashing and stirring occasionally, until nearly all the lumps of liquorice have disappeared and you’re left with black, syrupy water. Sieve into a new pan, add the butter, and gently bubble until you have a consistency between clear honey and gravy.\nBoil a big saucepan of water. Add the carrots and cook for a couple of mins until just tender. Drain well, then tip back into their pan and add the hot liquorice syrup. Toss to coat, season, and tip into a dish to serve."}
{"text": "Peel and dice all the vegetables and put in a large pan of water. Bring to the boil and simmer for 20-25 mins until soft enough to mash. Drain, then add the milk and butter to the dry pan, and heat until the butter has melted. Tip the veg back into the pan, season with lots of cracked black pepper and mash over a low heat.\nRemove from the heat and spoon into a serving bowl. Scatter with hazelnuts, drizzle with the oil (if using) and sprinkle the chives over."}
{"text": "Butterfly the prawns, removing the black thread that runs through the body. Beat the butter until smooth, then mix in the harissa, parsley, capers, lemon zest and some ground black pepper. Can be made 2 weeks in advance, then chilled.\nOpen out each prawn and smear 1 tsp of the butter into the middle. Can be made 1 day ahead and chilled.\nWhen ready to eat, heat the grill to as high as it will go. Put the prawns on a baking tray and grill for 5 mins until they are pink through. Toast the flatbreads, then serve with the hot prawns and lemon wedges for squeezing over."}
{"text": "Thinly slice the peel and pith from the lemons, then segment. Squeeze 1 tbsp of the juice into a bowl. Whisk in the oils, vinegar, honey and seasoning.\nPut the lemon segments, olives, dates and feta into a large bowl, and put the leaves on top. Cover and chill until ready to eat. Toss with the dressing to serve."}
{"text": "To decorate the glasses with a sugar rim, tip the sugar onto a flat plate and the lemon juice into a bowl. Dip the rim of each glass in the juice, then the sugar.\nPut the gin, lemon juice, sugar and elderflower cordial into a large jug. Stir until the sugar has dissolved. Add the prosecco, then the sorbet, and give it a good stir. Pour into the prepared glasses and pop in a few strips of lemon zest."}
{"text": "Pour the cream into a pan and heat until just steaming, but not boiling. Put the chopped chocolate and butter in a bowl, pour over the hot cream, and stir until smooth. Add the golden syrup, mint extract and chilli. Chill until firm, about 2 hrs.\nUsing a melon baller roll into 1 tsp balls. Roll the balls in chopped almonds and set on a tray. Cover and chill until serving."}
{"text": "Put the potatoes in a saucepan, cover with cold salted water and bring to the boil. Cover and simmer for 10 mins until tender. Meanwhile, heat the cream, milk and butter in a saucepan on a medium heat for 5-8 mins until the liquid has reduced by half, then stir through the smoked butter.\nDrain the potatoes, tip back into the pan and return to the heat to remove any further moisture. Sieve or mash the potato until really smooth, or put through a potato ricer if you have one. Add the warm smoked butter-cream to the mash until you have a good consistency – you may not need to add all of the cream. Season and add the mustard to taste.\nSpoon the mash onto serving plates, scatter over the crispy sausage crumble and add a few pinches of smoked salt."}
{"text": "Spoon all but about 4 tbsp turkey fat from the roasting tin, leaving behind as much of the turkey juices as possible. Set the tin over a low heat on the hob and stir the flour into the juices to make a paste.\nGradually add the turkey stock to the pan, scraping up any bits stuck to the bottom of the tin. Once all the stock has been added, keep stirring until the gravy comes to the boil, then add the Marsala, if using. Reduce the heat and simmer gently for 5 mins or until thickened to your liking."}
{"text": "Put everything except the suet into a large mixing bowl and mix well using your hands. Leave for at least 2 hrs, or overnight if you can. Add the suet, mix again, then spoon into sterilised jars (see tip, bottom left) while they are still warm. Will keep for up to 1 year in a cool, dark place. If the mincemeat starts to look dry as it matures, add a little more brandy."}
{"text": "Put the coconut milk, double cream and coconut cream in a saucepan and bring almost to the boil. Meanwhile, whisk the sugar and the egg yolks in a bowl until thick. Pour the coconut milk mixture in a slow stream over the egg yolks and sugar, whisking constantly.\nRinse out the saucepan and return to a low heat. Pour in the custard mixture and stir in the desiccated coconut. Continue to stir constantly for 5-10 mins until the custard thickens slightly and you can trace a line through it with a wooden spoon. Pour into a bowl, then cover the surface of the custard with cling film, allow to cool, then chill for 30 mins.\nTransfer the chilled custard to an ice cream maker and freeze according to the manufacturer’s instructions. Alternatively, transfer the mixture to a small freezable container with a lid and freeze for 1 hr, then use a fork or electric whisk to really churn through the ice cream to break up the ice crystals so that the mixture is the same consistency. Pop it back into the freezer for another 2-3 hrs, whisking it about every half hour, then cover the surface with a sheet of cling film and freeze with the lid on until as firm as ice cream. Take out of the freezer 10 mins before serving so it’s easy to scoop."}
{"text": "Peel and finely slice 1kg Jerusalem artichokes, adding to a bowl of water and lemon juice. Heat 75g butter in a large frying pan over a medium heat and, once foaming, add the artichokes, 1 crushed garlic clove and 3 thyme sprigs.\nCook for 20 mins or so, adding another 75g cubed butter gradually, cube by cube, basting frequently so that the artichokes are always covered in foaming butter, until they’re a rich roasted colour. Just before serving, toss with the juice 1 lemon and season to taste."}
{"text": "Heat the butter in a large saucepan. Fry the onions and artichokes for 10 mins or until the onions are cooked and the artichokes have softened. Add the stock and bring to the boil, then reduce the heat to a simmer, cooking for 15-20 mins until the artichokes are very tender.\nTip everything into a food processor with the cream and purée until smooth. Season with the truffle oil and some salt.Transfer to a saucepan to keep warm (or reheat later when needed).\nHeat the olive oil in a non-stick frying pan over a medium heat. Add the shredded goose and slowly fry until crispy and golden.\nLadle the soup into bowls and top with a drizzle more truffle oil and the crispy goose, if you like."}
{"text": "Put the bulgur in a small saucepan and cover with 300ml water. Bring to the boil, reduce to a simmer, cover and cook for 5 mins or until tender. Drain.\nMeanwhile, heat a griddle pan over a high heat until very hot. Cook the sprouts until char lines appear, then set aside.\nMake the dressing by combining all the ingredients in a small bowl with 1 tbsp water and a little seasoning.\nIn a large bowl, combine the bulgur with the Brussels, beetroot, onion, tomatoes, parsley and some seasoning. Divide between bowls and drizzle with the dressing, serving extra on the side."}
{"text": "Put the salmon fillet into a small tray on a double layer of cling film. In a bowl, mix the salt and sugar with the spices, coriander stalks and ginger, then scatter the mix over both sides of the fish and pat it down. Drizzle over the sherry and wrap the fish in the cling film. Place another tray on top, weight it down with a few tins, then chill for 2 days, flipping the fish over each day.\nMix all the dressing ingredients and stir until the sugar has dissolved. If the flavour is too strong, dilute it slightly with a drop of water, then set aside.\nTo serve, unwrap the salmon and wipe it clean, then briefly rinse it and pat dry with kitchen paper. Using a sharp knife, slice the fish quite thinly and arrange on plates with the mouli, then sprinkle with the herbs and drizzle over the dressing."}
{"text": "Put the flour and ½ tsp salt in a bowl. Combine the eggs with the milk and oil, then gradually pour into the dry ingredients, whisking constantly until it’s a smooth batter. Transfer to a large jug.\nSwirl a little oil around a large, non-stick pan over a gentle heat. Pour a quarter of the batter into the pan, tilting to coat the entire base. Cook for 1 min, flip over and cook for a further 30 secs. On one half of the pancake, add ¼ of the butter and sprinkle over ¼ of the ham and cheese. Grind over some black pepper and fold the pancake over the fillings. Fold in half again and transfer to a plate to serve. Repeat until you have four pancakes. Serve scattered with the chives."}
{"text": "Put the butter in a large saucepan with 225ml water, heating slowly so that the butter melts but the water doesn’t evaporate. Remove from the heat and quickly add the flour. Mix until fully incorporated and comes away from the pan, then leave to cool to room temperature. Use a wooden spoon to beat in the eggs, one at a time, until smooth, glossy and the mix drips off the spoon after 3 secs. Beat in the cheese until combined, before folding in the chives, crab and some seasoning.\nMeanwhile, mix the mayonnaise ingredients together, season and set aside. Can be made a day ahead.\nHeat the oil in a deep-fat fryer or large heavy-based saucepan (no more than half full) to 160C or until a piece of bread browns in 40 secs. Using a dessertspoon, scoop spoonfuls of the batter and carefully drop them straight into the hot oil (you will need to cook them in batches so that you don’t overcrowd the pan). Fry each batch for 3-4 mins until golden brown, then drain on kitchen paper. Season with sea salt flakes and cayenne pepper. Serve hot with the mayonnaise."}
{"text": "Cut the carrots into ribbons with a vegetable peeler and set aside. Pour 500ml water into a large saucepan with the salt and bring to the boil. Add the carrot ribbons and teabags and remove from the heat. Leave to steep for 20 mins until the mixture is cold and the ribbons have softened. Pour into a smaller container and chill until needed. Once cold and ready to serve, strain the carrot ribbons, discard the brine and pat dry with kitchen paper or a clean tea towel. \nSpread the baguette slices with the cream cheese. Top each toast with a few carrot ribbons and a pinch of the dried seaweed, then season and serve."}
{"text": "Heat oven to 200C/180C fan/ gas 6. On a \n, sandwich a single layer of pancetta rashers between two pieces of parchment, then weigh it down with a second tray (this will stop it wrinkling as it cooks). Bake for 10-15 mins until the fat is crisp and golden. Pat with kitchen paper to absorb any excess fat. \nOil a 20cm round tin. Boil the stock in a saucepan, then slowly stir in the polenta and simmer for 5 mins, \n, until thick and smooth. Stir in 1 tbsp oil, the rosemary and parmesan, if using, and season. Spoon the mixture into the tin, level the top, then set in the fridge for at least 1 hr in the fridge or until very firm. \nWhen ready to eat, heat a \n or non-stick frying pan until hot. Cut the set polenta into 16 wedges, brush with a little oil, then cook for 4 mins on each side or until golden and marked. Transfer to a serving plate or board. \nMeanwhile, use a cutlery knife to push about 1 tsp cheese into the middle of each date half. Thread a cocktail stick through each stuffed date, then add a piece of pancetta, two spinach leaves and a wedge of hot polenta. To serve, drizzle with a little of the pomegranate molasses."}
{"text": "Put the quinces, apples and cranberries in a large pan. Cover with water and bring to the boil, then turn down the heat and cook more gently for about 1 hr until the fruit is really soft.\nHang a jelly bag over a large mixing bowl, tip the fruit in and let it drip overnight – don’t be tempted to squeeze the bag, or the pulp will come through and your jelly will be murky.\nThe next day, measure the amount of juice you have and, for every 1ml of liquid, match with grams of the sugar (so for 500ml you’d need 500g sugar). Tip both into a preserving pan, or large pan, and bring slowly to the boil, stirring until the sugar dissolves. Increase the heat once the sugar has gone and boil until it reaches 110C on a sugar thermometer.\nSkim any scum off the surface of the liquid, then stir in the rosewater. Ladle into sterilised jars (see below left), adding a bay leaf to each one, if you like, and cover with lids – or wax discs, cellophane and elastic bands."}
{"text": "Knead 700g of the icing until smooth. Dust work surface with icing sugar, then roll icing into a circle 5mm thick and 40cm wide. Brush cake with cool, boiled water. Roll icing over the rolling pin, then place onto the marzipan, smoothing any folds. Cut away any excess, then use a glass to smooth sides of the cake.\nKnead the trimmings with the remaining 300g icing and roll out to 5mm thick. Using an 8cm star cutter, cut one large star. Roll the rest of the icing a little thinner, then cut out 20 stars with a small cutter. Lift stars onto greaseproof paper and leave overnight. Once dry, mix some of the gold lustre with a drop of water then paint the large star and half the small stars gold. Leave to dry for 30 mins.\nSquash trimmings together and colour with the red colouring paste. For the star’s tail, shape half the icing into a rectangle and roll out to a long strip about 3mm thick. Cut a length, 40cm long and 10cm wide at one end, tapering to about 5cm wide. Cut a ‘V’ in the wide end (see picture, below left). Cover with cling film, then roll the rest of the icing into a 20cm circle. Cut a scroll shape, ensuring one end is the same width as the thinner end of the first piece.\nBrush the sides of the cake with water, then wrap the tail around. Lift the scrollshaped piece onto the cake, dampening underneath so it sticks, and join the scroll and tail ends together. Brush away excess icing sugar with a damp brush and leave to dry. Roll a walnut-size ball of icing and put on top of the cake where the tail ends.\nBeat the egg white with the icing sugar to make a smooth paste. Spoon into an icing bag fitted with a fine writing nozzle. Use this to stick the large star onto the ball of icing and the small stars to the tail, and to pipe graduated dots to decorate. Leave to dry."}
{"text": "Tip the sugar into a medium saucepan and place over a medium heat. Cook without stirring until the sugar has dissolved and turned into a bubbling, light-brown caramel.\nThrow in the cranberries and let them cook in the caramel, stirring until they start to burst, then simmer everything for about 10 mins until you have a harmonious, thick, jammy sauce.\nPour in the Champagne or wine, bring the sauce to the boil, then remove and pour into a bowl to cool completely."}
{"text": "Finely shred the cabbage – the quickest way to do this is in a \n with a shredder attachment or using a mandoline.\nHeat the oil in a \n or large frying pan, then add the cabbage and kale. Stir-fry over a high heat for 3-4 mins or until the cabbage starts to wilt, then add the rest of the ingredients. Toss everything together really well, continue to cook for a further 4 mins and season before serving. Keep warm in a low oven if needed or leave to cool, cover, chill and reheat in a pan or microwave the following day."}
{"text": "For the pastry, put the butter and flour in a food processor and whizz to fine crumbs, then pulse in the sugar. Mix the egg yolks with 2 tsp cold water and, with the blade running, pour in the liquid to bring the pastry together. If it doesn’t come together, add 1-2 tsp more water until it does.\nTip the pastry onto a lightly floured surface and bring together to make a flat disc, then roll out to line a 23cm loose-bottomed tart tin. Leave the pastry overhanging the tin and prick the bottom of the pastry case with a fork. Chill for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Line the pastry case with some crumpled baking parchment, fill with baking beans, then blind-bake for 15 mins. Carefully remove the parchment and beans, and bake for a further 10 mins or until the pastry looks golden and biscuity. Remove the case from the oven and trim the edges of the pastry with a sharp knife. Can be done the day before. Lower oven to 180C/160C fan/gas 4.\nWhile the case is baking, make the filling. Cook the cranberries in a shallow pan over a medium heat with 2 tbsp water for 15 mins until pulpy. Push the fruit through a sieve over a bowl; discard the seeds and skins.\nPut the cornflour in a clean pan and whisk in the lemon and orange juice until smooth. Add the sugar and cranberry purée, and heat until the mixture has bubbled and thickened, stirring constantly. Remove from the heat, add the butter and beat until melted. Add the egg yolks and whole egg to the pan, beat well and return to a medium heat. Keep stirring vigorously for 5 mins until the mixture thickens and drops off the spoon. Remove from the heat and set aside.\nMeanwhile, make the meringue. Put the egg whites in a large clean bowl and whisk to stiff peaks. Add half the sugar, a spoonful at a time, whisking between each addition until stiff again. Whisk in the cornflour and remaining sugar until shiny and thick.\nPour the filling into the pastry case. Put spoonfuls of meringue around the edge of the filling so it just touches the pastry and pile the rest into the centre, spreading so that it covers the filling. Bake for 18-20 mins until the meringue is crisp and slightly coloured. Let the pie sit in the tin for 30 mins, then remove and leave for at least another 30 mins before slicing. "}
{"text": "Heat 1 tbsp of the butter in a non-stick frying pan over a medium heat. When the butter is foaming, add the chicken livers and fry for 2 mins each side.\nStir the crushed garlic, some of the thyme and Madeira into the pan with the livers. Fry for 2 mins, letting the Madeira simmer. Transfer the mixture to a food processor, reserve 200g of the butter and add the rest to the processor. Blend everything to a smooth paste. Season to taste, then spoon into 4 x 70ml clip-top jars.\nMelt the reserved butter in a medium frying pan and add the sliced garlic. Turn the garlic in the butter until slightly golden. Pour into the 4 jars of pâté, ensuring a few slices of garlic and the remaining thyme leaves go in each jar, and chill in the fridge for at least 4 hrs, or until set. Can be made up to 2 days in advance.\nBefore serving, toast the brioche, then cut into triangular quarters for serving. Stir the diced apple through the chutney. Serve the pâté on small wooden boards with the toasted brioche, cornichons and chutney."}
{"text": "In a large saucepan on a high heat, simmer the potatoes for 5 mins in enough water to just cover them, then drain in a colander and leave for 1 min for the steam to escape.\nIn a small bowl, mix all the ingredients for the persillade together and set aside. Heat the oil in a large frying pan on a high heat, add the lardons and cook for 8-10 mins until lightly caramelised. Add the potatoes, then the butter.\nSeason with salt and freshly ground black pepper and cook for 10 mins, stirring regularly, until golden brown all over. Spoon out any excess fat and stir in the persillade. Taste and adjust the seasoning if necessary."}
{"text": "Bring a large pan of water to the boil. Tip in the cabbage and boil for 10 mins. Drain and keep warm.\nMeanwhile, heat a large frying pan and cook the bacon for 7-8 mins until golden and crisp, adding the garlic for the final 3 mins.\nIn a bowl, mix together the cream and Parmesan with some freshly ground black pepper. Add the cream mixture and the cabbage to the bacon pan. Toss everything together until well coated. Return to the heat to warm through for a few mins before serving."}
{"text": "Put all the ingredients in a jug, mix well and chill. To serve, add ice to glasses, pour over the rum punch and decorate with pineapple & lime skewers."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease and lightly flour a 1.4-litre Bundt tin. Beat the butter and sugar until very light and fluffy. Add the eggs with a handful of flour and beat in, followed by the vanilla and almond extract. Tip in half the remaining flour, half the ground almonds, half the soured cream and all of the baking powder and beat in.\nMix the rest of the flour with the pistachios, sultanas, remaining ground almonds, the flaked almonds, cherries and mixed peel, then stir into the cake mixture with the remaining soured cream. Spoon into the tin, spread to level and bake for 50 mins until a poked-in skewer comes out clean. Remove from the oven and leave to cool for 10 mins in the tin, then turn out onto a wire rack to cool completely.\nTo decorate, first roll the marzipan into a sausage shape long enough to sit on top of the cake in a ring. Position it on top and squeeze the two ends together, then press down a little to help it stick in place. Mix the fondant icing sugar with enough water to make a thick but spreadable icing – add the water little by little, so you don’t end up with a really runny icing. Spoon the icing over the marzipan ring, letting it dribble down the sides a little. Shape the Regal-Ice Icing into holly leaves and dust with green glitter or press on green sprinkles. Arrange on top of the cake, using the whole glacé cherries as the berries."}
{"text": "Finely chop the artichokes and a handful of rocket. Mix together with the crumbled feta. Spoon the mixture into the Peppadews and serve."}
{"text": "Put the beef in a container just big enough to fit snugly. Mix the marinade ingredients in a bowl and tip over the beef. Cover and chill, turning and basting as often as possible. Leave for 24-72 hrs.\nPour the Port and wine into a large pan and simmer until reduced to a glaze. – this will take about 20 mins. Heat the oil in a separate large pan and, when almost smoking, add the beef scraps and cook until dark golden. Add the shallots, garlic, peppercorns and herbs. Fry for a few mins until starting to brown, then add the reduced alcohol and stock. Bring to a simmer and cook for 25 mins. Strain into a clean pan, then simmer for 8-10 mins until thickened. Season to taste and chill until needed.\nHeat oven to 200C/180C fan/gas 6. Remove the fillet from the marinade and brush off the herbs, reserving them and the garlic for later. Heat the vegetable oil in a large pan. When almost smoking, add the fillet, season with 2 tsp salt and fry for 5-7 mins, turning every so often.\nAdd the butter, cube by cube, and – when foaming – baste the fillet, turning regularly. When the fillet is caramelised, put in a roasting tin with the reserved herbs and garlic, and cook in the oven for 8-12 mins, turning every 4 mins and basting. To check that the beef is done, insert a probe thermometer into the centre – it should read 55-60C for medium rare. Transfer to a board, wrap loosely in foil and rest for 20 mins.\nReturn the tin to the oven until the butter is hot. Before serving, roll the fillet in it. Serve with the sauce, croquettes, carrots and garlic."}
{"text": "Heat oven to 200C/180C fan/gas 6 and put the pecans on a non-stick baking sheet. Sprinkle over the sugar and maple syrup, and toss to combine. Roast for 5-7 mins until golden, then leave to cool completely before roughly chopping.\nMeanwhile, make the dressing by combining the ingredients and seasoning well. In a large bowl, combine the pear with the rocket, and toss with a little of the dressing.\nJust before serving, blowtorch or grill the goat’s cheese rounds until golden. To serve, put the remaining dressing in a squeezy bottle and swirl around the edge of the plate. Put the pear and rocket salad in the middle, scatter over the nuts and top with the goat’s cheese."}
{"text": "Brush a pudding basin with a little sunflower oil, then line with cling film. Spoon the ice cream into a food processor (or a bowl if you have a handheld blender). Crumble in the cake or pudding, add the mixed spice and 4 tbsp of the rum, and whizz together until nearly smooth. Stir in the raisins.\nScrape the ice cream mixture into the basin and smooth the top. Cover with cling film and freeze overnight until solid.\nTake the pudding basin out of the freezer 15 mins before serving. Turn the pudding out onto a serving plate and peel off the cling film. Mix the caramel sauce and remaining 2 tbsp rum together and warm gently, if you like (it’s still lovely cold). Serve with the Ice cream bombe."}
{"text": "Mix the chestnut purée with the icing sugar and vanilla extract. Divide between 12 baked tartlet cases. Whip the double cream, spoon onto the tarts, then grate over dark chocolate to finish."}
{"text": "Mix together all the ingredients in a jug. Chill until ready to serve. Pour into 4 highball glasses with ice. Decorate with citrus skewers."}
{"text": "Put the steak in the freezer for 30 mins – it will firm up and be much easier to slice thinly. Meanwhile, make a marinade. Put the soy, sugar, mirin, ginger, garlic, pineapple, chilli flakes and oil in a food processor. Blitz until smooth, then pour into a bowl.\nWhen the meat is semi-frozen, thinly slice into 25 pieces and add to the marinade. Chill until ready to use, but don’t leave for longer than 2 hrs or the pineapple juice will break down the meat too much.\nMeanwhile, soak small wooden skewers in water for 10 mins. When ready to serve, thread a piece of meat onto each skewer. Heat a griddle pan, or frying pan, and brown skewers for 1-2 mins each side or until grill marks appear. Add a little more oil to the pan if needed.\nMix together the dipping sauce ingredients in a small bowl. Serve the skewers with lettuce, sesame seeds, spring onions and dipping sauce."}
{"text": "Spread each slice of baguette with butter. On an un-buttered side, spread over half the chutney, top with a piece of prosciutto and 2 bocconcini halves. Top with a second slice of bread, buttered-side up, then top with a sage leaf and press down slightly. Repeat to make a second sandwich.\nAdd a drizzle of oil and a knob of butter to a small pan. Fry the sandwiches over a low heat, turning, until golden and crisp, and the cheese is just melting. Eat immediately."}
{"text": "Tip the salmon, soft cheese, crème fraîche and lemon juice into a food processor. Blitz everything until smooth, then stir in a very large pinch cracked pepper. Spoon the mix into a large bowl, drizzle with olive oil and serve with toasted pitta bread and olives."}
{"text": "Heat oven to 220C/200C fan/gas 7. Wrap a pancetta slice around each soldier. Toss with a little olive oil and bake for 5-8 mins until crisp, turning halfway through cooking.\nReheat the soup, then divide evenly between 8 espresso cups or large shot glasses. Serve drizzled with cream and sprinkled with chives, with a crispy pancetta soldier for dipping."}
{"text": "Heat the butter in medium pan until just starting to sizzle. Cook the onion over a very low heat with the thyme and bay for 15-20 mins until soft and just lightly golden. Pour the milk into the pan, add the star anise and ground cloves, season and bring to the boil. Turn off the heat and leave to infuse for at least 10 mins. \n.\nRemove the star anise and bay, and add the bread chunks to the pan. Bring back to the boil, then remove from the heat and blitz using a hand blender. Return to the heat, stir in the crème fraîche and simmer gently for 2 mins until thickened. \n Tip into a bowl, sprinkle with cracked pepper, and add the bay leaf, if you like."}
{"text": "Heat oven to 220C/200C fan/gas 7. On a large baking tray, toss the parsnips with the oil and plenty of seasoning. Cook on a low shelf in the oven for 30 mins.\nRemove from oven, drizzle with maple syrup, scatter over the pecans and toss everything together. Cook for a further 5-10 mins until the parsnips start to caramelise and crisp up at the ends."}
{"text": "To make the herby salt, put all the ingredients in a small food processor (or use a pestle and mortar) and grind to a fine salt.\nTip the potatoes into a large roasting tin and toss with the oil, polenta, 2 tbsp of the herby salt and some black pepper. Any leftover salt will keep for up to 5 days in a small sealed container.\nBake underneath a joint of meat, if cooking, at 200C/180C fan/gas 6 for 30 mins. When the meat comes out, turn up the heat to 220C/200C fan/gas 7 and cook on the top shelf for another 45 mins, shaking the tin halfway through the cooking time."}
{"text": "Heat oven to 200C/180C fan/gas 6. Space the meatballs in a baking tray and squash each slightly with the palm of your hand. Roast for 15 mins until cooked through, then press some cheese into the top of each. Put back in the oven for 20 secs-1 min until the cheese starts to melt.\nMeanwhile, split the rolls in half and very lightly toast. Spread each half with a little barbecue sauce, then top each with a cheesy meatball, some onion and some cornichon. Skewer with a cocktail stick or mini skewer to hold everything together."}
{"text": "Mix together the milk, eggs, flour and a pinch of salt in a food processor or blender until you have a smooth batter. If you don’t have a food processor or blender, whisk the eggs into the flour and salt, then gradually whisk in the milk until smooth. Transfer to a jug, cover and leave for 15 mins.\nMeanwhile, heat oven to 240C/220C fan/gas 9. Pour ½ tsp oil into the holes of a Yorkshire pudding or muffin tin and put in the oven for 10 mins to get hot.\nWhen the oil is hot, pour the batter into each hole a third of the way up. Quickly put in the oven, then turn it down to 180C/160C fan/gas 4 and cook for 12-15 mins. Remove the Yorkies, turn them upside down in the tin and return to the oven for another 2-3 mins to brown the bottoms.\nAllow to cool completely on a wire rack, then put in a tight-sealing freezer bag or container and freeze for up to a month.\nWhen ready to cook, heat oven to 220C/200C fan/gas 7. Put the frozen Yorkies on a baking sheet and cook for 6-8 mins until golden and hot."}
{"text": "Heat oven to 200C/180C fan/gas 6. Gently heat the oil in a shallow saucepan then add the onion, celery and garlic. Keep everything sizzling on a medium heat for 15 mins until soft. Tip into a food processor with the rest of the ingredients, except the egg, plus a small pinch of salt, if you like. Pulse until everything is chopped, then add the egg and pulse until combined. Use wet hands to roll the mixture into walnut-sized balls, then place on a baking sheet lined with baking parchment.\nBake in the oven for 25-30 mins until golden and hot through. "}
{"text": "Heat oven to 180C/fan 160C/gas 4. Pour 300ml boiling water over the chopped dates and set aside. Butter a 1.4-litre pudding basin and put a disc of baking parchment in the base. Put the butter, sugar, flour, bicarbonate of soda, mixed spice and eggs into a large bowl, then beat with an electric hand whisk until really well blended. Add the cooled date mixture, then beat again to make a sloppy batter.\nStir in the fruits, nuts and ginger, then pour into the pudding basin and place on a baking tray. Bake in the oven for 1 hr, cover the top lightly with foil, then return to the oven for 25 mins more until a skewer inserted into the pudding comes out clean.\nMeanwhile, make the brandy syrup. Put the sugar and 50ml water in a pan and stir over the heat until syrupy. Stir in the brandy and remove from the heat. When the pudding is ready, remove from the oven and push a skewer into it in several places. Pour over the brandy syrup so it soaks into the pudding, then cover until ready to serve.\nTurn out onto a plate, scatter with the pecans and top with the holly sprig, dusted with icing sugar. Serve with good-quality vanilla ice cream."}
{"text": "For the zabaglione cream, put the egg yolks and sugar into a large bowl. Whisk with an electric hand beater for 2 mins until lighter in colour and falling in thick ribbons. Continue to beat while gradually pouring in the wine, then the marsala. Pour this into a medium, preferably non-stick saucepan. Stir over a lowish heat until it thickens. It takes 5-7 mins, by which time it should thickly coat the back of the spoon and be light and frothy. Pour into a bowl and chill for 45 mins, or better still, overnight.\nMeanwhile, slice the panettone and lay it in overlapping slices on the bottom (not up the sides) of a 20cm loose-bottomed, round cake tin (5.5cm deep), pressing the slices down so they completely line the base (you are creating a panettone layer). Drizzle over the 3-4 tbsp of marsala, so each slice gets a little bit, and let it soak in. Tip the drained cherries onto kitchen paper and pat dry (if they are too wet the panettone will go soggy when it thaws), then halve each one to make it easier to cut later.\nWhip the cream into soft peaks and fold it into the cold marsala mixture. If it all seems a bit lumpy, give it a quick beat with a wire whisk. Pour the zabaglione cream over the cherries and give it a few swirls so it is slightly undulating on top.\nOpen-freeze until firm, then cover with cling film and foil, and freeze for up to 1 month.\nWhen ready to use, unwrap and thaw in the fridge for about 2-2½ hrs (it should be quite moussey), then serve, generously dusted with sifted cocoa powder and topped with holly. Serve cut in wedges."}
{"text": "Cook parsnips in a pan of boiling salted water for 2 mins, then tip in the celeriac and boil together for 8 mins. Drain well, then mash with butter and cream. Season, then add a grating of nutmeg, stir in the sage and spoon into a buttered ovenproof dish. Make up to this stage 1 day ahead or freeze for one month. Defrost in fridge overnight.\nHeat oven to 190C/fan 170C/gas 5. Mix breadcrumbs, Parmesan, almonds and oil together. Season, scatter over the mash, then bake for 35-40 mins from cold, 25-30 mins if not, until topping is crisp and golden."}
{"text": "Blanch carrots in a pan of boiling salted water for 3 mins, drain well, then pat dry. In a large pan, melt the butter and oil, then fry the carrots, onions and thyme over a low heat for 30 mins until golden.\nStir in the sugar and red wine and bubble for a few mins to boil off the alcohol. Add the vinegar, then continue to cook until syrupy, about 5 mins. Remove the sprigs of thyme and serve. Make up to 2 days ahead, stored in a covered container. Tip back into a pan and reheat or use a microwave."}
{"text": "Heat oven to 200C/180C fan/gas 6. Grease a 25cm springform tin, then line the base and sides with baking paper. Whisk eggs and sugar until pale and thick.\nSift the flour and cocoa together onto the mixture, then gently fold in, followed by the butter. Pour into the tin, ease to the edges, then bake for 8-10 mins until risen and firm to the touch. Cool in the tin.\nMeanwhile, beat the chestnut purée and egg yolks until as smooth as possible. Melt the chocolate in a bowl over a pan of simmering water with half the cream. Remove from the heat, then beat into the chestnut mixture.\nWhisk the egg whites until stiff. In a separate bowl, whip the remaining cream until it holds its shape. Fold into the chocolate mixture, then carefully fold in the egg whites. Drizzle the brandy, if using, over the sponge base, then pour the chocolate mix on top. Level the surface and chill for 5 hrs or overnight until firm. Chill for 2 days, or freeze for 2 months. Thaw overnight in the fridge.\nTo serve, carefully remove from the tin, strip off the paper and slide onto a cake stand. Dust heavily with cocoa."}
{"text": "Melt the oil and butter in a large saucepan or flameproof casserole. Add the onions and sage, and gently cook until really soft – about 15 mins. Tip in the squash and cook for 5 mins, stirring. Add the honey and stock, bring to a simmer and cook until the squash is tender.\nLet the soup cool a bit so you don’t burn yourself, then whizz until really smooth with a hand blender, or in batches in a blender. Season to taste, adding a drop more stock or water if the soup is too thick. Reheat before serving, sprinkled with chives and cracked black pepper."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Line 18 holes of a 2 x 12-hole bun tins with paper cake cases. Melt butter and cool for 5 mins, tip into a large bowl with all the cake ingredients, then beat together for 1-2 mins until smooth.\nSpoon the cake mixture into the cake cases, filling them three-quarters full (a heaped tablespoon is about right). Bake for 15-18 mins until lightly browned and firm to the touch. Cool on a wire rack.\nTo make the icing, put the egg white and orange juice into a heatproof bowl, sift in the icing sugar, then set over a pan of simmering water. Using an electric hand whisk, whisk the icing for 7 mins until it is glossy and stands in soft peaks. Remove from the heat, then whisk for a further 2 mins until it is slightly cooled.\nThinly slice the fruit jellies. Spoon the icing onto the cakes, swirling it with a knife, then decorate with slices of jelly fruits and a few silver balls. Leave to set. The cakes will keep for up to 3 days in the cake tin."}
{"text": "Heat oven to 220C/200C fan/gas 7 and line a baking tray with baking parchment. Put the squash on the baking tray, drizzle over the olive oil, scatter on the cumin seeds and season generously – use your hands to ensure each piece is evenly coated with oil and seasoning. Roast for 30-35 mins until the edges are caramelised, then remove from the oven and leave to cool.\nMeanwhile, bring a large saucepan of water to the boil. Cook the rice for 20-25 mins or according to pack instructions, then strain and rinse well with cold water until all the starch is washed off and the rice is cold. Allow to drain well.\nPut the cranberries, pomegranate seeds, hazelnuts, herbs, onion and rice in a large bowl and mix well. Make the dressing by combining all the ingredients in a bowl with a generous amount of seasoning to taste. Once the squash is completely cool, gently mix it into the bowl of other ingredients. Pour over the dressing, mix well and serve on a large platter with the feta crumbled over the top."}
{"text": "Heat the grill to high. Arrange the bacon on a baking tray lined with foil. Cook for 5-7 mins until crisp, then turn off the grill but leave the tray inside to keep warm. In a bowl, mix the flour, baking powder and sugar with a pinch of salt. Make a well in the centre and add the mashed banana, eggs, butter and milk. Whisk to a smooth batter without any flour lumps.\nHeat a little butter in a large frying pan. Once sizzling, ladle in small dollops of the pancake batter, leaving a little space between each, as they will spread out. Put 2 or 3 slices of banana onto the surface of each pancake and cook for 2 mins over a medium heat. When you see bubbles appear between the banana slices, flip the pancakes over and cook for 1 min more, until puffed up and golden. Transfer to a plate and keep warm with the bacon while you cook the rest. Serve the pancakes with the crispy bacon and a drizzle of maple syrup."}
{"text": "Heat oven to 180C/160C fan/gas 4. Roll the pastry out on a lightly floured surface and use to line a 20cm loose-bottomed tart tin. Fill the tart with baking paper and baking beans, bake for 25 mins, then remove the baking paper and beans. Continue to cook for 10 mins more until golden. Remove from the oven and cool.\nMelt the chocolate and butter together in a large bowl over a pan of simmering water. Whisk the eggs and maple syrup together, then stir into the chocolate with most of the nuts. Pour into the tart shell, top with the remaining nuts and bake for 30-40 mins until set. Cool and serve with vanilla ice cream or double cream."}
{"text": "Toss the chicken thighs with 1 tsp of the turmeric and some salt. Heat the oil in a big frying pan or wide flameproof casserole, and brown the thighs well on both sides. Remove from the pan. Add the chopped onion and cook for 5 mins until softened.\nRoughly cut all the flesh from one of the mangoes, scraping as much as you can from the stone. Put into a food processor with the korma paste, ginger and quartered onion. Whizz to a paste, then tip into the pan and gently cook until softened.\nStir in the remaining turmeric, cumin and onion seeds and turn up the heat for a couple of mins. Return the chicken to the pan. Stir in the coconut milk and stock. Bring to a gentle simmer, then cover and cook for 20 mins.\nUncover the pan and cook for another 25-30 mins until the chicken is really tender, adding a few drops of water to keep it saucy.\nSlice the remaining mango and stir in to heat through while you shred the chicken with two forks. Season and serve scattered with the coriander, with basmati rice, naan bread, chutney, lime pickle and our sides, if you like."}
{"text": "Bring a large pan of salted water to the boil, then boil the eggs for exactly 7½ mins. Cool in cold water, peel and set aside. Tip the pork, sausagemeat, ham, sage and onion into a large bowl. Season generously and add a few shakes of Tabasco. Mix well with your hands until completely combined. Take about 1 tbsp of the mix, shape into a small burger and fry in a pan. Taste for seasoning. Slightly over-seasoned is perfect.\nMelt a few tbsps lard, brush a 1-litre terrine dish with an even layer of the melted fat, then dust with flour. To make the pastry, tip the flour into a bowl with 2 tsp salt. Put the lard and milk into a pan with 150ml water, then heat until the lard has completely melted. Pour into the flour and beat with a wooden spoon until combined. Tip onto the surface and knead until it all comes together.\nCut a piece of baking parchment to fit the bottom and long sides of the terrine dish with some hanging over the edge. Take about two-thirds of the pastry dough and shape it into a rectangle roughly the width and length of the dish. Lay the dough into the terrine and, using your fingers, press it into the bottom, the corners and up the sides of the dish until it comes to the top and hangs over the rim a little.\nTake half the meat mixture and pat it into a shape that will fit the terrine dish, then lay it in. Use your fingers to make a trench down the middle of the meat. Trim the tops and bottoms off the eggs, lay them, in a row, along the trench, then season. Trimming the eggs like this ensures that each slice of pie will contain both egg white and yolk.\nTake the rest of the meat mixture, pat it out to a rectangle that will fit over the eggs, and press it over the top. Brush the overhang of the pastry with the beaten egg, then roll out the rest of the pastry to fit over the pie.\nPinch edges together to fix the top. Brush top generously with egg and pierce three holes along the top. Heat oven to 200C/fan 180C/gas 6. Place pie on a baking sheet and bake for 30 mins. Lower the heat to 180C/fan 160C/gas 4, then continue to cook for another hour. Leave to cool. Carefully turn dish upside-down onto a board and use the sides of the paper to pull the pie out of the dish. If sides aren’t brown enough, return it to the oven on a baking tray at 200C/fan 180C/gas 6 until coloured. Cool, then chill in the fridge.\nIf you want to fill the pie with jelly, soak the gelatine in cold water and warm the stock until hot, but not simmering. Remove the gelatine from the water and squeeze to remove excess liquid, then stir into the stock to dissolve. Leave to cool to room temperature, then transfer to a squeezy bottle. Pour the jelly into one of the holes until it comes to the top. Place the pie on a dish in the fridge until the jelly has set, then repeat twice more, so the jelly has filled each hole. Leave to set in the fridge overnight."}
{"text": "Cook the Brussels sprouts in a saucepan of boiling salted water for 8-10 mins until tender, then drain and cool in iced water or under the cold tap. Drain well.\nFry bacon gently in a large frying pan for 4 mins until starting to crisp, then throw in the chestnut pieces and cook until toasted. Add the sprouts and crème fraîche, season, then turn the heat up to boil the cream until it coats the sprouts. Tip into a serving dish and serve straight away."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Punch out a circle from the centre of each slice of bread using a 10cm round cutter and roll flat with a rolling pin. Brush circles with the melted butter on each side, then press into 8 individual tart tins. Lift onto 2 baking sheets and bake for 10 mins or until tinged with gold at the edges. Carefully flip the cases out from the tins so they are upside down on the trays, then put back into the oven for 5 mins or until crisp and dry. Leave to cool. Can be kept in an airtight tin for up to 3 days.\nTo start the sauce, put the vinegar, peppercorns and bay leaf into a small pan and bring to the boil. Simmer for about 5 mins or until reduced to about 1 tbsp. Take off the heat, then strain out bay leaf and peppercorns. Will keep covered in the fridge for up to a week.\nHalve avocados, stone and peel. Thinly slice avocado, put into a bowl and gently toss with a squeeze of lemon juice. Can be kept covered in the fridge for up to 2 hrs before serving. When ready to serve, put the avocado and a little rocket into each case, then top with crabmeat. Tip vinegar reduction into a tall, narrow jug, then add the egg yolks. Melt the butter in a pan over a medium heat (don’t boil), then add to the jug. Put a stick blender right to the bottom of the jug, turn on and draw very slowly up through the butter. The sauce will thicken as the yolks and butter meld together. Add herbs, season, then add a dash of lemon juice to bring out the herby flavour and cut through the butteriness. Spoon the hollandaise generously over each tartlet so it oozes over the crab. Serve at once."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Heat the oil or fat in a large fl ameproof roasting tin in the oven for 5-10 mins. Season the beef all over.\nPlace the joint fat-side down in the roasting tin and put it on the hob. Sizzle to release some of the fat, then turn the beef in the fat to seal and colour it all over, about 5 mins. The joint can now be roasted, fat-side up, allowing 10-15 mins per 450g for medium-rare, 15-20 mins per 450g for medium, 20-25 mins for medium-well and 25-30 mins for well done. Turn the joint halfway through its cooking time for an even roast. Once roasted, remove the beef from the pan and leave to one side, loosely covered with foil, to rest for 15-20 mins.\nMeanwhile, pour off any excess fat from the roasting tin, then put the tin on a medium heat on top of the stove. Once it begins to sizzle, pour in the red wine, allowing it to boil rapidly until almost completely evaporated. Tip in the consommé and allow to simmer for 4-5 mins. This will give a light sauce, rather than a gravy (see tip, below). Simmer for a few more mins before straining through a sieve for the smoothest of fi nishes. Carve the beef into thick slices, offering the gravy separately."}
{"text": "First, make the spiced syrup. Put all the ingredients in a saucepan with 100ml water. Heat gently until boiling, then turn the heat off and allow to cool. Strain through a fine sieve into a jug and chill until needed. Can be made 1 week ahead.\nWhile the syrup is cooling, tip the sultanas, apricot, cherries and cranberries into a small bowl and add the orange liqueur. Leave to steep for around 30 mins (or up to 24 hrs).\nWhen you’re ready to serve, take 4 cocktail sticks and thread 2 sultanas, a piece of dried apricot, a cherry and cranberry onto each one. Fill 4 tumblers with crushed ice.\nPour the amaretto, lemon juice, madeira and 50ml of the spiced syrup into a cocktail shaker (along with any leftover orange liqueur) with a handful of ice. Shake well until the outside of the cocktail shaker feels cold, then strain into the prepared glasses. Add the dried fruit cocktail sticks and serve immediately."}
{"text": "Pull off any tough outer leaves from the cabbage and discard. Cut in half, then remove the hard inner core. Rinse the leaves, then shred as finely as you can. Cut the carrots into fine, thin strips or grate in the food processor.\nBring a pan of water to the boil and add the cabbage and carrots. Boil for 6 mins until just tender, then drain. Return to the hot pan and add the butter and cream. Season with pepper, and salt if you like, add the nutmeg and stir well to coat. Pile into a serving dish and serve immediately."}
{"text": "Boil the pasta according to pack instructions. In a saucepan, melt the butter, then gently fry the onion until golden. Add the garlic and sage, fry for a further 2 mins, then remove the pan from the heat. Drain the pasta and reserve some cooking water. Stir through the buttery onions, stilton and 2 tbsp cooking water, then sprinkle with the toasted walnuts to serve."}
{"text": "Start making the pâté by putting the smoked trout, crème fraîche and lemon juice into a food processor. Pulse briefly to bring everything together without the mixture becoming a purée. Season to taste, and put in a bowl or ramekins, cover and chill until ready to serve.\nFor the spiced cucumber salad, put the chilli in a large bowl, and add the ginger and lime zest and juice, and slowly whisk in the olive oil. Once thoroughly combined, add the cucumber, mix well to coat in the dressing, then set aside in the fridge.\nHeat oven to 190C/170C fan/gas 5. Put the oatmeal on a plate. Lightly brush the mackerel fillets all over with beaten egg, and dip them in the oatmeal, turning to coat them on both sides. Lay the mackerel fillets on a baking sheet that has been lightly greased with olive oil and bake for 15-20 mins or until golden.\nTo serve, arrange slices of smoked salmon and the warm cooked mackerel on large platters with the ramekins of trout pâté and the cucumber salad, breads, crispbreads, butter and lemon wedges."}
{"text": "Make the candied orange slices a day ahead if you can. Put the sugar and 300ml water in a medium saucepan and bring to the boil. Reduce to a gentle simmer, add the orange slices and cook for 1 hr-1 hr 10 mins or until the pith is translucent, turning occasionally. Line a baking tray with parchment. Carefully remove the slices from the syrup, place on the prepared tray and set aside to dry (at least 8 hrs) before cutting in half. Reserve the syrup.\nHeat oven to 180C/160C fan/gas 4. Lightly grease a loaf tin (mine was 900g) with olive oil and line with a strip of baking parchment.\nGrind the hazelnuts in a food processor until they resemble coarse breadcrumbs (do not blitz them too much or they will become oily), then add to a bowl along with the orange zest, a pinch of salt and the rest of the dry ingredients. Mix together until evenly combined.\nPour the oil and the orange juice into a jug and mix together. Put the eggs and sugar in a tabletop mixer or large bowl and whisk together for 5-10 mins or until the mixture has tripled in volume and holds a ribbon on the surface when the beaters are lifted out. Slowly pour the oil mixture into the egg mixture and fold together until combined.\nAdd the flour mixture to the egg mixture in 3 or 4 additions, folding together until combined. You can’t sieve this mixture over the eggs because of the hazelnuts, but try not to dump the flour in one place – you need to be careful and fold the batter to retain its lightness. Once fully combined, pour the batter into the prepared loaf tin and bake for 50-55 mins or until a skewer inserted into the centre of the cake comes out clean.\nPrick the top of the cake all over, then pour over 5 tbsp of the reserved orange syrup. Cool in the tin for 15 mins, then turn out onto a wire rack to cool completely. Trim the top of the cake (keep this for a mini trifle) and turn out, cut-side down, onto a serving platter.\nTo decorate, pour the orange juice into a small pan and bring to a simmer. Put the chocolate in a small bowl, pour the orange juice over and stir together to form a smooth ganache. Set aside in the fridge until thickened, about 20-25 mins. Tip the hazelnuts into a small bowl and add the gold powder with a dash of water, stirring together to coat. Put the ganache in a piping bag fitted with a small round piping tip. Pipe in peaks over the top of the cake, decorating with the golden hazelnuts and the orange slices. Will keep for up to 3 days in an airtight container."}
