{"text": "Heat the oil in a large pan over a fairly high heat. Cook the onion and pepper for 3-4 mins until starting to soften and brown slightly. Stir in the curry paste and garlic, then cook for another 1-2 mins. Add the chopped tomatoes and 150ml water. Bring to the boil and bubble for 5 mins.\nTurn the heat down, stir in the turkey and potatoes, and cook for another 2-3 mins, then season and add the mango chutney. Scatter with coriander and serve with rice or naan."}
{"text": "Put the squash and butter in a pan with 5 tbsp water. Tightly cover pan and cook for 15 mins until the squash is just tender, but not coloured. Roughly mash with seasoning, nutmeg and Parmesan.\nMeanwhile, make the dressing. Put the chopped porcini in a small bowl with 3 tbsp boiling water. Cover with cling film and cook for 1 min in the microwave on High, then leave to cool. Mix 1 tbsp oil with the vinegar and soy, then add the soaked mushrooms with almost all of the liquid (leave the last drop behind as it might contain grit).\nTo serve, boil a pan of water with the saffron and some salt for 5 mins to extract some colour and flavour. Meanwhile, fry the mushrooms in the remaining oil. When they are nearly cooked, add the garlic so that it browns and crisps, but doesn’t burn. Pierce the bag of spinach and wilt in the microwave for 1 min. Reheat the squash in the microwave, too.\nBoil the lasagne for 1 min until just tender, then drain. Put 3 little piles of spinach on 2 warm serving plates. Top each with a square of lasagne, then a spoonful of squash – spread it out a little, add a few spinach leaves, then top with another square of pasta. Continue these layers until you end up with a stack of 4 layers of pasta on each plate, then top each with a spoonful of squash. Scatter round the garlicky mushrooms, Prepare ahead\nThe squash can be mashed and the dressing made up to 2 days ahead; keep them both covered in the fridge. To serve, reheat the squash in a pan or in the microwave and take the dressing out to come to room temperature generously spoon over the dressing, or allow guest to help themselves at the table, and sprinkle over some Parmesan shavings, if you like."}
{"text": "Peel the pears and cut the bottom off each to give a flat base – cut them to a height that will fit snugly in your tin. Use a melon baller or small knife to cut out the pips from the base. Roughly chop the pear scraps, discarding the pips, and set aside. Tip the sugar, cinnamon, star anise, cloves, zests and 600ml water into a saucepan large enough to fit all the pears. Bring to the boil, then simmer until the sugar has dissolved. Add the pears, cover with a lid or a piece of baking parchment, and poach gently for 15 mins until a knife easily slides into a pear. Leave to cool in the liquid.\nNow make the sponge. Put the dates and linseeds in a saucepan and add the almond milk. Bring to a gentle simmer, then cook for 2-3 mins until the dates are soft. Pour into a food processer and blitz until smooth. Add the oil and blend again, then scrape into a bowl and set aside to cool a little. Heat oven to 180C/160C fan/gas 4. Grease and line a 20 x 30cm baking tin (a loose -bottomed one if possible) with a strip of baking parchment.\nPut the dry ingredients in a large mixing bowl with 1/ 2 tsp salt. Mix well, breaking up any lumps of sugar with your fingers, and shaking the bowl a few times to encourage any remaining lumps to come to the surface. Add the date and oil mixture, and stir well. Fold in the chopped pear scraps. Scrape the cake mixture into the tin, then nestle in the pears, standing straight up, so that the bottom halves are covered. Bake for 35-40 mins until the cake is cooked through. Insert a skewer to the centre to check – it should come out clean. If there is any wet cake mixture on the skewer, return the cake to the oven and bake for 10 mins more, then check again.\nMeanwhile, bring the pear poaching liquid back to the boil and simmer until reduced to a glossy syrup. When the pudding is cooked, cool for 5-10 mins, then brush all over with the syrup, saving a little extra to serve alongside, with vegan ice cream, if you like."}
{"text": "Tip the flour, yeast and 1 tsp salt into the \n fitted with a dough blade. Mix briefly, then add the sugar and mix again. Warm the milk to hand hot and, in a separate bowl, beat the eggs with the vanilla extract. Add both the milk and eggs to the dry ingredients and mix to a soft dough. Work the dough in the processor for 2 mins, then leave in the machine until doubled in size, about 1 hr.\nCut softened butter into the processor, pulse until incorporated, leave for a further 1 hr to rise again. Add the cranberries, candied peel and white chocolate to the machine, then pulse gently to mix evenly.\nButter and base line a 20cm deep cake tin. Make a 10cm collar with double thickness baking paper and line the sides of the tin. Tip the dough out onto a lightly floured surface and knead briefly to shape into a ball. The dough will be very soft, so flour your hands well before handling it and work quickly. Drop the dough into the tin and leave to rise for 30 mins. Heat oven to 180C/160C fan/gas 4.\nBrush top of the dough liberally with beaten egg and scatter over almonds. Bake for 45-50 mins until the well risen and deep golden brown. Turn out of the tin and cool on a wire rack. Cut into wedges to serve. Will keep for 2 weeks wrapped in foil, or freeze on the day of making for up to 1 month."}
{"text": "Heat oven to 180C/160C fan/gas 4. Heat 1 tbsp of the oil in an ovenproof frying pan and add the shallots. Cook over a medium-low heat for 5-10 mins until the shallots start colouring a little.\nAdd the beetroot, season well and put the pan in the oven. Cook for 10 mins, then stir and return to the oven for another 10 mins until the shallots are golden and the beetroot is cooked through but still firm.\nMeanwhile, heat the remaining oil in a large, non-stick frying pan and fry the mushrooms until golden. Mix the vinegar, sugar, garlic and some seasoning together to make the dressing. Taste to ensure you have a good balance of sweet and sour flavours – it should also be quite garlicky.\nWhen the beetroot is done, stir in the dressing and tarragon. Top the rye bread slices with some warm beetroot salad, the mushrooms and a scattering of dill."}
{"text": "Mix 3 tbsp red wine with the cornflour until smooth, then mix in all the wine. Heat stock in a pan, then pour in the red wine mixture and redcurrant jelly, stirring until thickened. Cover the surface with cling film to stop a skin forming. Chill for up to 2 days. To serve, reheat in a pan until bubbling, then stir in the turkey juices and transfer to a warm gravy boat."}
{"text": "Line one and a half muffin trays with 18 muffin cases. (We used deep, gold ones by Foilcraft, from cake-decorating shops.) Heat oven to 180C/160C fan/ gas 4. Tip the chestnut purée into a large bowl and mash with a fork. Whisk the eggs and sugar with an electric hand whisk until pale and frothy.\nFold half the egg mixture into the chestnut mixture to lighten it, then fold in the almonds and baking powder. Gently fold in the rest of the egg, then drop the batter into the muffin cases. Bake for 25-30 mins until firm. Cool. \nTo make the chocolate topping, gently melt the chocolate, butter and cream together in a small pan. Pour into a bowl and leave to cool. Beat well to thicken the mixture then swirl generously onto the cupcakes and pile with chocolate curls. They will keep in the fridge for 4 days. Dust half with icing sugar and the other with cocoa before serving."}
{"text": "Grease a 900g loaf tin, then line with cling film – as smooth as you can get it. Use 1 long strip of baking parchment to line the base and ends of the tin, leaving some sticking up at each end to help you pull the loaf free later. Criss-cross another piece of parchment to line the base and longer sides.\nFor the cream layer, soak the gelatine in cold water. Gently warm the cream and sherry in a saucepan. When the gelatine is softened, squeeze out excess water, take the cream off the heat and stir in the gelatine until dissolved. Gently whisk in the mascarpone and icing sugar until smooth, then scrape into the tin and bang a couple of times to level. Chill until set – about 1 hr.\nStart each following layer while the previous layer is chilling. For the custard layer, soak the gelatine in cold water. Make up the custard following pack instructions, but using the quantities we’ve given. When the gelatine is soft, squeeze out excess water, remove the custard from the heat and stir in the gelatine until melted. Lay cling film directly on the surface of the custard to stop a skin forming, then cool. Once room temp, scrape into the tin on top of the set cream layer, as above. Chill again until set.\nMake up the raspberry jelly following pack instructions but using 300ml water. Whizz with 150g of the raspberries, then sieve. Cool to room temp, then scatter the remaining raspberries over the set custard layer in the tin. Pour over the raspberry jelly and chill until the jelly is almost set.\nTrim the brown edges from the Madeira cake, then cut it lengthways into big slices 1.5-2cm thick. Cover the jelly with sponge, like a puzzle, using as few bits as possible. Push slightly into the jelly to stick, then cover in cling film and chill until completely set, ideally overnight.\nTo serve, turn the tin upside-down onto your serving plate. Ease the loaf from the tin using the overhanging parchment and gently peel off the cling film, then the parchment. Whip the final 250ml cream with the sifted icing sugar until thick enough to hold its shape. Spoon into a food bag, snip off the corner and pipe onto the top. Scatter with sprinkles, if you like."}
{"text": "Put the gelatine sheets into a bowl of cold water to soften for a few mins. Put 100ml clementine juice into a small pan and gently heat. When the gelatine feels soft and the juice is just simmering, remove the juice from the heat and squeeze out any excess water from the gelatine sheets. Drop the sheets into the hot juice and swirl to melt. Make sure there are no visible lumps of gelatine before you move onto the next stage.\nStir the hot juice into the rest of the juice with the prosecco, then transfer to a jug. Pour between 6 small glasses. Sit the jellies in a small tray or dish, cover with a sheet of cling film and chill for at least 4 hrs (or up to 48 hrs) until set.\nWhen ready to serve, use a pair of tweezers to carefully put a piece of gold leaf on the surface of each jelly."}
{"text": "Heat oven to 220C/200C fan/gas 7. Tip the chicken wings into a roomy roasting tin with the turkey neck (if using), carrots, onions, celery and thyme. Scatter over the sugar, toss in the oil and roast for 50 mins until brown and lightly charred.\nGet the kettle on. Put the roasting tin on a low heat, stir in the tomato purée and flour, and cook until sticky. Splash in the balsamic vinegar, then pour over 1.5 litres water to just cover all the ingredients. Bring to a simmer. Crumble in the stock cube and use a potato masher to mash all the ingredients together to release the flavour.\nSimmer everything for 20 mins until you have a tasty thickened gravy, then strain it through a sieve, pushing down hard on all the mushy veg. Cool and chill for up to 3 days, or freeze for up to 3 months.\nHeat the gravy to serve, adding roasting juices from your turkey, if you like."}
{"text": "Bring a big saucepan of salted water to the boil. Tip in the potatoes and simmer until almost tender, about 20 mins. Drain really well and steam dry for a few mins. Return to the pan and toss with 2 tbsp of the oil, the spring onions, thyme leaves and lots of seasoning.\nGrease your largest baking tray with some melted butter and press the potatoes into it. Put a baking sheet on top and gently press down to squash the spuds into a cake. Cover and chill until ready for breakfast.\nHeat oven to 220C/200C fan/gas 7. Drizzle the melted butter and remaining oil over the potato cake and bake for 30 mins until golden.\nAdd the bacon in a few piles and bake for another 15 mins. Dot over the tomato halves and the remaining thyme sprig, sprinkle with plenty of pepper, then crack the eggs among the gaps and bake for 5-8 mins, depending how you like your eggs.\nTo serve, cut the potato cake into portions and pile onto 6 plates, along with the eggs, bacon, tomatoes and some buttered toast. Serve with brown and tomato sauce, tea and orange juice, if you like."}
{"text": "Mix the berries and cherry jam together, and spoon into your trifle bowl. Scatter over the Madeira cake and push down a little into the berries.\nPut the custard, mascarpone and 3 tbsp sugar in a bowl together and beat until smooth, then dollop all over the trifle. Put the double cream, remaining 2 tbsp sugar and sherry in a bowl and beat until soft peaks form. Cling film both the trifle bowl and cream and chill until ready to serve. You can do this up to 24 hours in advance.\nTo serve, spoon the sherry cream all over the trifle, then scatter with your favourite decoration."}
{"text": "Fry the onion and garlic in the oil until softened. Add the tomatoes and sugar, a little splash of vinegar and some seasoning, then simmer for 20 mins until really thick. Stir in the turkey and transfer to a baking dish. Heat oven to 220C/200C fan/gas 7.\nTear over the mozzarella in chunks, then scatter over the breadcrumbs with a bit more ground pepper. Bake for 20 mins until turkey is piping hot through, and the top is golden and bubbling. Eat with mash, jackets, rice or pasta"}
{"text": "For the custard, whisk 150g sugar, the egg yolks and cornflour in a bowl until pale and smooth. Pour 300ml cream, the milk and 65ml of the alcohol into a saucepan. Split the vanilla pod, scrape out the seeds and add to the cream with the pod. Heat until steaming but not boiling, then pour the hot liquid onto the yolks, whisking as you go. Strain the liquid through a sieve into a clean saucepan and discard the vanilla pod. Return to a low-medium heat and whisk for about 10 mins until very thick. If you get lumps, simply whisk them out. Pour the custard into a jug and cover with cling film directly on the surface. Chill for 11 /2 hrs.\nArrange half the profiteroles in the base of a 2-litre trifle bowl. Spoon 2 tbsp of the remaining alcohol over the profiteroles along with the orange juice, then crumble over the biscuits. Trickle the custard over the profiterole base. Arrange the remaining profiteroles on top of the custard, working around the edges first, then filling the centre. Arrange the clementine slices around the edge of the bowl, tucking them around the profiteroles\nWhisk the remaining alcohol, 500ml cream, 50g sugar and the orange zest until holding soft peaks. Spread the mixture over the profiteroles, right to the edge of the bowl, then return to the fridge until you’re ready to serve. \nFor the meringue, put the egg whites, the remaining 175g sugar, 1 tbsp water and a good pinch of salt in a heatproof bowl over a pan of simmering water, making sure the bowl doesn’t touch the water. Whisk until thick and leaving a prominent trail from the beaters – this will take about 4 mins. Take the bowl off the heat and continue whisking for another 3 mins until cooled slightly and very stiff.\nSpoon the meringue onto the trifle, creating peaks and troughs with the back of a spoon. Use a blowtorch to scorch the meringue if you have one (but don’t hold it too close to the bowl if it’s made of delicate glass!). Best served straight away, but will keep for a day in the fridge."}
{"text": "To make the roll, put the ham hocks in a large pan and add all the ingredients, except the chopped parsley (do add the stalks) and pistachios. Cover with cold water, bring to the boil and simmer gently for 3-4 hrs until the meat is very tender.\nRemove the hocks from the liquid, reserving 100ml (save the rest to make a split pea or chunky vegetable soup), and leave them until just cool enough to handle – the hotter the ham, the easier it is to shred. If you have a pair of clean washing-up or food preparation gloves, it's easier to handle the hocks while they are hot. Take the meat off the bone and shred into another bowl, discarding any skin, large bits of fat, gristle or cartilage. Add the pistachios, chopped parsley and 100ml ham stock in with the ham, and add a drizzle more vinegar. Squish everything through your fingers to mix it a bit more. \nLay overlapping pieces of cling film on a clean work surface the size of an A3 piece of paper. Pile the mixture along the bottom length of the cling film, leaving about 10cm free on each side. Roll the ham in the cling film into a large, tight sausage shape, piercing with a skewer once or twice to release any air, then put in the fridge overnight. Can be made up to four days ahead.\nTo make the dressing, tip the mustard into a bowl and slowly whisk in the vinegar, then the oil, to make an emulsion. Tip into a squeezy bottle if you have one. Using a small melon baller, scoop out balls of the apples, then tip into a bowl with the vinegar, add the shallot rings and leave for a few mins to pickle.\nTo serve, carve the ham roll on the diagonal, still in the cling film, into slices about 2cm thick. Peel off the cling film, put the slices on plates and brush with a little rapeseed oil if you want to make it shiny. Build a thin line of watercress along the other side of the plate and arrange three apple balls and some shallot rings along the watercress, then scatter with chunks of scratchings. Dot the plate with blobs of dressing and serve the rest on the side."}
{"text": "Tip the flour and ½ tsp salt into a food processor fitted with a dough blade. Add the butter and process until the mixture resembles fine breadcrumbs. Stir in the yeast, then the sugar and cardamom.\nWarm the milk until it is hand hot, then add to the dry mix to form a soft dough. Process the dough for 2 mins, then leave in the machine to rise for about 1 hr until it springs back when pressed with a finger. Process the dough briefly in the machine, then tip out onto a lightly floured surface.\nHeat oven to 220C/200C fan/gas 7. Line 2 baking sheets with baking paper. For the filling, mix the marzipan with the cardamom and butter. Roll out sthe dough to a 50 x 20cm rectangle. Spread the filling over the dough to within 1cm of the edges. Roll up the dough from one long edge. Cut into 20 slices, about 3cm thick, then transfer to the baking sheets, cut sides up. Cover with a tea towel and leave to rise for 30-40 mins until well risen.\nBrush the whirls with beaten egg and sprinkle with broken sugar. Bake for 12-15 mins until risen and golden. Best eaten freshly baked, or freeze on the day of baking for up to a month."}
{"text": "To make the biscuits, put the butter, sugar and vanilla in a bowl and beat with an electric whisk until creamy. Add the flour and cinnamon, and combine with a spatula to make a soft dough. Form into a ball, wrap in cling film and chill for at least 1 hr.\nIn a saucepan, melt the butter, sugar, golden syrup and salt. Remove from the heat and whisk in the flour, then stir in the cherries and almonds. Set aside to cool and firm up a little. Heat oven to 180C/160C fan/gas 4 and line a baking sheet with parchment.\nTip the dough onto a floured work surface and roll out to the thickness of a £1 coin. Using a 6cm fluted cookie cutter, stamp out as many circles as you can, then scrunch up the trimmings, re -roll and stamp out some more. Transfer to the baking sheet, and spoon some of the Florentine mixture onto each biscuit until it’s all used up. Bake on the middle shelf for 12-15 mins until the biscuits are golden and the topping has melted. Leave to cool on the sheet for at least 15 mins.\nWhile the biscuits cool, melt the chocolate in a small heatproof bowl suspended over a pan of gently simmering water, or in short bursts in the microwave. Stir every 30 secs or so to ensure it doesn’t burn. Dip each biscuit about a third of the way into the chocolate, then return to the sheet to set. You may need to spoon the chocolate over the final few. Will keep for up to four days in a sealed container."}
{"text": "Mix together the onion, vinegar, sugar and a pinch of salt. Leave to pickle while you dice the beetroot and roughly chop the nuts.\nDivide the watercress and smoked mackerel between six plates. Scatter over the beetroot and nuts, then top with a cluster of the pickled onions. Whisk the oil into the pickling vinegar, then drizzle the dressing around the outside of each plate."}
{"text": "To make the blini batter, blend the cooked beetroot and Greek yogurt with a stick blender until smooth. Whisk in the eggs, bicarbonate of soda and self-raising flour.\nDrop teaspoonfuls of the mixture into a hot non-stick pan. Turn over when small bubbles start to form on the surface of each, then cook for about 30 secs and transfer to a wire rack. Repeat until all the batter is used up. Can be made a day ahead and kept in an airtight container.\nSpread each blini with a little cream cheese and season with salt and black pepper. Top with smoked salmon trimmings and sprigs of dill."}
{"text": "Fry the onion and apple in the oil until softened in a casserole or deep pan. Stir in the sage for 1 min, then stir in the flour. Gradually stir in the stock followed by the mustard and honey.\nBring up to a simmer and stir in the turkey and roast veg. Cover and gently simmer for 15 mins until turkey is piping hot. Season and eat with mash or jacket potatoes."}
{"text": "Combine all ingredients in a bowl and mix. \nNow you can use the spice mix in other recipes, including our \n, \n, \n, or a fluffy \n for frosting your cakes with."}
{"text": "Take your turkey crown out of the fridge 1-2 hrs before you want to cook it. Heat oven to 200C/180C fan/gas 6. Cut 4 slices from one of the oranges. Juice the rest of it along with another of the oranges. In a small bowl, stir the orange juice together with the honey and the picked thyme leaves, the soy sauce and a good grinding of black pepper. \nLoosen the skin over the turkey breast. Place two slices of orange, a bay leaf and thyme sprig under the skin, on both sides of the breast, then spoon in some of the juice mix and smooth the skin back over. Tip the orange wedges into a roomy roasting tin with the carrots and parsnips. Nestle the crown amongst the vegetables and oranges. Drizzle over about a third of the remaining orange juice mix and roast everything in the oven for 30 mins. Remove, give the veg a stir and drizzle over another third of the juice mix, then return to the oven and do that again one more time, roasting the turkey for a total of 1hr 30 mins (covering with foil halfway through if it begins to colour too much).\nRemove the turkey from the roasting tin and place on a board covered with foil, then turn the oven up to 220C/200C fan/gas 8. Toss the veg in a drizzle of honey and put the tin back in the oven to caramelise the veg for 25-30 mins, leaving the turkey crown to rest. Serve the crown on a platter surrounded by the glazed roots, orange wedges and extra thyme sprigs, if you like. Remove the sticky skin from the breast before \n to serve as a side."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Have ready an 18-20cm springform cake tin. Heat the oil and butter and gently fry the shallots and celery for 5 mins without colouring them. Tip into a bowl and add the breadcrumbs, sausagemeat, walnuts, orange zest and sage. Add plenty of pepper and a little salt, if using, and mix together with your hands. Add the egg, then mix well.\nArrange the bacon slices in the tin, leaving 5cm strip on the base, then lay them up around the sides of the tin and let the excess hang over the edge. Carefully fill the tin with the stuffing mix, levelling it on top. Fold the bacon over the top of the stuffing, gathering and twisting the ends loosely in the centre. Scatter over the remaining walnuts, pressing them in slightly.\nSet the tin on a baking sheet to catch any juices that escape, then bake for 40-45 mins until the top is golden. Cool in the tin for 10 mins, then remove onto a serving plate and scatter with parsley. Cut into wedges to serve."}
{"text": "Heat the butter in a medium saucepan on a low heat. Add the chestnuts, celery and apple, and cook gently for 4 mins. Pour in the stock, bring to the boil and season with 1 tsp fine sea salt, 2 pinches freshly ground white pepper, the sugar and lemon juice. Cover and cook on a low heat (so that the bubbles are just breaking the surface) for 20-25 mins until soft and melting.\nMeanwhile, blanch the sprouts in boiling salted water for 6 mins, then drain well. Add the sprouts to the chestnut pan, sizzle for 5 mins, then tip into a serving dish."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Wash the turkey and pat dry. Strip the leaves from half the rosemary and thyme stalks and finely chop. In a bowl, combine the lemon zest, chopped herbs, pancetta and mascarpone. Season well.\nHalve the zested lemons and stuff into the cavity, along with the remaining herb sprigs. Use your hand to loosen the skin lying over the breast of the turkey, to create a pocket. Push the mascarpone mixture under the breast skin to create a thick, even layer.\nPut the onion slices into a large, flameproof roasting tin, place the turkey on top and cover loosely with foil. Cook for 3-3¾ hrs, until the juices of the bird run clear. Baste every 30 mins and uncover for the last 30 mins if needed, to brown the bird. When cooked, take the turkey from the oven, remove from the tin and leave to rest on a platter, covered loosely with foil, for 30 mins.\nTo make the gravy, pour away any excess fat from the roasting tin and discard the onion slices. Set the tin over a medium heat, then sprinkle over the flour. Stir through and cook for 2 mins. Slowly whisk in the wine and stock. Bring to a boil, scraping the bits from the bottom, then simmer over a low heat for 15 mins. Serve the gravy with the turkey."}
{"text": "Crumble the cake into fine crumbs using your hands or in a food processor. Put into a bowl. In another bowl, beat together the butter and icing sugar until creamy.\nMelt the plain chocolate in the microwave or in a bowl over a pan of barely simmering water. Add the melted chocolate to the butter mixture and combine well. Add this to the cake crumbs and mix thoroughly using your hands, until it sticks together. Divide the mixture into eight and shape each one into a smooth ball. Insert a cake pop stick, place on a tray lined with baking parchment and chill for at least 2 hours.\nMelt the milk chocolate in the microwave or in a bowl over a pan of barely simmering water. Take a cake pop and dip in the chocolate. Shake gently until the excess has drained off. Push into a polystyrene block.\nMake two holes in the top of the head and insert a pretzel 'antler' in each one. Press a sweetie nose onto the front and hold for a few seconds until attached. Repeat with all the other cake pops. Leave to set for about 20 mins and then using black icing, pipe on eyes and a mouth."}
{"text": "Using a fine, clean paintbrush, paint a thin layer of honey around the rim of 4 margarita or martini glasses. In a saucer, combine the orange zest, salt and sugar, then turn the glasses upside down and dip them into the mixture. Put the glasses in the fridge to chill.\nIn a cocktail shaker, combine the orange juice, tequila, lime juice, cranberry juice, triple sec and ice, and shake to combine. When the outside of the shaker feels cold, strain the mixture into your prepared glasses and serve."}
{"text": "First, make the pastry. Using a tabletop mixer or an electric hand whisk, cream together the butter and sugar with a pinch of salt until soft and fluffy. Add the yolks, then fold in the flour until the pastry just comes together, being careful not to overwork. Wrap in cling film and leave to rest in the fridge for 1 hr.\nMeanwhile, make the filling. Cook the butter, sugar, orange zest, apple and cinnamon over a medium heat for 15 mins or until you have a thick purée. Add the dried fruit and mixed peel for the final 1-2 mins, then remove from the heat. Once cool, remove the cinnamon stick, and stir in the brandy and suet.\nOn a lightly floured surface, roll out the pastry to the thickness of a £1 coin, then use to line a 25cm loose-bottomed tart case. Return to the fridge for 30 mins until well chilled.\nHeat oven to 180C/160C fan/gas 4. Prick the base of the tart case with a fork, line with baking parchment and fill with baking beans or uncooked rice. Bake for 12 mins, then remove the baking beans and parchment and cook for 3 mins more.\nMeanwhile, put the flour, sugar and butter for the crumble in a bowl. Rub together with your fingertips until it resembles coarse breadcrumbs, then mix in the frosted walnuts.\nSpoon the mincemeat filling into the pastry case and cover with the crumble. Return to the oven for 30 mins until bubbling at the edges and the topping is golden and gooey. Serve warm or cool with custard or clotted cream."}
{"text": "Put 200g flour in the Kilner jar with 200ml cool water. Mix well, then cover with the muslin, leaving the lid off. Leave the mixture somewhere warm but away from direct sunlight for 2-3 days until it has swelled and is frothing with bubbles.\nTo ‘feed’ the starter, throw half of it away, then top up with 100g flour and 100ml cool water. Mix well and leave for two to three days more. Once the starter is puffy and foamy again, it is ready to use.\nWhen making sourdough bread, use as much of the starter as your recipe calls for, then keep it in the fridge, ‘feeding’ it 100g flour and 100ml cool water every week. "}
{"text": "Heat oven to 180C/160C fan/gas 4. Bring a large pan of salted water to the boil. Drop in the cauliflower florets and cook for 10 mins until soft but holding their shape. Drain and allow to steam-dry.\nMeanwhile, heat the oil and butter in a frying pan over a medium heat. Add the onion and a pinch of salt, then cook for 8 mins until softened and caramelising. Stir in the garlic, chopped sage leaves and chopped chestnuts, and cook for 2 mins or until fragrant. Remove the pan from the heat and leave to cool slightly.\nGrease and line the base of a 23cm springform cake tin with baking parchment. Put the flour, polenta, baking powder and cheese in a large bowl. Whisk in the eggs so that you have a smooth batter, then carefully fold in the cooked onion mixture and cauliflower.\nTip the mixture into the prepared tin and arrange the remaining sage leaves and chestnuts on top. Bake for 40 mins until golden brown. Serve warm as a main course with a big green salad, if you like."}
{"text": "The cake and stars are best made a day ahead (the cake is easier to slice and fill, and the stars have time to set). Heat oven to 160C/fan 140C/gas 3. Butter and base-line a deep loaf tin (22 x 11 x 6cm). Put the chocolate and butter for the cake in a saucepan. Mix the coffee with 50ml water, then pour into the pan. Warm through over a low heat, just to melt – be careful not to overheat.\nWhile the chocolate melts, mix both flours with the bicarbonate of soda, both sugars and the cocoa. Break down any lumps in the sugar with your fingers. Beat the eggs, then stir in the soured cream. Pour this and the melted chocolate over the flour mixture, then stir everything together – the mix will be very soft. Pour it into the tin, then bake for about 1½ hrs, or until firm on top. Let the cake cool in the tin (it may crack if you turn it out too soon), then loosen the sides and carefully turn it out onto a wire rack to cool completely.\nTo make the stars, line a baking sheet with baking parchment. Melt both chocolates separately. Pour and spread the white chocolate thinly into a rectangle on the parchment. Drizzle the dark chocolate off the end of a teaspoon in bold squiggles over the top. Leave in a cool, dry place (not the fridge) until almost set but not hard, then lightly press down with a star cutter, about 5.5cm across, to make at least 6 star outlines. (Make a few extra in case of breakages and wipe the cutter each time you press a star shape.) When completely set, cut through the star outlines with a small sharp knife, then carefully lift them off onto baking parchment.\nFor the white chocolate icing, heat the cream just to boiling. Remove from the heat, tip in the chocolate and swirl so it starts to melt, then pour in the boiling water and stir to melt completely. Pour into a small bowl and chill in the fridge for about 1 hr to cool and thicken slightly. Beat with an electric hand mixer until thick and glossy.\nWhen the cake is completely cold, place it into the fridge to chill (this makes it easier to slice). Take the cake out of the fridge and turn it over so the flat base becomes the top of the cake. Slice the cake horizontally into three. Sandwich back together with the white chocolate icing, not quite up to the edges. (This can be done a day ahead and chilled.)\nFor the dark chocolate icing, heat the cream with the sugar just to boiling. Remove from the heat, tip in the chocolate, then stir in the boiling water. Leave to cool and thicken a little. Put the cake on a wire rack with parchment paper underneath (to catch any drips). Pour and spread the icing all over the cake. Leave to set slightly, then arrange the truffles down the centre and prop 5 or 6 of your best stars against them."}
{"text": "Bring a large pan of salted water to the boil, add your sliced sprouts and cabbage, then boil for 2 mins. Drain, rinse in cold water to cool, then drain well again. Soften the sliced shallots in a frying pan with the butter and oil until meltingly soft. Cover the veg separately with cling film and chill for up to 24 hrs, until just before serving.\nWhile your turkey is resting, tip shallots back into your largest frying pan with the stock and heat until simmering. Stir in the blanched sprouts, cabbage and frozen peas and cook for 2-3 mins until all the veg is tender and stock reduced. Season and stir in the walnuts just before serving"}
{"text": "Heat the oven to 200C/fan 180C/gas 6. Cut each beetroot into 4-6 wedges and arrange in a large roasting tin. Mix together the remaining ingredients and pour over the beetroot. Season well, and toss together so all the beetroot is thoroughly coated in the dressing. Roast for 25 mins until the beetroot is sticky and glazed."}
{"text": "Put about half the flour in a food processor with the butter and whizz until you can’t see any lumps of butter remaining. Mix the remaining flour, spices and bicarb together with a pinch of salt. Tip both the floury mixtures into your largest mixing bowl and stir in the sugar. (If you don’t have a food processor, rub the butter into all of the flour until it resembles fine crumbs. Then stir in the spices, bicarb and sugar.) Whisk the eggs with the golden syrup and stir into the flour mixture with a wooden spoon. Using your hands, knead together into a smooth dough.\nHeat oven to 200C/180C fan/gas 6. Roll a quarter of the dough out at a time on a sheet of baking parchment, to the thickness of 2 x £1 coins. Use a small, sharp knife to cut around the house templates (see tips, below)– remember that each time you’ll need 2 x A, 2 x B and 2 x C for one house. Remove trimmings and lift the gingerbread, on its parchment, onto baking trays. Re-roll trimmings to cut out all the shapes you need.\nBake the gingerbread one tray at a time on a high shelf in the oven for 8-10 mins, until a lovely, rich brown and firm to the touch. As soon as each tray is baked, carefully sit the templates back onto the relevant shapes and trim any edges to neaten. Use a cutter to stamp out any windows or cut away any doors with a small, sharp knife. Let all the biscuits cool completely.\nSieve the royal icing sugar into a bowl and stir in dribbles of water until you have a stiff icing. Spoon some into a food bag (cover the rest), snip the tiniest bit off the corner and pipe any icing decorations you want onto the gingerbread. Leave to dry.\nArrange the wall biscuits as you are going to assemble them, then pipe icing along the side edges and stick the walls together. Pipe extra icing where the walls join each other on the inside of the house, and support the sides using your icing balls. Leave for a few hrs until set.\nOnce dry, stick on the roofs, as above – you may need to hold the biscuits on firmly for a few mins until the icing starts to set – or shape your icing balls to support the edges of the roof. Set overnight, then use any remaining royal icing to help you decorate your houses with sweets and sprinkles."}
{"text": "Lay a length of string twice the length of the turkey fillet on a chopping board. Arrange 4 more lengths of string large enough to tie around the width of the fillet at intervals across your first string, winding each one around the main string once so they don't move around too much. Lay 8 rashers of bacon, across the main string and running in the same direction as the 4 strings, overlap the rashers slightly so they don’t pull apart when you wrap the turkey. Scatter with 1 tbsp of the thyme and grind over some black pepper.\nPlace a turkey fillet on top of the bacon then wrap the bacon around it and tie the strings around the middle and around the length to hold everything in place, it should be snug but not too tight Snip off any excess string with scissors.\nHeat the oil in a large frying pan and fry the fillet on all sides until browned then remove from the pan. While browning the first fillet wrap and tie the other one then brown that too. Set aside with the other breast.\nAdd the onion and carrots to the pan and cook until starting to colour. Tip the vegetables into the slow cooker and add the bay leaves and mushrooms then arrange the turkey fillets on top. Pour the wine and stock into the frying pan, bring to a rapid boil then pour in to the slow cooker, cover and cook on LOW for 3-4 hours until a skewer poked into the centre comes out feeling very hot or a meat thermometer reads 75C.\nLift the turkey breasts onto a plate and cover with foil. Mix the flour with 4 tbsp water to make a smooth liquid. Strain the cooking juices from the slow cooker into a pan, whisk in the flour mixture and keep whisking over the heat while bringing to a simmer to make a thin gravy. Serve with the sliced turkey breasts and traditional vegetables and accompaniments. If taking the turkey to the table on a platter, scatter with a little thyme and grind over some black pepper."}
{"text": "Toast the pecans in a dry saucepan for 1-2 mins, then take off the heat. Quickly add the sugar and 80ml water, stir rapidly to dissolve the sugar, add the salt, then leave the mixture to cool completely. Pour through a sieve to remove the pecans.\nPour the pecan salted caramel syrup, vodka, egg whites, clementine juice and bitters into a cocktail shaker. Shake hard for 30 secs to add volume to the egg white. Add some ice and shake again for a further 15 secs, then strain into rocks or coupe glasses. Garnish each with a dehydrated orange slice and grate fresh nutmeg over, to taste. Serve immediately."}
{"text": "Put the sugar, syrup and butter in a \n. Bring to a simmer, then bubble for 1-2 mins, stirring. Set aside to cool for 10 mins.\nTip the flour, bicarb and spices into a large \n. Add the syrup mixture and the egg, stir to bring everything together, then gently knead in the bowl until smooth. The dough will feel a little soft, but will firm up once cooled. Wrap and chill for at least 30 mins.\nRemove the dough from the fridge and leave at room temperature until softened. Heat oven to 200C/180C fan/gas 6 and line two baking trays with baking parchment.\nWorking with half the dough at a time (keeping the remaining dough well wrapped), roll out to the thickness of a £1 coin. Cut out 10-12 stars in descending size, re-rolling the offcuts if you need to. Arrange over the trays and bake for 8 mins until a few shades darker and puffed up a little. Cool on the trays for 5 mins, then transfer to a \n to cool completely. \nMix the icing sugar with enough water to make a thick, pipeable icing. Transfer to a \n and decorate. Pipe a blob of icing in the middle of each biscuit and stack them to make a tree, sticking the smallest star on top, standing upright."}
{"text": "Gently warm 60g golden caster sugar in a pan with 30ml water and 1 tbsp allspice. Cook gently until the sugar has dissolved, then leave the mixture to cool. Strain through a sieve lined with a coffee filter (or a double layer of kitchen paper).\nPour 60ml of the spiced syrup into a cocktail shaker along with 200ml rum and 90ml lime juice. Shake with ice and strain between six flute glasses. Top up with 600ml champagne and garnish each with an orange twist."}
{"text": "Heat oven to 180C/160C fan/gas 4 and brush with oil the inside of a 2.4 -litre non-stick bundt tin. Make sure you get into any corners to ensure the cake doesn’t stick. Pour the milk and molasses into a pan and heat gently, whisking until the molasses has melted, then set aside to cool a little. Combine the flour, baking powder, bicarb, sugar, spices and 1/2 tsp salt in a large bowl. Shake the bowl a few times so any lumps of sugar come to the surface and squeeze through your fingers.\nIn a jug, mix the oil, buttermilk, ginger beer and eggs. Add the cooled molasses mixture and whisk again, then pour into the dry ingredients, along with the chopped pineapple. Stir everything to combine, then scrape into the tin. Bake for 1 hr until a skewer inserted into the centre comes out clean. If not, return to the oven for another 10 mins and check again. Leave to cool in the tin for 15 mins, then very carefully turn out onto a wire rack.\nFor the glaze, combine the molasses, icing sugar and pineapple juice in a saucepan and set over a low heat. Whisk until smooth and glossy, then brush generously all over the cooling cake, allowing it to soak in. To serve, top with the glacé pineapple ( hold in place with halved cocktail sticks, if you like), and crystallised ginger. Will keep well in an airtight container for five days."}
{"text": "Put all the dried fruit in a bowl and pour over the brandy. Leave to soak while you line a 900g loaf tin with cling film.\nMelt the chocolate in a heatproof bowl set over a pan of barely simmering water, then set aside to cool a little. \n the egg yolks with the sugar and honey in a separate bowl until light, then fold into the melted chocolate. Place the mixture back over the pan of hot water and whisk for a couple of minutes until thickened.\nMelt the butter with the cocoa in a pan, leave to cool to room temperature, then whisk into the chocolate mixture. Whip the cream to soft peaks, then fold that into the chocolate too. Finally, fold in the fruit and the ginger nuts. Scrape everything into the prepared loaf tin, then freeze overnight, or for up to one month. To serve, turn out of the tin and cut into slices using a hot knife. The parfait is delicious on its own but also works well with a spoonful of crème fraîche."}
{"text": "Put the sprouts in a large pan, cover with boiling water and cook for 8-10 mins or until very tender. Drain, and leave to steam-dry for a few mins. Tip back into a saucepan and mash to a chunky texture with a potato masher. Add the butter, cream and nutmeg, and season well. Cook for a further 2 mins. Mix in half the chestnuts, then sprinkle over the remaining chestnuts to serve."}
{"text": "Measure all your ingredients into separate bowls. Heat the chocolate in a microwave-safe bowl in 30-sec bursts until melted, stirring each time. Or put it in a heatproof bowl set over (but not touching) a pan of simmering water (an adult should help with this bit). Stir frequently until the chocolate has melted smoothly. \nPour the melted chocolate into four or five small bowls. Use the food colouring to dye the chocolate in the colours you like best. Food colouring can be very strong, so start by adding a tiny amount, mixing well, then add more if you like.\nLine a large tray or board with baking parchment and spoon the different coloured chocolates onto the parchment in puddles, in any order you like. The different colours should start to join up and become one big puddle.\nUse a skewer or a cocktail stick to swirl the colours together, but don’t swirl too much, otherwise the colours will blend into one. Gently shake the tray from side to side to help the chocolate sit in an even layer and fill in any gaps.\nDecorate with your sprinkles, sweets and marshmallows. Leave the chocolate to set in a cool place, or overnight, until set hard. Then break it into pieces and place in gift boxes lined with baking parchment. Will keep in the fridge for up to a week."}
{"text": "Start by making the meringue topping. Whisk the egg whites to stiff peaks, then set aside. Put the sugar and 3 tbsp water in a saucepan and set over a low heat. Cook until the sugar has dissolved, then continue to heat, stirring occasionally, until the syrup reaches 120C on a sugar thermometer. While whisking the egg whites with an electric whisk, slowly add the hot syrup in a steady stream, being careful to pour the syrup into the eggs and not onto the sides of the bowl or the whisk, as it may stick. Once all the syrup has been incorporated, continue whisking until the mixture is glossy and stiff – about 5 mins. Transfer to a piping bag fitted with a wide round nozzle until needed. Can be made 1hr ahead–store in a cool place.\nNow make the base of the cocktails. Pour the vodka, coffee liqueur, espresso, crème de cacao and chestnut liqueur into a cocktail shaker and add a handful of ice. Shake well, then strain into 4 Champagne saucers or small Margarita glasses.\nCarefully pipe your meringue topping onto the surface of the glasses, starting on the outside edge and building it up so that it doesn’t sink. Using a blowtorch, very carefully caramelise the top, then add a marron glacé to each. Serve immediately with a spoon."}
{"text": "Remove any tough leaves and trim sprouts, then steam or boil for 10 mins until tender.\nTear the bread into crumbs. Heat a large frying pan and pour in the olive oil. Add the bread and fry until just crisp. Tip in the flaked almonds, garlic and lemon zest, then cook gently until everything is golden. Place the sprouts in a serving dish, season, then toss with the crumbs and a little extra olive oil to finish."}
{"text": "Heat oven to 190C/170C fan/gas 5. Cut the bacon rashers in half. Wrap a piece of bacon around each of the chipolatas.\nPlace on a baking tray and cook for 30-35 mins until golden."}
{"text": "Pour a third of all the ingredients (except the pared orange, cloves and cinammon) into a cocktail shaker with a handful of ice.\nShake hard for 1 min, then strain into two wine glasses. Repeat twice more with the remaining ingredients using fresh ice each time. Stud each piece of pared orange with a clove, then use to garnish each glass along with a pinch of cinnamon."}
{"text": "In a large saucepan, heat the oil over a low heat. Tie the thyme sprigs and bay leaves together with a piece of string and add them to the pan with the onion and a pinch of salt. Cook for about 10 mins until softened but not coloured.\nStir in the garlic and cook for 1 min more, then tip in the celeriac and potato. Give everything a good stir and season with a big pinch of salt and white pepper. Pour in the stock, bring to the boil, then simmer for around 30 mins until the vegetables are completely soft.\nDiscard the herbs, then stir through the cream, remove from the heat and blitz until completely smooth. Stir through 1/2 tbsp truffle oil at a time and taste for seasoning – the strength of the oil will vary, so it’s better to start with less oil and add a little at a time.\nTo serve, reheat the soup until piping hot, then ladle into bowls and top with the hazelnuts, some black pepper and an extra drizzle of truffle oil."}
{"text": "Heat oven to 180C/160C fan/gas 4. Butter and line three 18cm (or two 20cm) cake tins. Beat the butter and sugar together until light and fluffy. Add the eggs, beating them in one at a time. Fold in the flour, baking powder and a pinch of salt, then fold in the crème fraîche and chocolate and 100ml boiling water.\nDivide the cake mixture between the tins and level the tops of the batter. Bake for 25-30 mins or until a skewer inserted into the middle comes out clean. Leave to cool for 10 mins in the tin, then tip out onto a cooling rack and peel off the parchment. Set aside to cool completely.\nTo make the angel frosting, put the sugar, vanilla and liquid glucose in a pan with 125ml water. Bring to the boil and cook until the sugar has melted – the syrup turns clear and the mixture hits 130C on a sugar thermometer (be very careful with hot sugar). Take off the heat. Meanwhile, beat the egg whites until stiff then, while still beating, gradually pour in the hot sugar syrup in a steady stream. Keep beating until the mixture is fluffy and thick enough to spread – this might take a few mins as the mixture cools. Beat in the icing sugar.\nSpread two of the sponges with jam and some of the icing mixture, then sandwich the cakes together with the plain one on top. Use a little of the frosting to ice the whole cake (don’t worry about crumbs at this stage). Use the remaining icing to ice the cake again, smoothing the side, and swirling it on top. Crush four of the candy canes and sprinkle over the cake, then add the remaining whole candy canes, meringues and sweets."}
{"text": "Put the cabbage in a wide shallow pan with the butter, apple, bay leaf and cloves. Cook, stirring, until the cabbage starts to wilt. Add the vinegar (stand back and don’t breathe in until the steam subsides), then continue to stir and cook until the vinegar has almost all disappeared. Add the sugar and stir until it has completely dissolved – be careful not to let it burn. Sprinkle with walnuts to serve. "}
{"text": "Bring a pan of water to a simmer over a low heat. Put the chocolate in a heatproof bowl and sit it on top of the pan, making sure that the water doesn’t touch the bottom of the bowl, and gently melt the chocolate.\nPush a lollipop or cake pop stick into each marshmallow. Check the chocolate is melted completely by giving it a stir, then scrape it into a smaller bowl. Tip the white sprinkles into another small bowl. Put a wire rack next to the bowl of chocolate and a sheet of baking parchment next to the bowl of sprinkles.\nHolding the end of a stick, dip a marshmallow into the chocolate so that it is completely coated. Lift it out, but hold it over the bowl to allow the extra chocolate to drip back in, then put it on the wire rack. Dunk the marshmallows, one by one, then line them up on the wire rack in the order that you dunked them.\nPick up the first marshmallow you dunked and dip into the sprinkles to completely coat. Sit the snowball marshmallow on the baking parchment. Continue to dip and coat the marshmallows, working along the line so that you cover them in sprinkles in the same order that you dunked them in chocolate. When all the marshmallows are covered, leave them on the baking parchment until they are set.\nYou can now wrap the marshmallows in cellophane and tie with ribbons if you’re giving them as a present. Alternatively, if you want to enjoy them right away, warm 1 mug of milk – in a microwave or saucepan – per snowball. Use your snowball as a stirrer in each mug of milk and keep stirring until all the sprinkles, chocolate and most of the marshmallow have melted. Check the milk is not too hot, then drink up. Will keep for up to 2 weeks in cellophane bags."}
{"text": "Put the sugar, golden syrup and butter in a saucepan. Bring to a simmer, then bubble for 1-2 mins, stirring until well combined. Set aside to cool for 10 mins.\nTip the flour, bicarbonate of soda and spices into a large bowl. Add the warm syrup mixture and the egg, stir to bring everything together, then gently knead in the bowl until smooth and streak-free. The dough will feel a little soft now, but will firm up once cooled. Wrap the dough in cling film and chill for at least 30 mins.\nRemove the dough from the fridge and and leave at room temperature until softened. Heat oven to 200C/180C fan/gas 6 and line two baking trays with baking parchment.\nCut off half the dough and keep the rest wrapped in cling film. Roll out the dough to the thickness of a £1 coin, then use a plate or the base of a cake tin as a template to cut out a 20cm circle. Transfer to one of the baking trays, then use a 7cm cutter to stamp out and remove a circle in the middle. Roll out the remaining dough and cut out a variety of other shapes to decorate the wreath (you’ll need about 20-25 pieces – we used stars and angels) and arrange these over the trays too.\nBake the biscuits for 10-12 mins, swapping the trays over halfway through cooking. Stamp a hole in the top of the ring using a small cutter, or the end of a piping nozzle, as soon as it comes out the oven – you can tie a pretty ribbon through this later. Leave to cool on the trays, then transfer to a wire rack to cool completely.\nMix the icing sugar with enough water to make a thick icing. Transfer to a piping bag fitted with a small nozzle, then decorate the biscuits as you wish, using a little edible glitter, if you like. We flooded some of the biscuits with pale blue icing (see tip) and piped white details on the others. Leave the icing to dry for 1-2 hrs, then use a little more icing to stick the biscuits to the wreath. Thread a ribbon through the hole and wrap up in cellophane, if giving as a gift (the ribbon is just for show and may not support a hung wreath). Will keep for 2 weeks."}
{"text": "If your ham needs soaking, do this the day before cooking. Put it in a large pan (a preserving pan is great for this). Cover the ham with cold water and leave to soak in the fridge for 24 hrs, changing the water twice.\nPour away the soaking water and rinse the pan. Return the ham to the pan and add the ginger beer, bay leaves, allspice, peppercorns and 6 of the cloves. Top up the liquid with enough water to cover the ham. If the bone sticks out of the liquid, don’t worry – just rotate the ham halfway through cooking. Put over a medium heat and bring to a gentle simmer, then cover with a lid or a piece of foil. Leave to cook for 2½ hrs, topping up with water as it cooks.\nHeat oven to 200C/180C fan/gas 6. When the ham is cool enough to handle, discard the cooking liquid and pat the ham dry. Use a small, sharp knife to pare the rind away from the ham, leaving a layer of fat attached to the meat. Score the fat in a diamond pattern and stud all over with the remaining cloves. Put the ham in a roasting tin. Mix together the ginger and jam and brush the mixture over the ham. Roast for 1 hr until golden and glistening. Serve hot or cold."}
{"text": "Fill a coupe glass with crushed ice and pour over the Prosecco. Hold the rosemary sprig in the palm of your hand and clap the other hand sharply over it to lightly bruise the leaves before dropping it into the glass. Slowly pour the sloe gin and cherry brandy into the glass so that they sink to the bottom. Serve immediately."}
{"text": "In a large bowl, whisk together the cream, mascarpone, half the sherry, 3/ 4 of the zest and the icing sugar until the mixture is floppy and just holds its shape.\nCut the pandoro horizontally into five slices. Put the bottom piece on a serving plate or cake stand and drizzle over a little of the remaining sherry. Spoon over a quarter of the cream mixture and top with a handful of the almonds (saving enough for each layer and to decorate the top). Add the next layer of pandoro and continue to sandwich the layers together, rotating each at a different angle so that you create the shape of a Christmas tree.\nDust with icing sugar, then dot over the gold leaf (if using) along with the remaining almonds and orange zest."}
{"text": "Pour the grapefruit juice and Aperol into a chilled coupe glass. Add ice and gently stir to combine. Top up with the Prosecco, garnish with a twist of grapefruit zest and serve immediately."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease a 33 x 23cm Swiss roll tin and line with baking parchment, then grease the parchment too. Tip the chocolate into a heatproof bowl and place it over a pan of gently simmering water. Leave to melt, stirring occasionally, then remove from the heat and allow to cool a little (alternatively, melt it in short bursts in the microwave).\nPut the egg whites in a large, clean bowl, and the yolks and sugar in another. With very clean beaters, whisk the whites until they are just holding soft peaks. Transfer the beaters to the yolks bowl (no need to wash them) and beat until the sugar has dissolved and the mixture is thick and pale.\nAdd a large spoonful of whites to the yolks and mix with a large metal spoon to loosen the yolks a little. Add the remaining whites and gently fold into the yolks, avoiding knocking out too much air.\nWhen nearly all incorporated, sieve the cocoa over the surface, scatter over the almonds and pour in the melted chocolate. Continue folding until the mixture is well combined, then scrape into your tin. Spread the mixture to the edges and level the surface. Bake for 15-18 mins on the middle shelf of the oven until the surface is crisp and the cake feels springy.\nWhile still warm, turn the roulade out onto a large piece of baking parchment, removing the parchment you used to bake the roulade on. With a small serrated knife, make a shallow incision about 1cm in from one of the shorter edges, making sure that you don’t cut all the way thorough. Starting from this end, roll up as tightly as you can, bending the cut piece inwards to get the centre of the roll tight, using the baking parchment to help you and stop the layers sticking. Leave to set and cool.\nTip the mascarpone, cream, Malibu (if using) and icing sugar into a bowl and whisk until softly whipped. Carefully unroll the roulade – it will crack in places, but don’t worry. Spread a third of the cream all over the surface, leaving a border of about 1.5cm all the way around. Drizzle the passion fruit curd all over the surface and top evenly with the passion fruit flesh.\nStarting from the end that you used before, re-roll the roulade as tightly as you can, bending the cut piece into the cream to get the centre of the roll tight. Place the roulade, seam-side down, on a serving plate or board and spread the remaining cream all over the outside. Press the coconut flakes all over the top and sides, and dust with a little gold glitter, if you like. "}
{"text": "Beat the cream cheese, mustard and lemon juice together in a bowl, then season with a little salt and pepper and set aside.\nButterfly the turkey breast by cutting into one side of it so you can open it like a book. Cover with cling film and use a meat mallet or \n to gently bash it out to a rectangle about 3cm thick, trimming the edges to neaten it up. You can reserve this trimmings to use in another recipe, such as a turkey curry. \nLay a large sheet of baking parchment on your work surface. Lay the prosciutto over it, overlapping the slices to make a rectangular shape larger than the turkey, then place 8 sage leaves all the way down the centre of the prosciutto in a line, lengthways. Lay the turkey, skinned-side down, on the prosciutto and spread liberally with the cheese mixture. Use the edge of the baking parchment to lift and roll the prosciutto and turkey, tucking and rolling it as you would a roulade, to form a long log. Tie at intervals with string. If chilling, wrap well in cling film and put in the fridge. \nTo cook, heat oven to 200C/180C fan/gas 6. Remove the cling film and put the turkey roll seam-side down on a \n. Brush with a little oil and roast for 1 hr, or until the prosciutto has crisped up and the meat is cooked all the way through (a \n should read at least 70C). Scatter over additional sage leaves, if you like, and leave to rest for at least 15 mins before carving. "}
{"text": "Heat oven to 190C/fan 170C/gas 5. Wash and dry the turkey, removing any feathers. Pull out the giblets and the neck, then set aside. Lift up the skin that covers the neck opening, then stuff the stuffing up and under the skin, securing it tightly underneath with a skewer or two cocktail sticks. Weigh the stuffed turkey, then calculate the cooking time, allowing 40 mins per kg (20 mins per lb).\nPut the leeks and carrots along the bottom of a roasting tin in a single layer – this will make a trivet for the turkey to sit on and add flavour to the gravy. Add the neck to the tin. Sit the turkey on top and coat the breast all over with butter. Pour in the cider, cover with foil, then roast according to your timings. Keep checking the tin – if the vegetables look like they’re burning, add a splash of water or cider. At 30 mins before the end of cooking, remove the foil and season generously.\nTo test that the turkey is ready, pierce the thigh through its thickest part; the juices should run clear. Take the turkey out and leave to rest, covered with a clean tea towel. Can leave to rest for up to 1 hr. Now make the gravy. Drain the fat and juices from the tin into a jug, discarding the veg and the neck. Place the tin over a flame, then pour in the cider, scraping up the flavour-filled crusty bits with a wooden spoon. Reduce the cider by half, then strain into a saucepan (this will save you hob space later)."}
{"text": "Mix the yeast, flour, mixed spice, sugar and 1 tsp salt in a big bowl. \n together the milk, melted butter and egg, then tip into the flour mixture and stir until it forms a sticky dough. Tip onto a work surface and knead for about 8 mins until the dough feels soft and stretchy. Clean the bowl, then butter it. Return the dough to the bowl, cover with buttered cling film and set aside for about 1-2 hrs, or until doubled in size, or chill for up to 24 hrs. In a small pan, simmer the cranberries, mixed dried fruit, zests and orange juice until the fruit looks plump. Leave to cool.\nWhen you’re ready to shape the stollen, heat oven to 180C/160C fan/gas 4. Tip the dough onto a surface lightly dusted with flour. Roll out to a 50 x 30cm rectangle. Grate the marzipan over the surface of the dough (this is easier to do if the marzipan is cold). Scatter the soaked fruit and half the nuts evenly over the top, then press down lightly with your hands so they stick into the dough a bit.\nWith a long side facing you, roll up the dough as tightly as you’re able to, like a Swiss roll (see step 1 of our step-by-step guide). Pinch the dough together to seal the open edge, then use a large \n to cut the sausage of dough in half along its length, leaving one end intact by about 5cm (see step 2). You should now have two long strips of dough to work with. Move the dough onto a large baking sheet, oiled and lined with parchment. Twist the two pieces together, turning the cut edges outwards to expose the marzipan and fruit filling (see step 3). Once twisted, connect the two ends to make a wreath shape about 26cm in diameter with a 12cm hole in the middle. Tuck one end under the other to hide the uncut piece of dough (see step 4). Cover loosely with oiled cling film and leave the bread to prove for 30-40 mins until risen by roughly a third.\nUncover the bread and bake for 40-45 mins until the dough is golden all over. You may want to rotate the tray halfway through cooking to get even results. Leave to cool on the tray for 20 mins.\nMeanwhile, mix the icing sugar with enough lemon juice to make a thick but pourable icing. Drizzle over the wreath, then scatter with the rest of the nuts. "}
{"text": "Warm the milk in a saucepan until steaming but not boiling. Remove from the heat and add the butter, swirling to help it melt, then set aside to cool a little. Meanwhile, mix the flour, yeast, 50g sugar, the cinnamon and 1 tsp salt in a large bowl, or the bowl of a tabletop mixer. When the milk is warm, add it to the dry ingredients and combine to make a sticky dough. Tip onto your work surface and knead for 10 mins by hand, or for 5 mins in the mixe r until the dough is smooth and stretchy. Return to a clean oiled bowl, cover with oiled cling film and leave somewhere warm to rise for 1-2 hrs until doubled in size.\nLine your largest baking sheet with baking parchment. Tip the dough onto a lightly floured work surface and roll to a rectangle about 30 x 40cm. Grate the marzipan over the surface and scatter over the orange zest, fresh cranberries, 75g dried cranberries, 25g pistachios and 3 tbsp caster sugar. From one of the longer sides, tightly roll up the dough into a sausage, pinching the dough together at the other end to seal the open edge.\nUse a large, sharp knife to divide the sausage of dough first in half, then into quarters, then cut each quarter into three pieces, so you’re left with 12 equal pieces of dough. Turn them all cut -side up and arrange on the baking sheet in a tree shape, using one piece for a trunk and leaving space between each bun for them to expand. Make sure the pinched edge on the outside of each bun is facing towards the centre of the tree, otherwise it may come unstuck and unravel as it cooks. You should have one bun left over – bake this alongside (treat for the cook!) . Cover the sheet in one or two pieces of oiled cling film and leave to prove for 30 -40 mins, or until doubled in size and just touching\nHeat oven to 180C/160C fan/ gas 4. Bake in the middle of the oven for 20-22 mins until golden brown. While the buns cook, heat the apricot jam with 2 tsp water until runny, then set aside to cool a little. Mix the icing sugar with enough orange juice to make a thick icing and transfer it to a small disposable piping bag or plastic sandwich bag. You can spray the pistachios with gold spray at this point, if you like.\nWhen the buns are cooked, leave to cool for 15 mins, then brush all over with the apricot glaze. Snip the corner off the piping bag and drizzle icing over the top of the buns in random lines. Scatter over the remaining pistachios and dried cranberries and leave the icing to set for 10 mins before serving. Will keep in an airtight container for up to three days."}
{"text": "Mix the yeast and 250ml warm water in a small bowl, and leave to stand for 5-10 mins until foamy – this means the yeast is working. Put the flour and salt in a large mixing bowl (or use a tabletop mixer fitted with a dough hook and set at a low speed). Add the yeast mixture and mix by hand or machine until the dough comes together into a ball. If the mixture is too sticky to form a ball, add 2 tbsp flour and mix again. Knead for 12 mins by hand, or 8-10 mins on a high speed in the mixer, until smooth, then put in a lightly oiled bowl. Turn to coat the dough in the oil, cover with cling film and leave in a warm place for 2-4 hrs until doubled in size. (You can also put it in the fridge overnight, punch down and let it rise again at room temperature.)\nHeat the oven to 240C/220C/gas 9. Put a baking sheet or pizza stone on the middle shelf. If you’re using lamb leg meat, blitz it in a food processor until it’s finely minced. Heat the olive oil in a large frying pan over a medium-high heat until hot. Add the onion and garlic, and cook for 10 mins until golden. Add the lamb and cook for 5 mins or until brown, breaking up any lumps with a spoon, then pour off any excess oil. Add the spices, some seasoning, tomato purée, tomatoes and the pomegranate molasses, and cook for 5 mins more, mixing everything together well and breaking down the tomatoes with a spoon. Remove from the heat and leave to cool completely. Can be done one or two days ahead.\nRoll out the dough on a floured surface into a large rectangle about 30 x 40cm. Sprinkle 1 tsp or so of the semolina on a baking sheet. Put the dough on top and make sure it can move around. Add the spicy lamb first, then top with the red onions, pine nuts and feta. Slide onto the heated baking sheet or pizza stone and cook for 10-15 mins until crisp on the bottom.\nRemove and drizzle with a little extra pomegranate molasses, then scatter over the parsley and pomegranate seeds. Transfer to a large board and cut into diamonds to serve."}
{"text": "Mix the dry ingredients in a bowl with a pinch of salt. Combine the wet ingredients in a jug and gradually pour into the dry ingredients, whisking until a smooth batter forms.\nPut 2 tbsp of the batter in a small bowl and mix in a few drops of red food colouring. Transfer to a squeezy bottle.\nPut 1/3 of the remaining batter into the other squeezy bottle, and the remaining 2/3 into a jug.\nGently heat a drizzle of oil in a non-stick pan. Squeeze some batter into an outline of Rudolph, drawing two holes for eyes. Fill the rest with batter from the jug. Make a nose using the coloured batter. Cook for 1-2 mins, flip and cook for 1 min more. Repeat to make four pancakes. Serve with icing sugar and maple syrup."}
{"text": "To make the cure for your gravadlax, zest the orange and roughly chop a large bunch of dill. Using a pestle and mortar, grind 1 /2 tbsp peppercorns, then stir in 50g sea salt, 75g sugar, 1 tsp each coriander seeds and caraway seeds, and the zest.\nPut half the dill on a large piece of cling film and place your salmon on top. Cover with all the cure and the remaining dill, then wrap tightly. Place in a dish with something heavy on top to weigh it down.\nLeave to cure for 24-48 hrs, turning the salmon once, then rinse well and pat dry before serving. Will keep in the fridge for up to three days."}
{"text": " \nOpen the bottle of vodka and add 2 tbsp juniper berries, 6 cardamom pods, a pinch of dried rose petals, 1 tsp coriander seeds and a strip of lemon peel. Put the lid back on and leave in a cool dark place for 24 hrs.\nStrain the infused mixture through the coffee filter paper into a jug, then pour back into the bottle to store.\nTo make a martini, chill 2 martini glasses in the fridge for 30 mins. Put 50ml vermouth in a tall glass, add 150ml infused vodka and a large handful of ice. Stir well until the outside of the glass feels cold, then strain into the chilled glasses. Garnish with an olive."}
{"text": "Pour 1 litre of water into a large saucepan then add the dried rose petals, cloves, bay leaf, cinnamon stick, frozen mixed berries, cranberry sauce and orange. Bring the mixture to the boil, stirring occasionally then take off the heat. Drop in the tea bag then leave to steep for 2-3 mins. Strain through a sieve into a heatproof jug and serve warm."}
{"text": "Up to two days ahead, mix the paprika, dried herbs and lots of ground pepper with 1 tbsp flaky sea salt. Season the turkey crown with half of the herby salt mixture, then cover. Mix the remaining herby salt mixture with the butter and chill.\nTo cook, heat oven to 190C/170C fan/gas 5. Smear the herby butter all over the crown, working it under the skin. Sit the crown on a rack in a large \n, skin-side up, and roast for 1 hr 30 mins, basting with the buttery juices every 30 mins until the skin is crisp and the turkey is cooked all the way through.\nRemove the turkey from the oven and set aside. Use a small sheet of foil to make an open package of the wood chips. Place the package in a dry \n and heat until smoking, then transfer to the roasting tin. Cover everything in a large tent of foil to trap the smoke and leave the turkey to rest for 20 mins before unwrapping and \n. Save the juices from the tin to make a smoky gravy."}
{"text": " whisk together the eggs and milk in a jug. Put the flour, yeast, sugar, salt and spice in the bowl of a kitchen mixer fitted with a dough hook. Stir to combine.\nOn a medium setting, slowly pour in the egg mixture in a steady stream, continuing to stir until incorporated into a very soft, wet dough. Add the butter and increase the speed, kneading for 8-10 minutes. The dough will be ready when it clings around the dough hook. At this stage it will look more like a thick cake batter than bread dough. Cover with cling film and refrigerate overnight.\n heat the oven to 200C/fan 180C/gas 6. Line a baking sheet with foil. Remove any loose outer skins from the garlic bulbs. With a sharp knife, cut off the stem and uppermost part of the cloves. Place on the foil, drizzle over a little olive oil and season. Bring up the edges of the foil and seal to form a fairly tight parcel. Bake in the top of the oven for 35-45 minutes. Remove from the oven and leave the parcel sealed until the garlic is cool enough to handle. Remove the cloves by either squeezing the bulb upwards from the base or by teasing them out with a toothpick. Mash the garlic with a fork. Wrap well (to avoid the garlic smell transferring to other foods) and refrigerate.\n line a baking tray with baking parchment. Remove the cheese from its wooden carton and put the cheese back in the fridge until later. Put the carton in the centre of the lined tray.\nTip the dough out onto a well-floured surface. Divide into 5 large equal-sized pieces - it can help to roll the dough into an even sausage shape and mark with a knife first to get equal pieces.\nTake one piece and divide into 5 again. One at a time, roll each of these 5 pieces gently into a ball, flour your index finger and make a small, deep indent in the middle. Fill with half a teaspoon of the roasted garlic, pinching the dough over the top to seal and placing the sealed side down onto the floured surface. Cup your hand over the bun and rotate a little to get an even shape. Repeat until you have filled all 5.\nRepeat step 6 using the remaining 4 fillings.\nArrange the buns around the wooden carton, you’ll need 10 for the inner ring and 15 for the outer ring. Leave around 0.5cm between each bun, giving them room to rise. Cover with oiled cling film and leave in a warm place for 30-40 minutes or until nearly doubled in size.\nHeat oven to 190C/170C fan/gas 5. Remove any plastic wrapping or stickers from the cheese. With a small knife, make an incision in the top rim and remove the top layer of rind. Sprinkle with thyme leaves and place in the carton, cut side up. Brush the buns with the beaten egg and scatter with poppy seeds. Bake for 15-20 minutes until golden brown. Slide onto a serving platter. Decorate with the herbs and fresh cranberries. Serve the extra cheese alongside if using."}
{"text": "Butter and line the base of a 23cm loose-bottomed cake tin. Whizz the biscuits to a rough crumb in a \n, or put them in a sandwich bag and crush with a \n. Tip the crumbs into a bowl with the melted butter, stem ginger and spices, and stir well. Press the mixture into the tin, pushing up the sides a little (putting your hand in a food bag makes this easier). Leave the base to set for 30 mins in the fridge.\nFor the cheese layer, whisk all the ingredients together until smooth, then pour over the base. Chill in the fridge overnight.\nThe next day, make the topping. Mix the cinnamon, ginger and mixed spice in a large bowl. Cut each apple into 12 wedges, then toss the wedges in the spice mixture. Heat the sugar and 4 tbsp water in a saucepan and bubble to a caramel. As soon as the sugar becomes a dark caramel, take off the heat and carefully toss through the apples. Pour in the brandy, and the whole lot will bubble and seize. Return the pan to the heat and simmer gently to re-dissolve the caramel and cook the apples in the syrup. Remove from the heat and set the apples aside to cool in the syrup.\nEase the cheesecake out of the tin. Spoon the apples over the top with a slotted spoon. Serve the sticky brandy syrup on the side as a sauce."}
{"text": "Heat oven to 160C/140C fan/ gas 3. Grease and line the base of two 20cm springform cake tins with baking parchment.\nStir together the oil and sugar, add the eggs, flour, baking powder, spices and juices, and mix thoroughly with a wooden spoon until pourable and reasonably runny. Gently fold in the fruit, then divide the batter evenly between the tins. Bake for 20-25 mins or until a skewer inserted in the centre comes out clean, then leave to cool.\nWhen cool, remove from the tins and sandwich the cakes together with jam. Sieve some icing sugar on top to serve."}
{"text": "Unravel the pastry, cut off a 4cm strip along the width and chill this piece until later. Cut the remaining pastry in half lengthways. Place the pastry pieces end to end, so you have one long rectangle, squashing the cut ends together to seal. Scatter over the marzipan and orange zest, leaving a border of about 1cm free along one side. Spoon the mincemeat along the centre, like you’re making sausage rolls, then top with the apple.\nBrush a little beaten egg over the exposed pastry edge. Starting from the other side, roll into a long sausage, sealing with the eggwashed edge. Use a sharp knife or a pair of scissors to snip almost all the way into the pastry at a slight angle at 5cm intervals, keeping all the pieces attached along one edge. Coil into a ring, with the cut pieces on the outside to help it bend, and tuck one end into the other to give a neat finish. Brush the wreath with egg, then use the trimmings from earlier to make decorations, such as stars or holly leaves, and brush these with egg too. Transfer to a baking sheet lined with baking parchment and chill for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Bake the wreath for 20 mins or until golden brown. Dust with icing sugar and serve warm for dessert, or cold as an alternative to mince pies."}
{"text": "Heat oven to 180C/160C fan/gas 4. Pat the turkey dry all over with kitchen paper. Now weigh the bird and calculate the cooking time at 40 mins per kg. \nMix the butter with the zests and herbs, and season well. Gently push your fingers under the turkey’s skin, starting from the neck end of the bird, easing the skin away from the flesh over both the breasts and the tops of the drumsticks. Spread the butter under the skin, pushing it in as far as you can, then smooth the skin back into place. Halve the lemon and orange and put in the turkey cavity along with 2 onion halves and the bay leaves.\nRub turkey all over with oil and sprinkle with salt. Arrange remaining onions in the bottom of a large roasting tin to act as a trivet for the bird. Sit the turkey on top and completely cover both bird and tin with foil to make a tent. Roast according to your calculated cooking times.\nThirty mins before the end of the cooking time, take out the turkey and turn up the oven to 200C/180C fan/gas 6. Remove the foil and return to the oven for a further 30 mins until golden.\nTo test whether your turkey is cooked, pierce the fattest part of the thigh with a skewer – the juices that run out should be clear and not pink. Keep cooking if the juices are pink and re-check at 10-min intervals. If you like your turkey meat almost falling off the bone, then wiggle the leg – it should give slightly if the meat is ready. Keep cooking and basting until it does.\nRest the turkey, covered loosely with foil, for at least 30 mins and up to 1 hr before serving. Strain and reserve the cooking juices and keep the onions in the tin for \n. "}
{"text": "Heat the oil in a saucepan. When hot, add the onions, carrots, celery and bay, and cook gently for 10-15 mins until soft. Remove the bay leaves.\nAdd the flour and cook for 3-4 mins until brown. Add the wine little by little, stirring constantly, then add the stock. Once fully incorporated, simmer for 5-10 mins until the gravy has thickened. Strain through a sieve, stir through the mushroom ketchup and season to taste."}
{"text": "Butter and base-line a deep 18cm round, loose-bottomed cake tin. Heat oven to 170C/fan 150C/gas 3. For the cake, stir together the flours, baking powder and sugar. Slit open the cardamom pods and remove the tiny seeds (discard the pods). Grind the seeds to a powder using a pestle and mortar, then stir into the flour mixture with the orange zest and all the other spices.\nRub the butter into the mix until it looks like coarse crumbs. Coarsely chop half the pecans and stir into the mix with the raisins, sultanas and cranberries. Beat the egg, pour in the milk and stir into the cake mixture. Spoon the mixture into the tin, level the top and scatter over the remaining pecan halves. Bake for 45 mins, then lower the heat to 150C/fan 130C/ gas 2 and bake for another 45 mins.\nWhile the cake bakes, prepare the topping. Pat the cranberries dry on kitchen paper, then toss with the sugar in a small bowl. After the second 45 mins of baking, spoon the sugared cranberries over the top of the cake. Return to the oven for another 15-20 mins, or until the cranberries are sticky and a skewer inserted into the cake comes out clean.\nLeave the cake to cool in the tin, then turn out onto a wire rack. Decorate with ribbon. The cake is best kept overnight for the flavours to mellow before slicing. Will keep in an airtight tin for up to 2 weeks."}
{"text": "Stir together the zest and juice, Cointreau, cranberries and mixed fruit in a small bowl and leave to soak.\nMeanwhile, mix the flour, yeast, caster sugar and nutmeg in a large bowl. Add ½ tsp salt and rub in the butter. Beat the egg with the warm milk, then pour onto the flour mix. Stir with a round-bladed knife, then use your hands to bring the mixture together as a soft dough.\nTip onto a work surface and knead for a couple of mins, adding a little flour only if you need to stop it sticking. Oil the bowl, return the dough and cover with cling film. Leave to rise for 45 mins-1 hr in a warm place until doubled in size.\nLine and butter a large roasting tin with baking parchment. Roll the risen dough out firmly to a long strip about 70 x 18cm. Add the pistachios to the soaked fruit, then scatter the mix along the dough. Roll the marzipan into a sausage the same length as the longest side of the dough, then place it down the centre of the dough and roll up together firmly, a bit like making a sausage roll. Trim the ends, then cut the rest into even lengths and arrange, cut side up, in the tin. Cover with cling film and leave to rise for 45 mins-1 hr until really well risen.\nHeat oven to 190C/170C fan/gas 5. Bake for 15-20 mins until golden. \n. Brush with melted butter and dredge with icing sugar, or mix a little water into the icing sugar, drizzle over the buns and scatter over the nuts. Eat within 2 days."}
{"text": "If you want to make your own stock: put the chicken and pork bones in a pan, add 600ml water (or enough to just cover) and bring to a gentle simmer. Cover with a lid and cook for 30 mins, then strain and continue cooking to reduce the liquid to about 300ml. The bones will add natural gelatine to the stock so it should set without additional gelatine. But if you want to make sure, add 1 leaf following the method in step 10.\nMix together all the filling ingredients in a large bowl and season with 1½ tsp salt. Now make the pastry. Pour 150ml water into a saucepan, add the lard and ½ tsp salt, and bring to the boil. Once the lard has melted, remove from the heat.\nMeanwhile, sift the flour and 1 tsp salt together into a large bowl. Pour over the hot liquid and stir vigorously to form a dough.\nTip onto your work surface and knead for a couple of mins to develop the gluten slightly and create an even-textured pastry. (Once made, keep covered with cling film.)\nRemove roughly one-third of the pastry and set aside to make the lid later. Roll the remaining pastry to the thickness of a £1 coin. You’ll need a 20cm-deep springform cake tin to assemble the pie in.\nLine the cake tin with the pastry, pushing it well into the corners and up the sides of the tin (use a small ball of dough to do this). Leave any excess hanging over the top of the tin.\nAdd the filling to the pie, packing it tightly – this will expel any air pockets and create a nice flat top for the cranberries to sit on later.\nRoll out the reserved pastry to the same thickness and lift it onto the pie to create a lid. Press into the pastry around the edges and trim off any excess. Crimp with 2 fingers if you like. Brush the top of the pie with beaten egg. Cut a hole in the centre to let the steam out as it cooks. You can now chill it for up to 24 hrs or cook straight away. Heat oven to 180C/160C fan/gas 4.\nBake for 30 mins, then reduce heat to 150C/130C fan/gas 2 and bake for another 1 hr 45 mins. If you have a meat thermometer, the internal temperature of the pie should be 75C. If not, insert the end of a spoon into the centre of the pie and hold it there for 10 secs – it should be hot to the touch.\nPlace the tin on a wire rack to cool, then remove the pie. If you have a blowtorch, blast it around the outside of the tin before removing the pie – this melts the fat sticking the pastry to the tin, making it release more easily. Alternatively, leave the pie at room temperature for 20 mins before removing the tin. Warm the stock and put the gelatine in a bowl of cold water to soften for 5 mins. Squeeze out any drops of water, then add the gelatine to the stock, stir in until dissolved, and season well. Transfer to a jug.\nIf there is no gap between the pastry and meat, you'll need to poke a skewer into the hole and wiggle it around to create space for the stock. Pour two-thirds of the stock into the central hole (use a piping nozzle as a funnel, if you have one), or as much as you can, but reserve about 4 tbsp for the topping. Chill for at least 2 hrs.\nDissolve the sugar with the sherry over a low heat. Once dissolved, bring to the boil and add the cranberries. Cook for 1-2 mins, but remove from the heat before the cranberries burst. Leave to cool. Once the stock in the pie has set to a jelly, top with the cranberries. Melt your remaining jellied stock in a saucepan over a low heat, then use it to brush the cranberries generously. Return to the fridge for 1 hr to set the topping. Enjoy within 3 days."}
{"text": "Put all the ingredients except the pear in a non-reactive saucepan with a large pinch of salt. Bring it slowly to a simmer, stirring to make sure all the sugar has dissolved. Add the pear and continue cooking until the mixture has the consistency of thick jam.\nSterilise your jars and lids by washing them in hot soapy water, rinsing well and drying them in a warm oven. Spoon the hot relish into the hot jars and seal. Leave to cool. "}
{"text": "Take one cake pop stick and thread on a marshmallow, narrow end on first. Thread on a second marshmallow, wide end on first so the the two wide ends meet in the middle. Thread a third marshmallow on sideways so the narrow round end makes the snowman's face.\nKnead the white fondant icing and divide into 6. Shape each one into a rough mound and stick the snowmen into these bases.\nTake three strawberry laces and twist together. Tie around a snowman's neck and then trim off the excess with scissors. Repeat for the other snowmen.\nUsing a little royal icing stick a Pontefract cake on each head. Using a little black writing icing, stick a Liquorice Allsort on top of each Pontefract cake.\nPipe on two eyes using black writing icing. Using royal icing, stick a Tic Tac on each face for a carrot nose. Stick mini chocolate beans on the bodies as buttons.\nUsing royal icing, stick four mini marshmallows on each snowman to represent arms. Stick a candy cane or pretzel stick to the end of one of each of the snowmen's arms, attaching the bottom end to the icing mound.\nTake a little royal icing and thin with a few drops of water. Brush or dab on the base and sprinkle over the crushed sugar cubes. Leave to set."}
{"text": "Cut the jumbo chocolate buttons in half and place together in pairs, rounded sides touching, to make feet. Snap the walnut off the top of the walnut whip and discard. Put a little royal icing on each pair of feet and stick a walnut whip on top.\nDivide the fondant icing in three. Take one piece and roll out into a sausage that is fat in the middle and thin at both ends. Flatten the ends to make flippers. Place the sausage on top of the walnut whip and shape the fat middle section into a head. Leave the flippers to hang free at the sides.\nTo decorate, put the remaining royal icing into a piping or plastic bag and snip a tiny bit off the end. Pipe a circle on the front of each penguin. Pipe two dots for eyes. Pipe a circle on top of each head and stick on a fruit pastille. Pipe a blob on top for a bobble.\nCarefully cut three triangular pieces from the orange fruit pastille and stick on the face. Using the black writing icing pipe black dots in the centre of each eye. Leave to set."}
{"text": "Grease 2 deep 20cm loose-bottomed cake tins and line the base and sides with baking parchment. Heat oven to 160C/140C fan/ gas 3. Melt the chocolate and butter in a bowl over a pan of gently simmering water, then set aside to cool a little.\nIn a large bowl, whisk the whole eggs, yolks and sugars with an electric whisk until doubled in size – this will take about 5 mins. Sieve in the flour, cocoa and baking power with a pinch of salt. Fold the chestnut purée into the chocolate butter mixture, then add to the other bowl and gently fold everything together. Divide evenly between the tins.\nWorking quickly, clean the whisks and your large bowl, put the egg whites in the bowl and whisk until stiff. Add the sugar, a spoonful at a time, whisking continuously, until thick and able to hold stiff peaks. Use a spoon to dot the meringue on top of the cake mixture in both tins, then use the back of the spoon to spread the mixture. Fill the gaps to touch the edges of the tins – make nice swirly dips and peaks as you spread. Bake for 1 hr 15 mins until a skewer inserted into the middle of the cake comes out with moist but set crumbs. Cool completely.\nWhen you’re ready to serve, make the filling. Put the cream, chestnut purée and icing sugar in a bowl and whisk until softly whipped. Remove the cakes from their tins and place 1 on a cake stand or plate (save the one with the prettiest top for the final layer). Dollop on the cream and swirl out towards the edges (don’t worry if you crush the meringue a bit). Place the next sponge on top, dust with icing sugar, then top with chocolate shavings, if using. Best served straight away, but will keep in the fridge for 2 days."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put a baking sheet in the oven on the middle shelf.\nCut the butter into small cubes. Sift the flour into a large mixing bowl and add a pinch of salt.\nTip the butter into the flour and use your fingers to rub the two together until it resembles breadcrumbs.\nStir in 2 tbsp of the sugar. Scoop a heaped half cup (85g) of the crumbs into a smaller bowl and set aside.\nHave two small bowls ready. Crack the egg on the side of one bowl, then carefully pull the shell apart in two halves, letting the yolk nestle into one side. Let the white drain away from the yolk into one bowl and put the yolk into the other bowl.\nBeat the egg yolk with a fork, then add it to the bigger bowl of butter and flour mix. Use a cutlery knife to stir the yolk into the crumbs.\nPut your hand in the bowl and squeeze the crumbs together to make a ball. Knead the pastry a few times until smooth.\nSprinkle some flour over your work surface. Sprinkle a little more over the pastry and roll it out to the thickness of two £1 coins.\nStamp the pastry with an 8cm cutter, re-rolling the trimmings to make 12 rounds.\nGently push the rounds of pastry into the bun tin. Spoon 1 heaped tsp of the custard into each pastry case, followed by the mincemeat on top.\nAdd the final 1 tbsp sugar to the smaller bowl of crumb mix. Pinch it together to make bigger clumps and mound it on top of the mincemeat.\nSlide the bun tin on top of the baking sheet and bake for 15 mins until golden brown and the custard and mincemeat are starting to bubble.\nCool in the tin for 15 mins, then carefully lift the pies onto a rack and leave to cool. Will keep for 2 days in an airtight tin."}
{"text": "With the chocolate bar flat-side up, scrape a large kitchen knife over the surface to create chocolate curls (you only need enough to decorate the mousses before serving). Transfer to a plate and chill. Finely chop the remaining chocolate and put in a bowl set over a pan of gently simmering water, stirring every now and then, until melted. Alternatively, melt in the microwave in short bursts, to ensure it doesn’t burn. Set aside to cool for 10 mins.\nPut the cream and peppermint extract in a bowl. Put the egg whites in another bowl with a small pinch of salt. Using very clean beaters, whisk the egg whites until they hold stiff peaks, add the sugar and briefly whisk again. Transfer the beaters to the cream and whisk until just holding its shape, then fold in 200g of the yogurt. Stir the egg yolks into the melted chocolate.\nAdd a large spoonful of egg white to the chocolate mix and stir to loosen the consistency. Add the remaining egg whites and the whipped cream. Gently fold everything together with a large metal spoon, trying to keep as much air in the mixture as possible. When there are no more visible streaks, transfer to eight serving glasses and chill for 2 hrs, or cover with cling film and chill for up to 24 hrs.\nBefore serving, top each mousse with a spoonful of yogurt, pomegranate seeds, chocolate shavings and mint leaves."}
{"text": "Heat 50g butter in a frying pan until sizzling, add the livers and fry for 4 mins until coloured on the outside and slightly pink in the middle. Leave to cool, then tip the contents of the pan into a food processor or a smoothie \n. Season generously with salt and add the remaining butter. Blitz until you have a smooth purée, then scrape into a container, smooth over the top and place in the fridge to chill for at least 2 hrs. \nTo serve, griddle slices of brioche or sourdough, and tip some cornichons and chutney into small pots. Put a large spoon in a cup of hot water. As if serving ice cream, scoop a spoonful of the faux gras onto each plate, dipping the spoon into the water after each scoop. Sprinkle a few salt flakes over each scoop and serve with the toasts, cornichons and chutney."}
{"text": "Sieve the icing sugar into a large bowl. Add a little of the egg white and a few drops of the peppermint essence and mix really well. You want the mixture to come together as a soft dough, so keep adding a little egg white until this starts to happen (you might not need to use all of it). Taste the mixture and add more peppermint essence if desired.\nDivide the mixture into 20 small balls, then flatten them gently with your fingertips into discs.\nPlace baking parchment on a large board or tray and space out the discs. Meanwhile, tip the chocolate into a microwavable bowl and heat in 30 second intervals in the microwave until melted, stirring after each blast. Once melted, leave the chocolate to cool for 5-10 mins then carefully dip the peppermint creams in the melted chocolate until they are half coated. Lay them back on the baking parchment to set for 3-4 hours or overnight."}
{"text": "Make the dressing first. Put the mustard, honey, garlic, vinegar and some seasoning in a cup, and whisk in the oil in a steady stream. Stir in the cream, then check the seasoning – it should be sweet-sour.\nPut some of the lemon juice in a mixing bowl. Peel the celeriac and cut the flesh into matchsticks, tossing these in the lemon juice as you go to stop the flesh discolouring.\nQuarter the fennel and remove any coarse outer leaves. Trim the tips, reserving any tufty fronds. Cut out the core from each piece. Using a very sharp knife or a mandolin, slice the fennel lengthways – the slices should be almost transparent. Toss with the celeriac and add some more lemon juice.\nCut the onion as finely as possible (it’s best to do this on a mandolin too). Halve the apples, core and cut into matchsticks (there’s no need to peel them). Add to the bowl with the onions, and add a little more lemon juice (to keep the apple from turning brown). Chop any fennel fronds and add along with the dill. Toss with the dressing.\nDivide the salad between eight plates with some gravadlax alongside, or serve the gravadlax and offer the salad in a large bowl."}
{"text": "Season the partridges (including the cavity) generously. Put a juniper berry, a thyme sprig, a bay leaf and a garlic clove in each cavity. Chop the bacon into chunky pieces and slice the potato lengthways into six thick slices, discarding the ends.\nHeat oven to 180C/160C fan/gas 4. Heat half the duck fat or butter in a flameproof casserole dish until just sizzling, then brown the birds on all sides for 10 mins. Remove them from the dish and set aside. Add the rest of the fat to the dish and gently fry the potato slices until very brown and crisp on each side. Add the bacon and sizzle with the potatoes until starting to brown. Sit the birds on top of the potatoes and pour over the wine. Put in the oven, uncovered, for 15 mins.\nRemove the birds from the dish and leave somewhere warm to rest for 10 mins. Baste the potatoes, return to the oven until cooked through, then scatter over the parsley.\nTo serve, sit the birds back in the pan and bring to the table or plate up with the potatoes. Serve with cavolo nero or sprout tops."}
{"text": "Divide the gin between 2 Champagne flutes and top up each with 150ml Champagne or Prosecco. For an extra sparkle, add a sprinkle of edible glitter to each flute before filling."}
{"text": "Pour the vodka into the bottom of a coupe glass. Chill for 30 mins, then top with the blackcurrant or raspberry sorbet and pour the Prosecco around it. Serve immediately."}
{"text": "Unravel the pastry and cut out two 15cm diameter circles using a saucer or small plate as a guide. Put them on a tray and prick all over with a fork. Peel, core and halve the pears lengthways. Finely slice each half and arrange in a neat overlapping circle in the middle of the pastry, leaving a 2cm border. Roll up and crimp the edges of the pastry to tuck the pears neatly into the tart.\nTo make the cream, whisk the cream and honey together to form soft peaks, add the cheese and continue to whisk. Scrape into a small container and chill until needed. \nPut a baking tray in the oven and heat to 200C/180C/gas 6. For the glaze, put the sugar in a pan over a medium heat until it melts and caramelises. Pour this over the pears, then put the tarts on the hot baking tray and cook for 15 mins until they’re puffed up and golden. Lift the tarts onto warmed plates and serve with a spoonful of the Roquefort cream so it melts on top."}
{"text": "Put the coconut rum, coconut water and lime juice into a cocktail shaker, add ice and shake until the outside of the shaker is icy-cold to the touch. Strain into a chilled coupe glass, top with the Prosecco and serve."}
{"text": "Take the goose out of the fridge 1 hr before cooking. Heat oven to 160C/140C fan/gas 3. In a frying pan, toast the whole spices over a medium heat until aromatic. Use a pestle and mortar (or spice grinder) to grind to a fine powder. Mix in the crumbled stock cubes, orange zest, 1 tsp salt and cinnamon.\nLay the goose in a high-sided roasting tin, score the skin all over with a sharp knife and rub in the spice mix, making sure you press into all the cut marks. Loosely cover the tin with foil and roast for 2 hrs, then remove the foil and roast for a further 2 hrs. Once cooked, rest for at least 20 mins, loosely covered with foil. Reserving the fat to roast your cabbage (see goes well with).\nWhile the goose cooks, make the salsa. Fry the onions in the oil over a medium heat for 10-15 mins until golden brown. Add the cranberries, cook for a few more mins, then remove from the heat. Mix in the remaining salsa ingredients and keep in a warm place to allow the flavours to infuse. Carve the goose and serve with the salsa."}
{"text": " \nHalve the fruits and squeeze the juices into a large saucepan. Remove all the peel and set aside. Put the flesh in the pan with 1 litre water and boil for 15 mins. Push through a sieve lined with muslin and return the liquid to the pan.\nShred the peel and tip into a heatproof bowl. Add enough water to just cover and microwave for 3-4 mins until soft. Add the peel to the pan, then add the sugar. Boil for 35-45 mins until the marmalade has reached setting point (keep an eye on it so it doesn’t bubble over).\nRemove from the heat and add 1 tsp pink peppercorns. Allow the mixture to cool a little, then stir in 50ml whisky. Ladle into sterilised jars and seal. Will keep for up to one year."}
{"text": "Put the vermouth, onion, lemon juice, parsley stalks and peppercorns in a saucepan with 150ml water and bring to the boil. Simmer for 10 mins. Turn the heat down to a very gentle simmer, add the salmon fillet and poach for 4 mins. Let the salmon sit and cool in the liquid.\nLift the salmon out of its poaching liquid, remove the skin and flake the flesh roughly. Mix the flesh with the smoked salmon, a good squeeze of lemon, the butter, chervil and some pepper. Tip into a bowl, cover and put in the fridge (be sure to bring it back to room temperature to serve).\nMix the crème fraîche with the herbs, capers, shallot, oil and lemon juice to taste. Serve the rillettes with leaves of chicory – its bitterness is very good against the richness of the salmon – the caper crème fraîche and some rye bread, if you like."}
{"text": "Pour the mead (or cider) into a saucepan and add the brandy, apple juice, lemon peel, cloves, cinnamon stick and ginger. Gently warm through until simmering then remove the spices and lemon zest with tongs or strain through a sieve before serving."}
{"text": "Mix the butter and sugar with a wooden spoon. Stir in the spices, lemon zest and flour, then tip in the candied lemon peel and stem ginger – you might need to get your hands in to bring the mix together as a dough. Divide the dough in two and shape each half into a log about 5cm across. Wrap in cling film, then chill for 1 hr. \nHeat oven to 180C/160C fan/gas 4. Slice the logs into 1cm-thick rounds, place on two \n lined with baking parchment and bake for 12-15 mins. Leave to cool completely on the tray.\nMix the lemon juice with the icing sugar to make a thin glaze. Brush over the biscuits and leave to set. "}
{"text": "Melt the butter and chocolate in a medium bowl, either in a \n – cooking for 1 min on High, then stirring and continuing to heat in 20-second blasts – or by setting the bowl over a pan of simmering water and stirring occasionally. Once melted, leave the mixture to cool.\nHeat the oven to 180C/160C fan/gas 4. Line the base of a shallow 20cm square tin with non-stick baking parchment. Sieve the flour and cocoa into a medium bowl. Whisk the eggs and sugar with an electric \n on maximum speed until thick and creamy, about 3-8 mins, or when the mixture runs off the beaters and leaves a trail for a second or two.\nPour in the cooled chocolate mixture, then fold together with a rubber \n in a figure of eight, moving the bowl round until the mixture is a mottled dark brown. Be gentle so you don’t knock out the air.\nSift in the cocoa and flour mixture and continue gently folding. The mixture will look dry and dusty, then fudgy. Stop just before you feel you should, as you don’t want to overmix it.\nSpoon a little mixture into the prepared tin, then add the mince pies, leaving them whole. Scrape over the rest of the mixture, gently easing it between and over the pies. Level the top. Put in the oven for 25 mins. If the brownie mixture is very wobbly in the middle, it’s not quite done, so bake for another 5 mins until the top has a shiny, papery crust and the sides are just beginning to come away from the tin. Take out of the oven and leave to cool in the tin. Dust with icing sugar. Cut into quarters, then cut each quarter into four squares."}
{"text": "Mix the gochujang with the mayonnaise, then season and set aside. Boil the corn cob for 5 mins, then drain, cool and pat dry. Grill on high for 10 mins until starting to blacken, turning frequently. Leave to cool. Cut each of the tortillas into four smaller circles using a 9cm cutter. Shred the off-cuts, then fry in the oil for about 1 min, or until crisp. Drain on kitchen paper.\nWarm the tortilla rounds in the microwave for 1 min, then put on a serving plate. Drain the jackfruit and mix with the gochujang mayo, then divide between the tortillas. Scatter the pineapple, coriander and chilli over the jackfruit, then squeeze over the lime wedges. Cut the kernels off the sweetcorn cob and spoon onto the tacos, then top with the fried tortilla pieces."}
{"text": "To make the sauce, heat the milk in a \n with the onion, cloves and bay leaf. When boiling, turn off the heat and leave to infuse for 30 mins, then strain.\nMelt the butter in another pan and add the flour. Cook for 4-5 mins until sandy. Gradually \n in the milk, then cook over a medium heat, stirring, until you have a thick sauce. Stir in the mustard and season. Set aside to cool. \nHeat oven to 180C/160C fan/gas 4. Butter a \n large enough to fit 3 slices of bread, then butter and toast the bread, and make 3 sandwiches with 2 slices of ham and cheese in each. Spread the white sauce on top, and make a small well in the sauce on each sandwich. Crack the eggs into the wells, then scatter over the parmesan. Bake for 20 mins or until the whites are just set."}
{"text": "Roll out the pastry on a floured surface so that it’s just thinner than a £1 coin. Cut out 8 x 10cm circles using a pastry cutter or small saucer, then cut 8 x 9cm circles for the lids – you may need to re-roll the trimmings. Push the larger circles into 8 holes of a muffin tin, then divide the turkey, cream and cranberry sauce between them. Season well and brush the edges with a little egg. Place a lid on top of each and pinch the sides together to seal. Chill for 15-20 mins.\nHeat oven to 200C/180C fan/gas 6. Brush the tops with more egg, then bake for 25 mins until the pastry is crisp and golden. Serve warm, or leave to cool and enjoy cold."}
{"text": "Heat oven to 180C/160C fan/gas 4. Grease and line a 30 x 20cm baking or roasting tin with baking parchment. Mix the sultanas and zest and juice from 1 orange (or 2 clementines), and microwave on High for 2 mins.\nMix the flour, caster sugar, spices, bicarb and pinch of salt into a large bowl. Mix the eggs with the melted butter and sultana mixture, then tip into the dry ingredients and stir in with a wooden spoon. Stir in the grated veg, and scrape into the tin. Bake for 35 - 40 mins, or until a skewer poked in the centre comes out clean. Cool in the tin.\nOnce cool sift the icing sugar into a bowl and stir in remaining orange zest plus enough juice to make a runny icing. Drizzle all over the cake and scatter with the crushed sugar cubes. Leave to set, then slice into 15 squares to serve."}
{"text": "If you need to soak the ham, do so the night before. Heat oven to 180C/fan 160C/gas 4. Place the ham, skin-side up, in a deep roasting tin, then add enough water to cover the base of the tin. Scatter the orange wedges and cinnamon stick around. Cover the pan with a tight tent of foil, then cook the ham for about 2½ hrs. (If using a different weight of ham, you want 20 mins per 450g.)\nWhile the ham is cooking, mix the mustard, treacle and orange zest together with enough orange juice to make a mixture loose enough to paint over the ham.\nWhen the ham has had its time, remove the roasting tin from the oven and turn up the heat to 220C/ fan 200C/gas 7. Remove the foil, leave the ham until cool enough to handle, then pour away any liquid in the tin. Using a sharp knife, carefully cut away the skin to leave an even layer of fat. Use the tip of the knife to score the ham fat diagonally at 3cm intervals – first in one direction, then the other, to produce a diamond pattern. Liberally paint the glaze over the fat, then stud with the cloves at the points of the diamond shapes.\nRoast the ham for 30 mins until glazed and just beginning to char around the edges. Leave to cool and serve warm or cold, decorated with the bay and orange wedges, if you like, along with my delicious green bean salad and your favourite chutney."}
