{"text": "Put the flour in a large bowl with 1/4 tsp salt. Add the butter and rub it in with your fingertips until the mix looks like fine crumbs.\nStir in the sugar, then slowly pour in the egg, stirring with a cutlery knife as you go to avoid any overly wet or dry patches. Scrunch to a dough with your hands, then knead briefly until smooth. Alternatively, pulse together the butter, flour and salt in a processor, then add the sugar and egg. Shape into 2 discs, wrap in cling film and chill for 30 mins (if you have time).\nHeat oven to 190C/170C fan/gas 5. Mix the prunes and Armagnac into the mincemeat and set aside. Roll out the pastry on a lightly floured work surface until 3mm thick, cut into circles with a 7.5cm or 8cm round plain cutter and gently press into 2 x 12-hole shallow, non-stick bun tins.\nFor the topping, beat together the butter and sugar with a wooden spoon, then add the flour, ground almonds, eggs, almond extract and a pinch of salt, and beat until smooth.\nSpoon the mincemeat into the tin (about 1 dessertspoon into each). Spoon over the topping, then smooth it to the edges of the pastry with a palette knife. Scatter over the flaked almonds. Can now be frozen for up to 1 month.\nBake for 25 mins from room temperature (or 30 mins from frozen) until the pies are golden, risen and the pastry feels firm at the sides. Leave to cool in the tin for 10 mins before transferring to a cooling rack. Dust with icing sugar to serve. Can be stored in an airtight tin for up to 3 days once cold."}
{"text": "Put the peeled and grated Bramley apples, light muscovado sugar and the zest and juice of the orange and lemon into a large bowl with the ground cinnamon, ground nutmeg, allspice, mixed dried fruit and brandy. Stir in the grated unsalted butter or shredded suet and ground almonds. Transfer to jars or containers."}
{"text": "Preheat the oven to 200C/gas 6/ fan 180C. Scatter the sugar over the worktop, unravel the pastry, then roll it out so it’s a quarter bigger, but keeps its rectangular shape.\nSpoon and spread the mincemeat evenly over the pastry leaving a 2cm border along the longest edges. Fold one of the longest edges over the mincemeat then roll the pastry tightly into a sausage shape while gently pressing the pastry into the mincemeat. When you get to the other edge, brush it with milk and press down to seal in the mincemeat. Press both ends in gently to plump up the roll and chill for at least 30 minutes to firm it. (The mince pie roll may now be frozen whole or as portioned slices, see below, for up to 1 month.)\nCut the roll into 12 rounds, about 3cm thick. Lay them evenly spaced on a large baking sheet and flatten them with your hand so they look like squashed Chelsea buns. Scatter the almonds on top and bake for 20-30 minutes until golden brown and the mincemeat sizzles. Leave to cool for 5 minutes – keep them separate so they don’t stick together. Eat hot with vanilla ice cream, or just as they are."}
{"text": "Heat oven to 160C/fan 180C/gas 4. Boil the kettle and thinly slice 5 of the clementines horizontally, discarding the ends. In a small pan, melt 250g of the sugar with 300ml boiling water, then increase the heat until the syrup is simmering. Add the clementine slices, then cover and cook for 20 mins until the slices are tender. Meanwhile, grease and line the base of a 25cm springform tin.\nUse a slotted spoon to lift out the clementine slices, then arrange over the bottom of the tin. Grate the zest from the remaining 7 clementines and set aside. Squeeze the juice from 4, then stir this into the syrup. Boil for 10 mins until thick. Cool and set aside.\nFor the cake, beat 200g of the remaining sugar with the butter, lemon zest and half of the clementine zest until pale. Beat in the egg yolks one by one. Peel the three remaining zested clementines, then break the segments into a food processor and whizz until pulpy. Stir this into the butter mixture along with the almonds, polenta and one pot of yogurt. Whisk the egg whites to stiff peaks, then gently fold into the cake mix. Carefully spoon the mixture into the prepared tin, then bake for 1 hr until a skewer inserted comes out clean. Cool the cake in the tin.\nFor the cheesecake cream, mix the remaining clementine zest with the mascarpone, the remaining pot of yogurt, 50g sugar and a good squeeze of lemon juice. Turn the cake out upside down onto a serving plate , then pour over some of the sticky syrup. Serve in wedges topped with a spoonful of the cheesecake cream, and a little more syrup on the side."}
{"text": "Beat the butter, sugar and vanilla together until pale, then whisk in the brandy, one tbsp at a time, until you are pleased with the taste. "}
{"text": "Lightly grease 8 mini metal pudding basins that each hold around 200ml. Place a small disc of baking parchment in the base of each one.\nTo make the sauce, put the sugars and butter in a small saucepan and cook over a low heat until the butter melts and the sauce is glossy, stirring regularly. Add the cream and bring to a simmer. Cook for 1 min, stirring constantly. Remove from the heat and divide between the pudding basins. Leave to cool for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Beat the butter, sugar, eggs and flour together in a large bowl with a wooden spoon or electric whisk until pale and thick. Spoon the mixture into the pudding basins and place them in a small roasting tin.\nAdd cold water to the roasting tin until it rises just 1cm up the sides of the basins. Place the tin in the oven and bake for about 25 mins or until well risen and a skewer inserted comes out clean.\nTake the tin out of the oven and, one at a time and holding firmly with a dry tea towel, loosen the sides of each pudding with a round-bladed knife. Turn out onto 8 warmed dessert plates, or arrange on a platter. Serve hot with cream or ice cream, if you like."}
{"text": " 3 limes, 1 tbsp grated ginger, 1 crushed garlic clove, 1 chopped and deseeded red chilli and 1 tbsp chopped coriander. Cut a large mango into 20 chunks. Thread each onto a small skewer with a large cooked prawn (20 prawns will be about 250g/9oz). Marinate the skewers in the lime dressing for 1 hr (makes 20).\n Put 20 small new potatoes on a baking tray. Drizzle with olive oil and season. Roast for 25 mins at 200C/180C fan/gas 6, then cool to room temp. Cut a small cross in the top of each one, push open a little and top with 1 tsp crème fraîche and some caviar (makes 20).\n Peel a large butternut squash. Cut into 20 x 3cm squares, then mix with 1 tbsp each of soy sauce, sesame oil and honey. Arrange the chunks on a large baking tray lined with baking parchment. Sprinkle with 2 tbsp sesame seeds, season and bake for 20-25 mins at 200C/180C fan/ gas 6 until crisp. Put a cocktail stick in each chunk to serve (makes 20).\n Use a pastry cutter to cut out 20 x 6cm circles from a pack of soft Middle Eastern flatbread or wraps. Grate 75g/2.5oz Manchego and chop 75g/2.5oz chorizo and ½ a red chilli. Scatter over the bread bases, then bake at 200C/180C fan/gas 6 for 10 mins (makes 20).\n Roughly mash 250g/9oz goat’s cheese with 2 finely chopped shallots. Toast 5-6 slices of sourdough and stamp out 20 small circles. Spread each circle with some cheese, top with a small blob of chilli jam (you’ll need about 3 tbsp) and scatter with chives, snipped from a small packet (makes 20)."}
{"text": "Heat oven to 220C/200C fan/gas 7. Put the flour and baking powder in a large bowl and rub in the butter using your fingertips until the mixture looks like fresh breadcrumbs. Mix the mustard, egg and milk together in a jug then pour into the flour mixture along with the Stilton and ham. Knead the dough briefly, you want to make sure all the ingredients are evenly dispersed through the mix but try not to overwork the dough.\nDust your work surface with flour then shape the dough into a flat disc around 4-5cm thick. Cut out 9 or 10 scones using a 7.5cm fluted cutter then transfer to a baking sheet lined with baking parchment. Brush the tops with milk then bake for 12-15 mins or until risen and golden. Serve warm with butter, cheese and pickles."}
{"text": "Bring the stock to the boil and throw in the carrots. Boil for 4 mins, then add the noodles and simmer for 3 mins. Stir in the turkey, peas and the white part of the spring onions, heat for 1 min or until everything is hot through. Ladle into bowls, scatter with the green part of the onions to serve."}
{"text": "Soak the dried mushrooms in 250ml boiling water. Meanwhile, soften the shallots in the olive oil and a third of the butter for 10 mins. Add the squash and cook for a further 10 mins until softening, then add the garlic and herbs and cook for 2 mins more. Set aside.\nIn another pan, fry the fresh mushrooms in another third of butter until softened. Strain the porcini, reserving the soaking liquid, then roughly chop and add to the cooked mushrooms. Fry for 2 mins, then remove from the pan and set aside.\nMelt the remaining butter in the same pan, stir in the flour for 2 mins, then gradually stir in the stock and mushroom soaking liquid. Bring to the boil, stirring, and cook for 2-3 mins until thickened. Combine the sauce with all the veg, then transfer the mixture to a 2-litre rectangular pie dish and cool.\nRoll out the pastry on a floured surface until big enough to cover the pie dish. Cover the pie, trimming the excess pastry, then wrap well in cling film. \nTo cook, defrost the pie thoroughly in the fridge overnight if frozen. Heat oven to 200C/180C fan/gas 6, glaze the pastry with a little egg and bake for 30-40 mins or until golden and hot through."}
{"text": "Heat the oil in a frying pan. Add the shallot and a generous pinch of salt and cook for 2-3 mins until softened, then add the garlic, breadcrumbs, pecans and thyme and cook for 1 min more. Add a splash of vegetable stock to bring the mixture together, then set aside.\nHeat oven to 180C/160C fan/gas 4. Cut the dates in half lengthways (but don’t cut all the way through). Take small balls of the stuffing and push inside the dates, then push the sides of the dates back together. Put a sage leaf on top of each date, then put the dates on a baking tray lined with baking parchment. Get ahead by prepping your dates up to this point – they will keep in the fridge overnight ready to be baked.\nBrush the outside of the dates liberally with olive oil, then bake for 15-20 mins until the sage leaf is crisp. Serve immediately."}
{"text": "Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.\nWrap the brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm."}
{"text": "Make the pastry by rubbing the butter and flour together with your fingertips until the mix resembles fine crumbs or whizz in a food processor. Stir in the sugar and a good pinch of salt, then add the egg yolks and water or milk and work into the mix with a knife until the dough starts to clump together. Press the dough together with your hands to form a ball, split in two and knead each half briefly until smooth. Shape into a flat disc. Wrap in cling film then chill while you make the topping.\nHeat oven to 200C/fan 180C/gas 6. Beat the almonds, sugar, egg whites and almond extract together to a rough paste.\nRoll out one of the discs of pastry on a lightly floured surface and cut 12 x 9cm circles (or 10 x 10cm circles, depending on the depth of your muffin tin) with a round cutter. Push into the wells of a 12-hole muffin tin. Re-roll the leftover pastry and cut out enough 7cm circles to cover the tops.\nSpoon a heaped tbsp mincemeat into each case, followed by 1 tbsp almond mix. Brush the edges of the cases with egg and press the tops on, then brush with egg. If you’re making ahead, ‘open’ freeze at this point, in the tin, uncovered. Once frozen, cover with cling film and use within a month. Bake for 20-25 mins until golden from fresh or for 25-30 mins from frozen. Leave to cool almost completely in the tin before lifting out. Serve dusted with a little icing sugar if you like. Repeat with remaining mix to make a second batch."}
{"text": "Place the flour, ginger, cinnamon and butter in a food processor and pulse until they resemble breadcrumbs (do this in two batches if the bowl is small). Combine the sugar, treacle and egg in a large mixing bowl. Tip in the flour mix and stir, then bring the dough together with your hands. Turn onto a lightly floured surface and knead until smooth. Cover and chill for at least 1 hr.\nHeat oven to 180C/fan 160C/gas 4. Line three baking sheets with non-stick paper. Divide the dough into three and roll out on a floured surface to the thickness of two £1 coins. Using the templates, cut out two each for the roof, sides and two pointed end walls. Lift them onto the baking sheets. Re-roll scraps of dough, then cut out the small trees. Bake for 12 mins or until just firm. Leave to firm up for 5 mins, then transfer to a wire rack to cool.\nTo assemble the house, pipe a door on an end wall and a window on a side wall, using the squeezy icing. Pipe icing generously along one long edge of one side wall and stick it to the board. Repeat with an end wall, join the corners with a line of icing, then fix a flake bar to the base as a 'foundation'. Stick the remaining walls together. Use another flake bar to support the other end wall. Fix on the roof pieces, then leave overnight to set.\nStick the marshmallows all over the roof, using the decorating icing as glue. Fix chocolate buttons around the door and to cover the corner joins. Pipe icicles along the front edge of the roof using the squeezy icing – start each one with a small pea-sized blob of icing. Pull the icing nozzle downwards and away from the blob – the icing will break off in a jagged 'icicle'. Alternatively, decorate with a line of white chocolate buttons.\nMix the icing sugar with drops of water until you have a thick but spreadable icing. Spread this over the board and decorate with the lollipops (fastened to soft sweets), sweets, chocolate buttons and gingerbread trees. Dust lightly with icing sugar for a snowy effect.\nNOTE: To make the templates draw each shape on card or paper, using the following measurements. Side walls: 16cm x 10cm. Roof walls: 19cm x 12cm. End walls: Total height 18cm to the apex. 10cm tall to the top of the box. Angled line 11cm long."}
{"text": "Heat the oil in a large heavy-based pan. Tip in the onions and spices and cook for 5 mins until fragrant. add the rest of the ingredients plus 1 tsp salt and simmer for 1 hr until dark golden and thick. Pour into sterilised jars and allow to cool before covering."}
{"text": "Whip the double cream until it holds its shape then set aside until needed.\nPut the milk in a small saucepan and heat gently until simmering. Add the milk chocolate and dark chocolate, then stir until melted. Pour into a mug and top with a dollop of the double cream and scatter over a few mini white chocolate buttons to decorate."}
{"text": "Heat oven to 180C/160C fan/gas 4. Gently melt the butter. Combine the oats, spelt flour, salt, baking powder, sugar and seeds in a bowl. Pour in the melted butter and stir to combine, coating all of the oats. Add up to 80ml boiling water, a little at a time, until you have a dough that holds together.\nLightly dust a work surface with flour and turn out the dough, rolling out to 0.5cm thickness. Using a 5cm round cutter, cut out your biscuits and place on a lined baking tray. Bake for 20-25 mins until crisp and golden, then remove from the oven and cool on a wire rack. Can be made one day ahead and kept in an airtight container. To serve, spread with butter and top with stilton and a dollop of damson jam."}
{"text": "Slice enough parsnips thinly lengthways to cover the surface of a small ovenproof dish, then slice the rest thinly into rounds. Combine the milk, cream, stock, mustard and half the cheese in a large, lidded saucepan and bring to the boil. Add a good grating of nutmeg and some seasoning – the sweet parsnips can take a bit of salt – then tip in the parsnips. When the cream is simmering again, cover and cook for 6 mins.\nUsing tongs, fish out the long slices of parsnip and set aside. Tip the rest into your dish, then arrange the long slices over the top. Scatter with the rest of the cheese and another grating of nutmeg. Can be chilled for up to 24 hrs.\nTo serve, heat oven to 180C/fan 160C/gas 4 and bake for 1 hr, then turn up to 200C/fan 180C/gas 6 and brown for 15 mins more – you can do this while the pie is resting."}
{"text": "Halve the dough and press one half evenly into the base of the tin. Spread the mincemeat over the top, leaving a 1cm border around the edge. Roll out the remaining dough between 2 sheets of baking parchment to a 20cm square, then slide onto the mincemeat. Seal around the edge with your fingers gently press all over until dimpled, then prick all over the top with a fork.\nBake for 25-30 mins until lightly golden. Mix the granulated sugar with the remaining 1/4 tsp cinnamon and sprinkle over the top. Cool in the tin before cutting into squares. "}
{"text": "First make the ripple by putting the cranberries and icing sugar into a shallow pan and cooking down over a mediumhigh heat for 10 mins until the berries collapse into a thick and sticky sauce. Turn off the heat and leave to cool.\nHeat oven to 180C/160C fan/gas 4. Line a 12-hole muffin tin with 12 muffin cases. Crush the biscuits in a plastic bag or whizz in a food processor, then mix with the melted butter. Divide between the muffin cases and press down with your fingers. In a separate bowl, mix the soft cheese with the flour, sugar and vanilla extract, then gradually beat in the eggs and yolk until smooth. Ripple the berry mix through the cheese, being careful not to over-mix. Spoon the mix into the cases and smooth the tops with the back of the spoon. Bake for 30 mins, leave to cool, then chill in the fridge until completely cold.\nTo serve, peel the cases off the cakes, if you like, then dust with icing sugar. Serve piled up on a nice dish for everyone to help themselves."}
{"text": "Mix the sugars and almonds in a large bowl, then rub in the vanilla seeds until even. Make a well in the middle, then tip in the eggs and citrus juice. Cut the wet ingredients into the dry with a cutlery knife. Dust the surface with icing sugar, then knead the marzipan briefly with your hands to a smooth dough. Don’t overdo it as the paste can get greasy. Add a bit more icing sugar if it seems too wet. Shape into a ball, then wrap and keep in a cool place until ready to cover the cake. Can be made up to 2 days in advance.\nLift the cake onto a cake board or plate, then use a pastry brush to cover evenly with a thin layer of jam. Dust the work surface with more icing sugar, then roll the marzipan into a circle about 40cm across, dusting underneath the marzipan with more icing sugar and turning it a quarter turn after every few pushes of the rolling pin.\nFlip the top of the circle back over your rolling pin so you can see the underside of the marzipan, then lift the pin up and lift the marzipan over the cake. Stop once you can see that the edge of the marzipan nearest you is about level with the bottom of the cake. Flop the front of the marzipan down. Smooth the paste over the cake using the palms of your hands, then trim with a sharp knife. If any cracks appear, simply pinch the paste back together and smooth. Leave to dry for at least 24 hrs, or up to 3 days, before covering with icing.\n Although homemade marzipan contains raw eggs, the amount of sugar, and lack of moisture, prevents bacteria growing when left at room temperature, so your cake should last for 1-2 months iced. The most important thing is that you don't scrimp on drying time – once you’ve covered your cake in marzipan it should be left to completely dry out, before you then cover it with icing. If you want to make marzipan before you are ready to cover your cake, then wrap it well in cling film and keep in a fridge for up to a week – as wrapped in a ball it will still contain a little moisture. As it contains raw eggs it shouldn’t be given to anyone in an at-risk group, including pregnant women, the elderly, the unwell and the very young. You can make a cooked marzipan, which carries no risks. It is a little softer, and harder to work with, but a good substitute if you are at all worried."}
{"text": "Whizz the butter, flour and ground almonds in a food processor until the butter has disappeared. Pulse in the sugar and half the orange zest. Add the milk and keep whizzing until a rough dough comes together. Tip onto the work surface, press together and shape into a smooth disc, kneading once or twice if you need to. Chill for 15 mins. Can be made up to 3 days ahead and chilled, or frozen for up to 1 month.\nScatter a little flour onto the work surface. Roll out the dough to about the thickness of a £1 coin. Using an 8cm cutter, stamp out 24 circles and use to line the holes of 2 x 12-hole bun tins.\nHeat oven to 200C/180C fan/gas 6. Mix cranberries and mincemeat, then spoon into cases. Scatter each pie with flaked almonds. Can be frozen for up to 1 month. Bake the pies for 18-20 mins until the pastry and almonds are golden. When ready to serve, dust with the tiniest bit of icing sugar. Stir 2 tsp icing sugar and remaining zest into the crème fraîche, then dollop onto each pie to serve."}
{"text": "Heat 1 tbsp butter in a wide saucepan, then add the onion, carrots and celery. Cover, then gently cook for 10 mins until soft. Tip in two-thirds of the garlic, fry for 1 min, turn up the heat, then add the thyme and rice. Stir for a few mins, then add the wine and let it reduce to almost nothing.\nStir in the stock over a medium heat, ladle by ladle, waiting for each addition to absorb before adding the next. Keep the heat on medium – too hot and the stock will evaporate rather than be absorbed by the rice. When the rice is creamy and justcooked, take off the heat, add the duck, then cover for 5 mins to heat through.\nMelt the remaining butter in another wide pan, add the mushrooms, then fry them on a high heat for about 3 mins until golden. Add the remaining garlic, fry for 1 min more, then season. Stir the mushrooms into the risotto, then scatter with parsley and serve."}
{"text": "Heat oven to 160C/140C fan/gas 3. Pour 100ml of the bourbon into a small, shallow roasting tin and add the star anise. Season the pork belly, put in the tin and cover tightly with foil. Bake for 3 hrs. Remove from the oven and leave to cool for at least 1 hr. You can chill the pork for up to 2 days at this stage.\nHeat oven to 200C/180C fan/gas 6. Remove the pork from the tin. Using a small, sharp knife, pare away the rind from the meat, leaving a small layer of fat. Cut the meat into 2cm chunks and return to the tin. Roast for 20 mins until crisp and sizzling, turning regularly.\nMeanwhile, tip the ketchup, soy sauce, honey and remaining bourbon into a small pan. Set over a high heat and bubble for 5 mins until thick and syrupy. Pour over the chunks of pork and toss to coat. Roast for 10 mins more until sticky.\nSnip the chives into the sour cream, if you like, and serve alongside the pork chunks with cocktail sticks."}
{"text": "Combine all the ingredients in a saucepan set over a low heat, and stir until the sugar has dissolved. Turn the heat up and bubble the sauce for 2-3 mins until golden and syrupy. Leave to cool for 10 mins before serving. "}
{"text": "Heat oven to 190C/fan 170C/gas 5. Put the onion and a large sprig of bay in the cavity between the legs. Now pack half the stuffing into the neck end, pushing it towards the breast. Secure the neck skin in position with skewers and tie the turkey legs together at the top of the drumsticks to give a neat shape.\nWeigh the turkey and calculate cooking time at 20 mins per kilo, plus 90 mins. (You may need to use your bathroom scales.)\nPut a large sheet of extra-wide foil in a large roasting tin, then put the turkey on top. Smear the breast with the butter, grate over half the nutmeg and season well. Cover the breast with bacon, pour over the wine, then loosely bring up the foil and seal well to make a parcel.\nRoast in the oven, then 90 mins before the end of cooking, open the foil, discard the bacon, and drain off excess fat from the tin. Leaving the foil open, return the turkey to the oven to brown, basting with the juices several times. Then 30 mins before the end of cooking, place pigs-in-blankets and stuffing of your choice around the turkey, or cook in a separate lightly oiled tin.\nTo test whether the turkey is cooked, push a skewer into the thickest part of the thigh – the juices should run clear. If they are pinkish, cook for 15 mins more, then test again.\nTransfer the turkey, stuffings and pigs-in-blankets to a platter, cover with foil, then a couple of tea towels and allow to rest for up to 30 mins before carving. This gives the juices time to settle back into the meat, ensuring that the turkey will be juicy. Garnish with sprigs of bay."}
{"text": "To make the caramel, put the sugar and hot water into a small, heavy pan over a low-medium heat. Stir occasionally until the sugar has dissolved then raise the heat and boil, without stirring, until the caramel is golden brown.\nImmediately remove the pan from the heat and quickly pour the caramel into a wide, fairly deep, 1.5 litre/2¾ pint ovenproof dish, swirling it around to cover the base. Set aside.\nPreheat the oven to 160C/Gas 3/fan oven 140C. Cut the panettone into 1cm/½in thick slices then remove the dark brown, bottom crust. Butter one side of the slices generously. Put in a single layer, butter-side-up, in the dish.\nUsing an electric whisk or food mixer, beat the sugar and eggs in a large bowl for 2 minutes, or until thickened. Heat the milk and cream in a saucepan to just below simmering point, then pour on to the egg mixture and stir to combine.\nPour this custard over the panettone, pressing the slices into the liquid. Soak for 10 minutes.\nPut the dish on to the middle shelf of the preheated oven, and bake for 55-60 minutes. The pudding is ready when the top is pale gold and dry-looking and the custard set to a just-firm shiver – it should not be completely solid as the custard continues to set as it cools. Leave it to rest for 30 minutes before serving with cream."}
{"text": "Muddle the lime juice, sugar and mint leaves in a small jug, crushing the mint as you go – you can use the end of a rolling pin for this. Pour into a tall glass and add a handful of ice.\nPour over the rum, stirring with a long-handled spoon. Top up with soda water, garnish with mint and serve."}
{"text": "Rinse and pick over the damsons to remove any leaves and stalks, then pat dry, tip into a freezer bag and freeze overnight. The next day, bash the bag of damsons a couple of times with a rolling pin and then tip the lot into a 2-litre Kilner jar, or divide between 2 smaller jars.\nPour in the sugar and gin, and put the lid on. Shake well. Each day for a week, give the jar a good shake until all the sugar has dissolved, then put it in a cool, dark place and leave for 2-3 months.\nLine a plastic sieve with a square of muslin (or use a coffee filter in a cone for a really refined gin) and strain the damson gin through it. Decant into clean, dry bottles, seal and label. The gin is now ready to drink, but will improve and mature over time – it will keep for over a year, if you can wait that long."}
{"text": "Heat oven to 150C/130C fan/gas 2 and line a large baking tray (or 2 smaller) with baking parchment. Place the egg whites in a large bowl and use an electric mixer to whisk until foamy. Add the lemon juice and whisk again until they hold soft peaks.\nSlowly mix in the icing sugar and continue whisking until the mixture is stiff. Remove about a quarter of the meringue mixture and set aside to use for the topping. Put the almonds, cinnamon, ginger and lemon zest in the bowl with the meringue and mix to form a stiff, slightly sticky dough.\nTo form the stars, put the dough on a piece of baking parchment lightly dusted with icing sugar and dust the top of the dough with sugar, too. Place a second sheet of parchment on top of the dough and roll out to about 0.5cm thick (the dough is a little sticky, so the parchment makes it easier to roll). Peel off the top sheet of parchment and use a 5cm star-shaped cutter to cut out as many cookies as possible. Place them on your prepared baking tray.\nUsing the reserved meringue mixture, spread a small amount onto the top of each cookie, covering the entire top – you may need to add a few drops of water to make the meringue a little easier to spread. Put the tray in the oven and bake for 12-15 mins until meringue is set but not browned. "}
{"text": "Heat oven to 200C/fan 180C/gas 6 and bring a large pan of water to the boil. Cut the carrots lengthways into halves or quarters, depending on their size. Tip the carrots into the pan, wait for the water to simmer again, then cook for 4 mins. Drain well, then tip into a large roasting tin.\nWhile the carrots are still hot, gently toss them with all the zest, oil, butter, seasoning and the lemon and clementine slices. Poke the slices in among the carrots, so they’re not left on the edges of the tray. Roast for 40 mins until the carrots are golden and tender."}
{"text": "Melt the butter in a large, shallow pan. Add the carrots, tarragon and star anise. Slowly cook for 10 mins until the carrots are glazed and starting to soften. Pour in the stock and bring to the boil, then simmer everything for 20 mins until cooked and the stock has reduced.\nPour in the cream, bring back to the boil and simmer for 1 min more. Remove from the heat, take out the star anise and stir through the lemon juice. Season to taste, then blitz with a hand blender until as smooth as possible. \n."}
{"text": "Put the sugar, bitters and water in a small tumbler. Mix until the sugar dissolves if using granulated. Fill your glass with ice and stir in the whisky. Add a splash of soda water if you like and mix. Garnish with the orange and cherry."}
{"text": "Place the flour, salt, baking powder, bicarbonate of soda, sugar and vanilla seeds in a food processor and pulse briefly to blend. Add the egg yolks, butter, buttermilk and milk, then whizz to a smooth batter, scraping down the sides of the bowl once or twice. Whisk the egg whites in another bowl to soft, floppy peaks, then fold into the batter.\nHeat a heavy-bottomed frying pan until you can feel a good heat rising, then lightly oil the pan. Using a small ladle, pour in the batter to make pancakes about 10cm in diameter. Cook for about 1 min until the tops are set and little holes appear in the surface. Flip the pancakes over, brown lightly on the other side, then transfer to a tea towel placed on a wire rack and keep warm in a low oven. Repeat with the remaining batter, stacking the pancakes as they are cooked.\nTo serve, pour the sugar into a mixing bowl and toss the Brazil nuts and bananas through it. Tip into a pan, heat through to melt the sugar, then toss together as everything begins to caramelise. When the nuts and bananas are golden brown, remove from the heat and stir in the maple syrup. Arrange the pancakes on a serving dish and spoon over the nut and banana mix, then serve with extra syrup and a dollop of yogurt or crème fraîche."}
{"text": "Heat oven to 220C/200C fan/gas 7. Boil the cauliflower in salted water for 5 mins until soft. Drain, put back in the pan to steam off the excess water, then tip into a bowl to cool. Add the garlic, spring onions, chilli, parmesan, lemon zest, 50g of the toasted breadcrumbs, the flour, egg, and some seasoning. Shape into 16 cakes, then roll in the remaining breadcrumbs. Put on a plate and chill for at least 1 hr, or overnight, before cooking.\nTo make the sauce, put all the ingredients in a food processor or blender. Add some seasoning and blend until smooth. Pour into a serving bowl and set aside. Can be made a day ahead.\nLiberally spray a large baking sheet with the oil. Put the cauliflower cakes on top and spray well again. Bake for 25 mins until golden and crisp. Serve with the sauce and some rocket salad."}
{"text": "Chop or \n the cauliflower into rice-sized pieces. Cover loosely and \n for 5 mins, or until tender, stirring halfway. Pour the milk into a saucepan with the plain flour and 1tbsp butter. \n together and slowly bring to the boil, mixing all the time, until smooth and thick. Mix in the cooked cauliflower, cheddar and parmesan, then season. Leave to cool in the pan. Once cold, transfer to a piping bag or food bag and chill. \nHeat oven to 200C/180C fan/gas 6. Line a baking sheet with baking parchment. Unfold the pastry sheets and slice into three pieces widthways, cutting through all the sheets at once. Take out three strips and keep the rest covered.\nMelt the remaining butter, then use to lightly brush the pastry strips. Fold the strips in half lengthways, then brush again with the melted butter. Pipe or spread 1 tbsp of the cauliflower mixture onto the buttered pastry strips. Fold the short ends in, then loosely roll to form a cigar. Brush the end with a little butter to help seal in place. Place on the baking sheet, spacing them a little apart, then repeat with the remaining pastry strips. Brush the tops with butter, then sprinkle with the za’atar and sesame seeds. Bake for 15-18 mins until golden and crisp. Serve warm."}
{"text": "Tip the caster sugar into the jar, followed by the flour, then finally the cocoa, so the ingredients sit in layers. Seal the jar.\nWrap the chocolate drops and bar up in cellophane. Tie the spatula or spoon onto the jar with ribbon and pack in a gift bag or box with the chocolates, sprinkles and cupcake cases.\nHand-write a label with the following instructions and attach it to the gift: ‘Heat oven to 180C/160C fan/gas 4. Put 100g very soft butter in a bowl with 2 eggs, add the contents of the jar and beat well. Add a drop of milk to the mix if it is too stiff. Stir in the white chocolate drops. Divide between the cake cases. Bake for 15 mins. Cool. Melt the milk chocolate, spoon a little over each cake and then decorate with sprinkles.’"}
{"text": "Tip the cranberries into a saucepan, grate in the orange zest then squeeze in the juice. Add the redcurrant jelly, port and star anise and slowly bring to the simmer.\nCook gently over a low heat for about 15 minutes, stirring occasionally, until all the cranberries have burst and the sauce thickens and looks glossy. You want to end up with a saucy texture rather than a jammy one – you will find fresh cranberries thicken the sauce more readily whereas the frozen cranberries will take a little longer.\nStir in the sugar and taste. Chef Tony Tobin likes the sauce to have enough tartness to make you suck in your cheeks, but add more sugar if you prefer. Cool and then fish out the star anise. The sauce will keep in the fridge in a covered container for 1 week or for 2 months in the freezer.\nTo serve, take out of the fridge an hour or so before the meal so that it returns to room temperature, then spoon into a serving dish."}
{"text": "Leave small and medium potatoes whole, but halve large potatoes. Tip the potatoes into a large pan of cold salted water and bring to the boil. Boil for 6 mins exactly, then drain in a colander and leave to steam-dry for a few mins. Toss in the colander to rough up the sides.\nTransfer to a large bowl. Shake over the flour, some salt and a little pepper, and toss well to combine. Spoon over 100g of the fat and toss to coat evenly. Lay the potatoes on a tray lined with baking parchment and freeze. Once frozen, the potatoes can be transferred to a freezer bag for easy storage. Can be frozen for up to 3 months.\nWhen ready to cook, heat oven to 200C/180C fan/gas 6. Pour remaining fat and the oil into a baking tray and put in the oven. When the fat is sizzling, carefully add the potatoes, then roast for 25 mins. Remove tray, then increase oven to 220C/200C fan/gas 7. Turn over the potatoes and return to the oven for a further 40 mins until golden and crisp."}
{"text": "In a large bowl, rub together the flour, butter, mustard powder, cayenne, polenta (if using), poppy seeds, stilton and a pinch of salt, using your fingers and hands, until the mixture forms a pastry dough. Knead the dough briefly until it really sticks together and is very lightly speckled with tiny bits of cheese. You can be quite heavy-handed.\nOn a lightly floured surface, roll the dough into a sausage shape with your hands, about 25cm long and 4cm in diameter, then wrap in cling film and chill for at least 1 hour. (The pastry can now be chilled for up to 1 week or frozen for up to 1 month. The pastry can be sliced and cooked from frozen but you need to cut it slightly thicker.)\nTo bake the biscuits, preheat the oven to 190C/gas 5/ fan 170C. Slice the dough into rounds just under 1cm thick. Lay the rounds a couple of centimetres apart on a baking sheet (or two, if you are cooking all the biscuits at the same time). Put a very small piece of stilton in the middle of each biscuit, then bake for 10-15 minutes, until the edges are starting to go golden and the cheese is bubbling. Leave to cool slightly before serving. The biscuits will keep for 2-3 days in an airtight tin."}
{"text": "For the spinach, boil a kettle and put half the spinach into a colander. Pour over the hot water until it wilts, then cool completely under cold water. Tip into a clean tea towel, then wring out every last drop of water you can. Repeat with the other half.\nFor the polenta, bring the stock to the boil in a large pan, then stir in the polenta in a fine, steady stream, so to avoid any lumps. Keep cooking for 5 mins, stirring all the time, until thick. Stir in the butter, Parmesan, half of the spinach, the nutmeg and plenty of seasoning, then leave to cool for a few mins.\nMeanwhile, slice each cheese into three rounds. Tear off six pieces of cling film, about 30cm across, then, while the polenta is still soft, spoon a sixth onto each square. Nestle the slices of cheese on top, then draw the edges of the cling film around and twist, to make burgershaped polenta cakes with the cheese completely sealed in the middle. Cool and chill for up to 2 days.\nCut the squash and beetroot veg into finger-tip-wide chunks. Keeping the beetroot separate, put the squash, shallots, 2 tbsp extra virgin oil and half of the garlic and herbs into a large bowl, then rub well and leave to marinate for 1 hr. Do the same with the beetroot, remaining herbs and garlic and 1 tbsp oil.\nHeat a small knob of butter in a large non-stick frying pan, then fry the beetroot, herbs and garlic, for 10 mins on a medium heat, stirring often till starting to colour. Tip into one end of a large roasting tin. Wipe out pan, then repeat with the squash and shallots in a little more butter, browning one-third at a time for 5 mins, until tinged golden. Tip into the other end of the tin. Heat oven to 190C/170C fan/gas 5. Transfer the roasting tin to the oven and roast for 40 mins. The veg can be cooled to room temperature at this stage, then covered for up to 24 hrs and crisped up in a hot oven for 15 mins on the day.\nAfter 40 mins scatter the sesame seeds over the roasted veg, then tip the veg into a large bowl and keep warm. With the roasting tin over a low heat, splash in the Madeira, bubble it down to 2 tbsp, then stir in the honey, balsamic, soy sauce and a little butter. Simmer until just starting to make a syrupy sauce, then stir in the olive oils. Can be made ahead and re-heated.\nFifteen mins before serving, heat a little oil and remaining butter in a large non-stick frying pan. Once sizzling, add the polenta cakes and fry on both sides for 5 mins until golden. Fry in 2 batches and keep warm. Re-heat the remaining spinach in a pan for a few secs, with a grating more nutmeg and a good pinch of seasoning.\nSit the polenta cakes on warmed plates, and top with some spinach. Stir parsley into the dressing. Toss the roasted veg with a few tsp, then pile the veg on top of the polenta. Drizzle a little more dressing over and around, then serve."}
{"text": "Put the onion and 10 cloves in the base of the \n then nestle in the gammon joint. Pour over the ginger beer then cover and cook on LOW for 7 hours until the gammon is tender, but still holding its shape. You can cool then chill the gammon at this stage if you prefer.\nHeat the oven to 200C/180C fan/ gas 6. Carefully remove the skin from the gammon leaving a layer of fat behind. Score the fat in a diamond pattern with a sharp knife, making sure you don't cut into the meat, then stud the centre of each diamond with cloves.\nMix the mustard and ginger preserve in a bowl, spoon or brush over the gammon then bake for 20 mins until golden and sticky. "}
{"text": "Roll out the pastry on a lightly floured surface until big enough to line a 23cm fluted tart case, about 3cm deep. Line the tin with the pastry and fold the overhang over the sides. Chill for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Line the tart with greaseproof paper and baking beans. Bake blind for 20 mins. Remove the beans and paper and bake for 10 mins more until the pastry is pale golden and sandy.\nMeanwhile, mix the golden syrup, breadcrumbs, lemon zest and juice, ground ginger and eggs together. Once the pastry is ready, lower the oven to 160C/140C fan/gas 3. Using a small serrated knife, carefully trim the edges, then tip in the treacle mixture and bake for 55 mins-1 hr until the filling is golden and crisp, and feels set to the touch.\nWhen the tart comes out of the oven, arrange the ginger slices over the top. Drizzle with some syrup from the ginger jar, then lift from the tin to a serving plate and serve warm with vanilla ice cream or custard."}
{"text": "Heat oven to 190C/170C fan/gas 5. Dry-fry the bacon in a pan for 5 mins until crisp, then chop into small pieces. Boil the whole potatoes for 5 mins, drain, then place in a bowl of chilled water.\nWhen cool enough to handle, pat the potatoes dry and roughly grate into a large bowl. Toss with the oil as you go, to stop them from sticking. Roughly grate the onion and squeeze out any excess juice, then stir into the potatoes along with the bacon.\nPlace a baking sheet in the oven for 5 mins to warm through. Liberally grease a 23cm loose-bottomed cake tin with butter. Scatter the potato over the tin, trying not to pack it down, then dot all over the top with butter. Place on the hot baking sheet and bake in the oven for 1 hr 20 mins until the potatoes are cooked through and crisp on top."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Heat 75g of the sugar and the vanilla seeds in a medium, heavy-based frying pan over a medium-low heat for 5-8 mins, or until golden brown and caramelised. Add the apples, currants, sultanas, allspice, nutmeg and walnuts, then cook for 10 mins or until the apple is tender. Remove the apple mix from the pan with a slotted spoon and cool to room temperature.\nLine 2 baking trays with baking paper. Place a sheet of filo on one of the trays, then brush lightly with the melted butter. Sprinkle over 1 tsp sugar. Repeat the process until there are 3 layers of filo. Repeat with the remaining sheets of filo on the second tray.\nDivide the apple mix along the shorter edge of both pastry sheets and gently roll into 2 logs, tucking in the ends as you go. Brush with melted butter and sprinkle over 1 tbsp sugar. Can be made up to 1 day ahead, kept chilled. Bake for 25 mins, or until the pastry is golden brown and crisp. Let cool slightly, then cut each strudel into 6 diagonal slices. Serve two slices each with a dollop of crème fraîche on the side."}
{"text": "Place the shredded cabbage in a colander over the sink and sprinkle with salt. Leave for 2-3 hours, then drain and wash away the salt. Pay dry with a clean tea towel.\nPut the vinegar, wine, sugar, peppercorns and bay leaves into a big, wide saucepan and simmer until the liquid has reduced by about half. Set aside for 10 mins to infuse.\nStrain through a fine sieve into a jug or bowl, and discard the peppercorns and bay leaves. Put the cabbage and mustard seeds into a big bowl, and then pour the strained liquid over. Transfer the cabbage and pickling liquid into sterilised jars and seal. Will last for a month in the fridge."}
{"text": "Boil eggs for 2½ mins, then cool slightly before peeling and trimming each end.\nHeat oven to 220C/200C fan/gas 7. In a bowl, mix together the sausagemeat grated onion, apple, parsley, Tabasco, ham and breadcrumbs. Roll the pastry out to a rectangle about 25 x 35cm, carefully lift onto a baking sheet and brush all over with beaten egg.\nPress two-thirds of the sausage mix along one of the long sides of the pastry, leaving 2cm pastry free on one side for sealing, and half of the pastry empty on the other side for folding over later. Press a line down the middle of the meat with your finger, then lay the eggs along it, trimmed end to trimmed end. Press over the rest of the sausagemeat. Fold the pastry over the sausage and press the edges together, before trimming with a knife and sealing well by pressing the edges with a fork.\nBrush all over with more egg and bake for 40 mins until golden. Leave to cool, then slice and serve with mustard. Can be made 1 day ahead."}
{"text": "Tip the dried fruits and mixed peel into a large bowl. Pour over the brandy, zests and juices. Stir, then cover and leave to soak for 24 hrs.\nTip the mixture into a large saucepan with the remaining ingredients and stir well. Set over a medium heat and, once the suet has melted, turn up the heat and bubble for a few mins. Pack while hot into sterilised jars (see tip, below). Leave in a cool, dark cupboard for at least a fortnight, or for up to 6 months."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Remove all the fat from inside the bird and use a skewer to prick the skin all over, especially under the wings. Season the inside and stuff the goose with the onions and herbs. Rub the breast and legs with the oil; season generously with salt. Sit the bird, the right way up, in a large roasting tin. Cover with a large piece of foil, scrunching it up at the sides so it’s a tight fit. Place the goose in the oven (leaving a shelf above free for the Roasted roots, see page 62) for 1 hr 30 mins.\nTake the goose out of the oven, then remove the foil, carefully ladle all the fat out of the tin (or use a baster to suck it out) into a bowl, then lightly baste the goose. Re-cover with foil, then roast for another 1 hr 30 mins. Pour all the fat from the tin again, baste, then return to the oven without any foil to brown for a final 30-40 mins until golden brown. Don’t worry about whether it’s done – the goose will be cooked all the way through. Transfer the goose to a large board or platter to rest in a warmish place for 30 mins. Keep the tin to finish the gravy in.\nTo make the gravy, while the goose is roasting, heat the oil in a sauté pan until very hot, add the pieces of goose neck, then fry until browned and caramelised. Add the veg to the pan, then fry for about 10 mins until brown and just starting to burn slightly. Throw in the herbs, then pour over the cider and boil down by about two-thirds, skimming off any froth that comes to the top. Pour in the chicken stock, reduce by half, then strain into a large jug and set aside. The stock can be made the day before.\nOnce the goose has come out of the tin, pour all but about 2 tbsp of fat from it, keeping in any brown juices. Place the tin on the heat, scatter in the flour and stir to make a brown paste the texture of wet sand. Slowly pour in the cider stock and stir to make a smooth gravy. Season to taste, then strain again into a gravy jug.\nServe the goose on a platter with the herby onions from the cavity scattered around."}
{"text": "For the brining, take all the spices for the glaze and toast them in a frying pan until they begin to release their fragrance. Grind using a pestle and mortar, then tip into a food processor with the sugar and blitz everything together to make a spice mix. Tip two-thirds of the mix (reserving the rest in a sealed plastic container) into a large pan with the salt and 5 litres of water and bring to the boil, then turn off the heat. When the mix has cooled, pour it over the ham and leave in the fridge to brine for 24 hrs.\nAfter 24 hrs, wash off the brine. Place the ham in a large pan with the stock veg, herbs and vinegar. Cover with water and bring to the boil. Lower the heat to a gentle simmer and cook, uncovered, for 3 hrs, topping up with water as necessary. Turn off the heat and leave the ham to cool in the stock.\nHeat oven to 220C/fan 200C/gas 7. Remove the ham from the stock and cut away the top layer of fat and skin. Score the fat in a criss-cross and brush with the mustard, then pack on the reserved spiced sugar. Roast for 35-40 mins until the glaze has completely caramelised and become sticky. Allow the ham to rest for at least 10 mins before carving."}
{"text": "Heat the oven to 180C/ 160C fan/ gas 4 and line a 20cm x 20cm baking tin with baking parchment. Melt the dark chocolate with the butter in the microwave or in a heatproof bowl over just simmering water.\nMix together the sugar, flour and cocoa powder and stir in the melted chocolate and butter mixture, followed by the eggs. Stir through the dried cranberries and macadamia nuts, then swirl through the cranberry sauce.\nPour into the tin and smooth the surface. Bake for 25 - 30 mins. Allow to cool before slicing."}
{"text": "Take a large food bag, cut down one side and along the base, then open out. Use to line a 1-litre pudding basin. Tip the contents of the jar of conserve into a large bowl, then stir to break it down. Using a large sharp knife, shave 50g of the chocolate into shards, then reserve. Measure 450ml of the cream into a bowl, then whip until it just holds its shape. Fold the cream into the ginger conserve using a large spoon until the cream is evenly flecked with ginger, then gently fold in the shaved chocolate.\nSpoon the cream mixture into the lined bowl and smooth the top. Freeze for at least 4 hrs, or overnight is better, until the ice cream is firm. Line a wooden board with foil, then lightly oil the foil. Tip the sugar into a heavy based pan, then gently heat, without stirring, until the sugar is melted and a golden caramel. You can swirl the pan gently to help it melt evenly if necessary. Remove from the heat, then stir in the almonds. Tip onto the foil, spread out with the back of an oiled metal spoon, then leave to set.\nPour the reserved cream into a small pan. Break up the remaining chocolate, then add to the pan, stirring over a low heat until the chocolate has dissolved. Set aside to cool and thicken.\nWhen the almond caramel has set, break it up into small pieces using a rolling pin. You are aiming for a mix of larger and smaller pieces.\nWhen the chocolate sauce has cooled and is thick enough for spreading, turn the ice-cream bombe out onto a serving plate, remove the bowl, then peel off the plastic. Spread the chocolate over the top and sides of the bombe as evenly as possible. Add more as the first layer starts to set until you have used it all up. Scatter over the almond caramel, then return to the freezer until firm. To store the bombe, wrap in freezer film until ready to serve.\nTo serve, transfer the bombe to the fridge 45 mins before serving. Dust with a little icing sugar and cut into thick wedges."}
{"text": "To fry the vegetables, heat the oil in a large saucepan and fry the onion for 5 minutes until golden. Stir in the celery and fry for 5 minutes, then tip in the potatoes and fry for a further 1-2 minutes, stirring often.\nStir in the curry paste, let it cook for a minute or so, then pour in the stock. Bring to the boil and stir well. Lower the heat, cover and simmer for 15-20 minutes until the potatoes are tender.\nTo serve, tip the leftover veg into the pan and warm through for a few minutes. Pour the soup into a food processor or blender and blitz to a smooth purée. Thin down to the consistency you like with hot water or stock (we added 300ml) then taste for seasoning. Cool and freeze, or serve in bowls with spoonfuls of yogurt or crème fraîche swirled on top."}
{"text": "Cut any thick celery stalks in half, trim all of it into thumb-size lengths, then wash and leave wet. Melt half the butter in a large frying pan, then add the celery, onion and bay leaves. Season, cover, then cook over a medium heat for about 30 mins, stirring occasionally to stop the onions catching.\nMeanwhile, prepare the breadcrumbs. Melt the remaining butter in a separate pan, then toss in the crumbs and walnuts, stirring often until lightly golden and toasted. Set aside.\nHeat grill to medium. When the celery is tender, turn the heat right up, pour in the wine and stock, then reduce by two-thirds. Pour in the cream, then reduce for a final few mins until you have a syrupy sauce. Check seasoning, tip into an ovenproof dish, then scatter with the breadcrumbs and Parmesan. Grill for 2-3 mins, until the sauce bubbles. Let it sit for 5 mins before serving."}
{"text": "Mix the sultanas and sherry and set aside for 1 hr to soak.\nHeat oven to 160C/140C fan/gas 3. Grease a deep, 23cm loose-bottomed cake tin, and line the base and sides with a double layer of baking parchment that comes about 2.5cm above the sides of the tin. In your largest mixing bowl, beat the butter, sugar and vanilla together until pale and fluffy. Beat in the eggs one by one.\nStir in the flour, baking powder, and the ground and flaked almonds. Next, add the soaked sultanas with any remaining sherry, the dried apricots, the mixed peel, and all the zest and juice. Scrape into the cake tin, smoothing out the surface.\nBake on the middle shelf of the oven for 1 hr 25 mins. Poke with a skewer in the centre to check it is cooked – if the skewer comes out with any uncooked mixture stuck to it, bake for 10 mins more before checking again. Cool in the tin. Decorated, or wrapped in greaseproof paper and foil, the cake will keep for up to a month."}
{"text": "Heat the oil in a large pan, add the onion, then fry until lightly coloured. Add the nigella seeds and chilli, then fry for 1 min. Tip in the squash, potato and stock, then bring to the boil. Stir well, cover, then simmer for 20 mins, or until the vegetables are tender.\nPurée the soup in batches, adding a handful of parsley with each batch. Return the soup to the pan, then reheat. The soup can be frozen for up to 1 month."}
{"text": "Put the garlic cloves, onion, bay leaves, thyme, double cream and milk in a pan. Bring slowly to the boil over a low heat, partially cover with a lid and cook for 20-30 mins until the onion is tender and the cream mixture slightly thickened. Turn off and leave everything to infuse for 1 hr.\nStrain the cream mixture into a jug (or bowl) and discard the herbs. Put the garlic cloves and onion in a food processor or blender and whizz until smooth – add a drop of the cream if it helps. Stir the paste back into the rest of the cream and season with 2 tsp salt.\nPut the pancetta in a cold frying pan and cook gently, over a low-medium heat so the fat melts into the pan, until the pancetta is really crispy. Lift out with a slotted spoon, add the butter and mushrooms and turn up the heat, frying the mushrooms, until golden and dry.\nLeave the skins on the potatoes and slice as thinly as possible. Grease a large baking dish with a little more butter. Layer up the potato slices, scattering over some of the cooked pancetta, the mushrooms and a little freshly grated nutmeg and pepper as you go. Finish by slowly pouring over the cream so that it settles among all the layers, then scatter over a few more thyme leaves. Cover with foil.\nHeat oven to 180C/160C fan/gas 4. Bake the gratin for 1 hr, then remove the foil and bake for 35-45 mins more until golden and crispy on top. Poke a knife in to check the potatoes are tender, then leave for 10-15 mins to settle, before serving with a salad, if you like."}
{"text": "Put the raisins and glacé fruit in a bowl with the rum or juice, then soak for 1 hr.\nRoll out the pastry on a surface lightly dusted with flour, then use it to line a deep 23cm loose-bottomed tart tin. Leave the pastry overhanging the edges, prick the base, then chill for 1 hr.\nHeat oven to 200C/180C fan/gas 6. Fill the pastry case with baking paper and baking beans, then blind-bake for 8 mins. Remove paper and beans, then bake for about 5 mins more. Allow to cool a little.\nBeat the butter, sugar, almonds, flour and eggs. Stir in the fruit, then pour into the case. Scatter over the pine nuts, press lightly into the surface, then drizzle with honey.\nReturn the tart to the oven, turn down heat to 180C/160C fan/gas 4 and bake for 40-50 mins until firm to the touch. If the top browns too quickly, cover with foil. Cool in the tin. Will keep in a cool place for 2 days and will freeze for 3 months. Thaw at room temperature for 5 hrs. Drizzle with honey to serve."}
{"text": "Pour the wine and apple juice into a large saucepan and add the sugar, cinnamon stick and star anise. Heat gently, stirring once or twice, until the sugar has dissolved, then continue heating gently for another 15 minutes.\nJust before serving, swirl in the Curaçao or Cointreau, throw in the frozen fruits and add the apple slices."}
{"text": "Mix together all the ingredients in a pan and place over a moderate heat. Stir constantly, allowing the mix to caramelise and turn brown and making sure all the nuts are well coated.\nPour the nuts onto some greaseproof paper. Don't worry if they are stuck together, as they can be separated when cool. Store in an airtight container for up to 1 week."}
{"text": "Arrange the prawns and salmon on plates. Mix the mayo, garlic and chopped dill, and add lime juice to taste. Put a spoonful on each plate, scatter over dill leaves add a wedge of lime and a grinding of pepper."}
{"text": "Heat most of the butter in a shallow pan. Add the shallots, bay leaf and thyme, and cook for 10 mins until soft, golden and sticky. Pour in the cream and bring to the boil. Turn off the heat, season with nutmeg and cayenne and leave to infuse.\nMeanwhile, heat oven to 200C/180C fan/ gas 6. Place the potatoes in a pan of cold water, bring to the boil, then drain. Butter a large gratin dish, then layer it up with potatoes and cream, finishing with a good ladle of cream and shallots. Use a fish slice to press everything down. \n. Bake for 40 mins or until golden and the shallots are starting to crisp."}
{"text": "Heat half the oil in a frying pan and quickly seal the venison for about 2 mins on each side until browned. Remove the meat from the pan, brush all over with the mustard and leave to cool.\nMince the mushrooms in a food processor. Place the pan back on the heat with the rest of the oil and add the mushrooms. Season with salt and pepper and fry over a high heat for 5 mins until the excess moisture has evaporated and you have a thick paste. Season, transfer the mushrooms to a bowl and leave to cool.\nLay 2-3 large sheets of cling film overlapping each other on a clean surface. Lay the slices of prosciutto overlapping lengthways in 2 rows of 3. Sit one of the pieces of venison in the middle of the prosciutto. Press the mushrooms over the venison and sandwich with the other piece of venison. Roll into a tight package (see step-by-step images above) and leave to chill in the fridge.\nLay out another couple of pieces of cling film. Trim the pancakes into squares and lay them overlapping on the cling film. Remove the cling film from the prosciuttowrapped meat and place the meat on top of the pancakes. Roll up tightly again in cling film, then place in the fridge to hold its shape.\nRoll the pastry out to a large rectangle big enough to easily wrap the meat in, then brush all over with egg yolk. Unwrap the cling film from the pancake-wrapped venison and roll to completely encase in the pastry. Tuck the ends in and trim any excess. Lay out more cling film and finally roll into a tight package to get an evenly thick log. Tie the ends of cling film to keep the package tight and leave in the fridge overnight or in the freezer for an hour. Can be made to this point up to a day in advance.\nWhen ready to cook, heat oven to 220C/200C fan/gas 7. Remove the cling film and brush the Wellington all over with egg yolk. Sit it on a baking tray lined with baking paper and lightly score in a feathered fashion. Bake for 50 mins for medium rare, dropping to 200C/180C fan/ gas 7 if the pastry becomes too brown. Remove from the oven to rest for 20 mins. If you prefer the meat well done, turn oven off after 40 mins and leave to rest inside. Trim the end of the pastry, carefully carve in slices about 3-4cm thick and serve.\n for the Wellingtons, tip 100g plain flour into a bowl. Beat 1 egg with 250ml milk and gradually whisk into the flour until smooth. Stir in some snipped chives and a handful of chopped flat-leaf parsley just before cooking, then heat a drop of oil in a large non-stick frying pan and swirl around some of the batter to make a thin pancake. When the pancake is done, make another 3 and set aside. The pancakes can be made 2 days in advance.\n, chunk 1kg floury potatoes. Place in a pan of cold salted water and bring to the boil. Simmer for about 15 mins until completely tender, then drain and return to the pan over a low heat for a few mins to dry out. Press the potatoes through a ricer and gradually add 150ml warm double cream and 50g butter. Season to taste and serve, or leave to cool and reheat in a pan or microwave with a touch more cream and butter. The mash can be made a day in advance.\n, peel and trim 24 baby carrots (a mix of white and orange if you can find them) but keep them whole. Boil for 2-3 mins in salted water until just tender, then drain. Heat a large knob of butter in a frying pan and sizzle the carrots for 8-10 mins until golden. Serve the carrots or cool and reheat in a pan with a touch more butter or in the microwave. The carrots can be made a day in advance.\n, sweat 1 finely chopped shallot in a little butter with a thyme sprig. Pour in 300ml port and reduce by two-thirds, then add 600ml fresh chicken stock and reduce again by two-thirds until syrupy. Strain into another saucepan ready to be reheated. The sauce can be made 2 days in advance and reheated in the saucepan, adding a splash more stock if too thick."}
{"text": "First prepare the stuffing. Heat the butter and oil in a large frying pan, then soften the onion without colouring for 10 mins. Tip into a bowl. Add the pancetta or bacon to the pan, fry for 5 mins until golden, then add the pine nuts, garlic, sage and lemon zest. Fry for 1 min more until fragrant and the pine nuts are starting to brown. Stir in the chopped parsley. Tip into the bowl with the onions, then bind with the crumbs, egg and seasoning.\nButter and season a sheet of turkey foil or use 2 sheets of foil crimped together to make a sheet about 50 x 60cm. Lay five long pieces of string over the foil like rungs of a ladder, ready to tie the breast together. Arrange the pancetta or bacon in a lattice over the middle of the foil, on top of the string.\nOpen out the butterflied breast, skin-side down, and slash each side several times. Cover with cling film and bash with a rolling pin until the meat is about 5cm thick all over. Trim the sides so that you have a roughly rectangular shape (but be careful not to cut the skin). Lift onto the pancetta, then fill any gaps with the trimmings. Season, then press the stuffing along the middle of the joint. Pull up the sides at one end, tucking in the short end, then tie the string tightly so that the stuffing is encased. Repeat with all the strings. Wrap up tightly in the foil, then turn the roll over so that the pancetta is on the top. Can be left in the fridge for up to 2 days.\nHeat oven to 190C/fan 170C/gas 5. Sit the joint in a roasting tin and roast for 40 mins per kg or until a skewer inserted into the middle comes out very hot and the juices run clear. Unwrap for the last 10 mins of cooking.\nLift the joint onto a board and leave to rest, covered, for at least 10 mins. For the gravy, heat the tin on the hob, then splash in the wine and any juices. Reduce by half, then add the stock and repeat. Pour in the cream and bubble to a slightly reduced sauce. Season to taste, then stir in the parsley."}
{"text": "Mix the spices, thyme and zest. Slash the skin of the breast, cutting through the fat but not into the meat, then rub the spice mix over the breast and legs. Leave for at least 2 hrs, or for up to 24 hrs in the fridge.\nHeat oven to 160C/fan 140C/gas 3. Put the legs into an ovenproof frying pan or smallish roasting tin, season well, then roast for 1½ hrs until deep golden and crisp. Sit the legs on a plate, then keep warm in a low oven or let cool. Spoon off excess fat from the pan juices and keep it for the next time you make roasties. Pull the meat and skin from the legs, shred using 2 forks, then mix together. Keep warm or, if making ahead, reheat in a hot oven for 10 mins before serving.\nPut the pan back on the hob, add the sugar for the sauce and let it melt and turn dark golden. Add the vinegar (the sugar might turn hard at this point but don’t worry as it will dissolve again), then reduce by about half. Tip in the clementine juice and almost all the stock and bubble again until reduced and syrupy. Whisk in the butter, then season to taste.\nHeat a frying pan, then cook the breast, skin-side down, for 10-12 mins until very crisp and the fat has run out. Turn over, fry for another 5 mins for just pink (or longer if you prefer), then lift onto a plate and rest, uncovered, for 10 mins. Spoon off remaining fat, add the leftover stock to the pan, then stir to dissolve any tasty, meaty bits. Add to the sauce.\nSlice the breast on the diagonal, then divide half of the leg meat between 2 warm plates in small piles (you can use a cutter or ring if you like, to make it neater). Top with slices of breast. Spoon the sauce over the meat and serve with glazed veg and potatoes."}
{"text": "Add the garlic, feta, ricotta and dill to a food processor and whizz until smooth but thick.\nFill the middle of the cucumber with the cheese mix and smooth over. Cut into 3cm-thick slices. Sprinkle with cracked pepper and garnish with the dill fronds."}
{"text": "Up to 2 days before serving, heat oven to 200C/180C fan/gas 6. Heat the oil in a large frying pan. Add the onions and thyme, cover, and cook over a gentle heat for 10-15 mins until softened and caramelised. Pour the cream and milk into a large bowl and season well. Add the potatoes and mix to combine.\nButter a 23 x 28cm ovenproof dish, then layer in half the potatoes. Spread the onion mixture on top, then layer on the remaining potatoes. Press down with your hands. Pour over the milk mixture, which should come just level with the potatoes. If not, add a little more milk until it does. Cover with foil, then bake for 11⁄2 hrs until tender. Remove from the oven and leave to cool. Cover and store in the fridge.\nOn the day, heat the oven to 220C/200C fan/gas 7. Uncover the gratin, spread the crème fraîche on top, then sprinkle over the Parmesan. Put in the oven and cook for 30 mins until the cheese is melted, the top crisp and golden brown, and the gratin piping hot. Serve garnished with extra thyme."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Butter and line the base and sides of a 30 x 35cm Swiss roll tin with baking parchment.\nSeparate the eggs, putting them into two large mixing bowls. Add the sugar and 2 tbsp water to the egg yolks. Using an electric whisk or tabletop mixer, whisk the sugar and yolks for about 5 mins until the mixture is light in colour and thick enough to leave a trail when the whisk blades are lifted. Sift in the flour and cocoa, then fold in lightly, using the whisk blades or a large metal spoon.\nUsing a clean whisk, beat the egg whites until they are stiff, then fold into the cake mixture in three batches, again using the blades to preserve as much air as possible.\nPour the mixture evenly over the prepared tin, then carefully spread to the edges. Bake for 10-12 mins, or until the cake feels firm to the touch. Put a large sheet of baking parchment on the work surface and sprinkle lightly with caster sugar. Turn the cake out onto the parchment and peel off the lining paper. Cover with a clean tea towel, then leave to cool completely. Trim a little cake from all the edges, then score along the edge of one of the long sides of the cake and roll up from there, using the paper to help you, rolling the paper inside the cake.\nTo make the icing and filling, bring the cream to the boil in a small pan, remove from the heat, then break in 400g of the chocolate. Stir until it is melted and smooth. Leave to cool, then chill until it is spreadable, about 1 hr. Chop the remaining chocolate, spoon a third of the icing into a bowl, then stir them together to make the filling.\nCarefully unroll the cake, then spread all the filling over to within 2cm of the edges. Roll up the cake again using the paper to help you, then set on a board.\nCut a thick diagonal slice off one end of the cake. Transfer the larger piece of cake to a board or flat serving plate. Spread a little icing over cut side of the small piece of cake and fix it to the large roll to make a stump (as photo). Spread remaining icing over the cake, then dust with icing sugar to serve."}
{"text": "Bring a large pan of water to the boil, and add the swede chunks. Boil for 3 mins, then add the parsnips and boil the lot for 12 mins more or until tender. Drain well, then tip both together into a pan or bowl and mash well with the butter. Stir in the golden syrup, three-quarters of the breadcrumbs and the eggs with plenty of seasoning. Transfer to a baking dish and smooth the surface. Toss the remaining breadcrumbs with the oil, seasoning and thyme leaves, then scatter over the mash. Dot with a few knobs of butter. \nTo serve, heat oven to 200C/180C fan/ gas 6 and bake for 40 mins or until piping hot and the crumbs are crisp."}
{"text": "Heat the oil in a large, deep pan. Add the onions, cover, then gently fry for 15 mins until soft and almost transparent. Add the butter and pine nuts, turn up the heat, then fry for 5 mins more or until the onions are dark golden. Stir in the garlic, grate in a little nutmeg, then fry for 1 min. Splash in vinegar.\nMeanwhile, heat the largest pan you have until very hot. Throw in half the spinach, cover for 20 secs, then stir until just wilted. Tip into a colander set over a bowl, then repeat with the second bag of spinach.\nTo serve, toss the cooked spinach into onion mix and season generously."}
{"text": "Put oil in a large frying pan to cover the base, and heat. Fry the aubergine until softened, 2-3 mins . Season, then drain on paper towel. You may have to do this in batches.\nFor the filling, add 2-3 tbsp oil to the pan and fry the pepper, courgette, shallots and garlic over a high heat until they have a good colour, 3-5 mins. Stir in the balsamic vinegar and cook until evaporated. Add the tomatoes and season, then cook for 3 more mins stirring occasionally until the mixture is softened, but not too saucy. Remove from the heat, then mix in the olives, capers, half the shredded basil and the grated parmesan. Set aside to cool.\nGrease the moulds and line the bases with aubergine slices to fit. Top with veg mixture, more aubergine slices (cut to fit if needed) and a slices of cheese. Repeat the layers, finishing with aubergine. Press lightly to firm. Can be covered with cling film and chilled for up to 1 day.\nTo cook and serve: heat oven to 200C/fan 180C/gas 6. Chilled cups will need to come to room temperature first. Place the cups on a tray, uncovered, and bake for 12-15 mins until bubbling. Allow to stand for 10 mins while you toss the spinach and remaining basil with vinaigrette and seasoning and divide between six dinner plates. Scatter over the nuts.\nLoosen the tops of the timbales with a table knife and up-end into the centre of the salad on the plates, shaking the cups to help demould. Top with the parmesan shavings and serve."}
{"text": "Boil the kettle. Put the couscous, cranberries and spices in a large bowl. Dot with the butter and pour over 350ml boiling water. Cover immediately with cling film and leave for 5 mins to steam. Remove the film and fluff with a fork to loosen the couscous grains. Cool, stir in the pine nuts and herbs, then season to taste. Cut 6 squares of baking parchment about 30 x 30cm.\nSeason the salmon fillets, spoon the couscous in mounds in the centre of the parchment squares, then dot with a little butter. Top each with a piece of salmon, scatter with a little orange zest and drizzle with a little juice. Fold the sides of the paper over, then fold up the ends to make a parcel. Tie with string and secure with a bow. Stir together the cranberry sauce, orange zest and juice, then set aside in a serving bowl. The parcels can be chilled for up to 1 day. Be sure to remove them from the fridge 20 mins before cooking.\nHeat oven to 200C/180C fan/gas 6. Put the parcels on a baking sheet in the middle of the oven and cook for 15 mins, or 20 mins if you prefer your salmon well done. Pop the parcels onto plates and let your guests unwrap their own supper. Serve with Garlic & feta broccoli and the cranberry & orange sauce."}
{"text": "Heat the oil in a large saucepan, add the onion and cook gently for 8 mins or until softened. Add the carrots and parsnips, and cook for 8 mins until starting to soften and brown a little. Stir in the garlic and ras el hanout, and cook for a further 30 secs. Tip in the stock, tomatoes, chickpeas, dried fruit and 150ml water. Season, bring to a simmer and cook for 25-30 mins until the vegetables are tender.\nAdd the turkey and simmer for 5 mins to warm through. Stir in the honey, then scatter over the coriander and almonds just before serving with couscous and Greek yogurt."}
{"text": "Heat oven to 140C/120C fan/gas 1. Mix the oil with the spices, then stir in the nuts and drizzle over half the honey. Spread over a baking sheet and cook for 10 mins.\nRemove from the oven and drizzle over the remaining honey, then return to the oven and cook for a further 10 mins. Allow to cool completely."}
{"text": "Butter a 1.2 litre/2 pint pudding basin and put a circle of greaseproof paper in the base. Put the apricots in a small pan and add the brandy. Bring slowly to the boil, then simmer, turning the apricots occasionally until all the brandy has soaked in. Leave until cool enough to handle.\nTip the ground almonds into a bowl, then sift over the cocoa, flour and baking powder and mix everything together.\nIn another bowl, beat the butter and sugar together for 2-3 minutes until light and fluffy.Gradually beat in the eggs and milk.\nChop half the apricots into small pieces. Chop the chocolate into large chunks. Lightly stir the flour mixture into the cake mix, followed by the apricots and chocolate.\nPut the remaining whole apricots into the bowl and spoon over the honey. Add the pudding mixture and smooth the top. Cover with double thickness buttered greaseproof paper and tie down. Trim off the excess paper, then overwrap in foil, tucking the ends under the edges of the paper.\nPut the basin into a large pan and pour boiling water into the pan, to come halfway up the sides of the basin. Cover and steam for 21⁄2 hours, until it feels firm. (The pudding can be made to this stage up to 2 days ahead. Reheat by steaming for 1 hour, or microwave on medium for 6-8 minutes.)\nTowards the end of the cooking time, make the sauce. Break up the chocolate and put in a small pan with the cream and brandy if using. Warm gently, stirring lightly until smooth and glossy.\nCool the pudding in the bowl for 10 minutes, then turn out and serve with the chocolate sauce and cream or good vanilla ice cream."}
{"text": "Soften the onion in the butter with the sage and mace. Cool for a few mins while you whizz the chicken thighs and 300g of the ham in a food processor until minced. Scrape into a large bowl and stir in the softened onion, pistachios, cranberries, apricots and parsley. Season with nutmeg, lots of black pepper and some salt.\nGrease a deep, 20cm round springform or loose-bottomed tin, then line with baking parchment. To make the pastry, mix together the flours and 2 tsp salt in a large bowl, then make a well in the centre. Put the butter and lard into a small pan with 200ml water and very gently melt. Once melted, turn up the heat and when just bubbling, pour into the well and stir with a wooden spoon to a dough – don’t worry if some powdery bits remain.\nOnce cool enough to handle, knead in the bowl until the dough comes together, then tip onto your work surface. Set aside a third, wrapped in a clean tea towel to keep it as warm and pliable as possible, while you quickly roll the remaining dough into a large circle – big enough to line the tin with a little overhanging.\nEase the circle into the tin, pressing evenly into the corners and side – you can be rough with it. Evenly cover the base with half the remaining sliced ham, followed by half the chicken breasts and half the mince mixture, pressing firmly to pack. Repeat with the remaining ham and chicken, then a rounded dome of mince. Put a pie funnel, if you have one, on the top.\nRoll the reserved dough to a circle large enough to easily cover the pie, cutting out a hole (if using a pie funnel). Brush the edge of the pie with some beaten egg and top with the pastry lid. Press to seal the edges before trimming the excess. Crimp the edges between your thumb and forefinger to seal thoroughly, then make a small hole in the middle to let steam escape (if not using a pie funnel). Brush the top of the pie with more beaten egg.\nHeat oven to 200C/180 fan/gas 6. Bake the pie for 1 hr. Very, very carefully remove the pie from its tin, brush the top and side with more egg and bake for another 30 mins until browned and crisp. Leave to cool completely before chilling.\nTo make the jelly, soak the gelatine in cold water for 5-10 mins until soft. Squeeze out any excess water from the gelatine, then dissolve in the hot stock. Once cooled, carefully pour into your chilled pie through the small hole, using a funnel, until full – you may not need all the stock. Chill the pie for a few hrs. Serve with chutney and salad, if you like."}
{"text": "Sieve the icing sugar into a large bowl. Mix in the egg white, a little at a time – stop adding it when you have a soft dough that feels like plasticine.\nAdd 3 drops of the peppermint essence, mix well and taste. Add another drop if it isn’t minty enough.\nRoll half the mixture into 15 balls, about the size of cherry tomatoes, then flatten them with your hand to make the bear heads.\nPlace on sheets of baking parchment on a large board or tray. Using half the remaining mixture, make blueberry-sized balls and flatten them out onto the heads to make snouts. Add chocolate sweets for the noses.\nUse the rest of the mixture to make the ears. Shape them into tiny balls and press them gently into the top of the heads with your fingertips. Use a cocktail stick to shape the eyes.\nLeave the polar bears to dry for 3-4 hrs, or overnight. Eat within 1 month."}
{"text": "Heat the oil in a large, flameproof casserole dish. Season the pork, and brown it in 2 or 3 batches until golden, about 5 mins per batch. Set aside in a bowl. Stir the onions into the remaining fat, cover and soften for 5 mins – they will take on the browned colour of the meat. Heat oven to 160C/140C fan/gas 3.\nAdd the garlic, coriander stalks, chillies and anise to the dish, sizzle for 1 min, stirring often, then mix in the sugar and tomato purée. When these have melted and it looks a bit like barbecue sauce, return the pork and its resting juices to the dish, along with the fish sauce and stock. Tuck in the pineapple chunks here and there.\nOnce simmering, cover the hotpot, leaving a small gap for steam to escape, and transfer to the oven for 2 hrs. With 30 mins to go, skim some of the fat from the top (this tends to seal the liquid in, making it more difficult for the sauce to reduce), then return to the oven. The pork will be meltingly soft when ready. If the sauce is thin, lift the pork into a warmed serving dish, put the casserole dish on the hob and simmer until the sauce has slightly thickened. Leave to cool for 5 mins, taste for seasoning, pour over the pork and sprinkle over the coriander leaves."}
{"text": "Wash the spinach and put it in a large saucepan with just the water that clings to its leaves. Heat for 1-2 mins until gently wilted, then tip into a colander and allow to cool. Once cool, squeeze out the excess water and chop finely.\nHeat the oil in a frying pan and gently cook the onion for about 5 mins until softened. Stir in the garlic and chilli flakes, and cook for 1 min more. Tip into a bowl, add the spinach, courgettes, rice and cheese, and toss together.\nBeat the 2 large eggs with the mustard, a pinch of salt and a good grinding of black pepper. Add to the spinach mixture and mix well. Heat oven to 200C/180C fan/gas 6. Put a baking sheet in the oven to preheat. Cut the pastry in half and roll 1 piece out on a lightly floured work surface until you have a sheet that measures 32 x 17cm. Place in a 30 x 15cm tin and prick it well all over the base. Roll out the remaining piece of pastry to the same size.\nSpoon the spinach mixture into the pastry base. Beat together the milk and remaining medium egg, then brush the edges of the pastry with it. Lay the other sheet of pastry over the top and press down gently to seal. Brush the top with a little more beaten egg and sprinkle with the sesame seeds.\nPlace the tin on the preheated baking tray and bake for 10 mins, then reduce the temperature to 160C/140C fan/gas 4 and bake for a further 30 mins until the pastry is golden. Leave to cool for 10 mins before cutting into squares."}
{"text": "Put the wine, sugar, cloves, star anise and cinnamon stick into a large, shallow pan. Bring to a simmer and cook until the liquid has reduced by half. Add the cranberries and cook for 5 mins or until the cranberries burst and start to look jammy. Set aside to cool. "}
{"text": "Put the chocolate in a pan with the milk. Gently heat, stirring until all the chocolate has melted. Continue heating until the milk is steaming, then remove from the heat and stir in the cream.\nDivide the hot chocolate between 6 mugs, add sugar to taste and hang a candy cane on the edge of each. Pass the mugs round and let everyone stir their hot chocolate with their candy cane – letting as much of the sweet peppermint dissolve as they fancy."}
{"text": "Put the ham hocks in a large pan with the stock ingredients. Cover with cold water. Set pan over a high heat and bring to the boil. Reduce heat to a simmer, cook for 2 and a half to 3 hrs or until the meat falls from the bone. Leave to cool in the pan.\nGrease a 1-litre terrine mould or loaf tin with the oil, then line with cling film. Remove the hocks, then strain the stock through a fine sieve into a pan. Set aside.\nShred the ham, leaving some large chunks, removing as much fat and sinew as possible. In a large bowl, mix the ham with the mustard and parsley. Press the mixture into the prepared terrine.\nBring the reserved stock back to a rapid boil and reduce by half. You should have about 600ml/1pt liquid remaining. Remove from the heat. Meanwhile, soak the gelatine in cold water for 5 mins to soften. Remove from the water, then squeeze out any excess liquid. Add the gelatine to the hot stock and stir well.\nPour enough of the stock over the ham to just cover. Tap terrine firmly on a hard surface to knock out air pockets, then cover with cling film. Chill for 3-4 hrs or overnight. To serve, remove from the mould and carve into chunky slices. Serve with caper berries and toast."}
{"text": "Whip the cream in a big bowl so it is softly whipped, then stir in the custard. Put this in the freezer for about an hour and a half, until it is starting to freeze around the edges.\nMeanwhile, put the sugar in a pan with 100ml/31⁄2fl oz rum. Heat slowly until the sugar has dissolved, tip in the fruits, and simmer gently for one minute to plump up the fruit. Pour everything into a wide bowl (so it cools as quickly as possible), and leave until cold (about an hour). Add the extra tablespoon of rum for a bit more kick.\nStir the cream and custard with a balloon whisk to break it all up, then stir in the cooled fruit. Pour the mixture into a 1.2 litre/ 2 pint pudding basin, cover and freeze overnight until firm (or for up to 1 month).\nTo serve, dip the basin quickly into boiling water to loosen the pudding, go round the sides with a round-bladed knife, then turn the pudding out onto a serving plate. Decorate with clusters of frosted bay leaves and grapes (see 'how to make the decorations') around the base."}
{"text": "Mix together the dried fruit, ginger, orange zest and juice, and Guinness in a bowl. Cover and leave to soak overnight.\nGrease 2 x 1.2-litre pudding basins. Boil a kettle of water. To prepare your steamers, put a snug-fitting upturned bowl or plate in the base of 2 large, deep saucepans, big enough to hold your pudding basins. Add the remaining ingredients (except brandy) to the fruit mixture and stir well, making sure there are no pockets of flour. Divide between your prepared basins and cover with buttered baking parchment and a foil lid. Tie with string to secure and make a handle for easy lifting.\nStand the puddings on the upturned bowls or plates in your saucepans. Pour in enough boiling water to come halfway up the sides of the basins, cover with a tight-fitting lid and steam for 6 hrs, topping up with water if necessary. If your lids start to rattle as the puddings cook, place a couple of heavy cans on top to hold them down. Once cooked, the puddings can mature for up to 1 year in a cool dark place, so if you only eat one this year, that’s fine.\nTo serve, reheat in a steamer for 1 hr until piping hot all the way through. Flame with brandy, if you like, as you bring it to the table."}
{"text": "Heat oven to 140C/fan 120C/gas 1. Lightly oil a 71⁄2cm deep, 25cm round cake tin, and line it with a double layer of baking parchment.\nMix the dried fruits, ginger and syrup, Cointreau, spices and lemon zest. Put the olive oil, sugar and eggs in a bowl, whisk together until light and fluffy. Sift the flour and baking powder into the mixture and tip in the fruit. Fold and stir together well.\nSpoon the mixture into the cake tin. Bake in the centre of the oven for 2-21⁄2 hrs, or until a skewer inserted into the centre comes out clean. Cover with foil if the cake begins to over-brown. Take from the oven and leave to cool in the tin. Remove, leaving the baking parchment in place until you decorate.\nFor the topping: warm the jam and Cointreau together until the jam is liquid, allow to cool. Arrange the fruit on the cake and brush with the jam."}
{"text": "Heat oven to 200C/180C fan/gas 6. Cook the onion in the butter until soft but not browned. Add the breadcrumbs and stir so they soak up all the excess butter and fat. Let the mixture cool. Tip into a bowl with the sausagemeat, apple, cranberries, pistachios, sage and mixed spice. Mix well, then roll into balls. \nTo cook, place in a roasting tin and bake for 40 mins, turning a few times, or until browned all over. Add the bay leaves, if using, for the final ten minutes of cooking."}
{"text": "Slice the chillies and mix with the vodka in a large bottle or jug. Leave for 4-5 hrs. Strain out the chillies and pour back into a bottle to store until needed. Just before giving away, decant into smaller glass bottles, pop a whole chilli in each and label."}
{"text": "Top and tail 500g parsnips, cutting any larger ones in half lengthways, then put in a large saucepan, cover with salted water, bring to the boil and cook for 5 mins.\nDrain in a colander and let them steam-dry for a few mins.\nHeat oven to 190C/170C fan/ gas 5.\nSprinkle 1 tbsp flour and 1 tbsp honey over the parsnips and toss to coat.\nPut the parsnips in a \n with 2 tbsp sunflower oil, 2 tbsp butter and seasoning.\nRoast for 40 mins, turning halfway, until golden."}
{"text": "Heat oven to 190C/170C fan/gas 5. Lightly oil and line a 23 x 32cm Swiss roll tin with baking paper. Mix the coffee with 1 tbsp warm water. Beat the eggs, both sugars and the coffee mix together in a large mixing bowl with an electric whisk for about 8 mins or until the mixture is thick and airy like meringue and holds a trail when you lift up the beaters.\nSift the flour and cocoa powder over the fluffy egg mix, then fold in very gently using a large metal spoon. Pour the mixture evenly into the lined tin and carefully tip it so it spreads evenly without being deflated. Use a knife if necessary to very gently tease it into the corners. Bake for 12-15 mins or until the cake feels spongy but firm when touched.\nLay a sheet of baking paper on the work surface and sprinkle with a little caster sugar. Tip the tin upside-down onto the paper and let the cake fall out. Carefully peel off the paper. Roll up the cake lengthways from one of the short ends with the help of the paper, rolling it inside so the cake doesn’t stick. Cool. The cake becomes even more moist if left overnight wrapped up, then iced the next day.\nFor the chocolate icing, put the chopped chocolate in a medium bowl. Heat a small pan of water (one-third full) until boiling, remove it from the heat, then sit the bowl of chocolate over the top. Leave for a few mins off the heat until melted. Remove the bowl from the pan, then leave the chocolate until it is cool to the touch. Beat the mascarpone and quark together, then sift and stir in the icing sugar and cocoa powder. Stir in the cooled melted chocolate (keeping a couple of tsp back for drizzling), then the coffee mixed with the vanilla extract.\nCarefully unroll the cake, don’t worry if it cracks a bit, and discard the paper. Spread half the icing over the unrolled cake, then re-roll it, finishing with the join underneath. Place the cake on a serving plate. Swirl the rest of the icing all over the cake to cover it, then drizzle over the reserved melted chocolate. Decorate with a sprig of holly."}
{"text": "First, make the filling. Heat oven to 220C/200C fan/gas 7. Mix together 1½ tbsp oil with the cumin, cinnamon and vinegar, and rub the mixture all over the beetroot. Put the beetroot into a small roasting tin, season well, then cover with foil and roast for 20 mins.\nMeanwhile, toss the celeriac with 2½ tbsp oil, the thyme, garlic and some seasoning in a second roasting tin. Separate out the slices so they cook evenly, then cover the tin in foil. In a third roasting tin, mix the sweet potato with the remaining oil, the smoked paprika and some seasoning, and cover with foil. Once the beets have cooked for 20 mins, add the celeriac and sweet potato to the oven alongside them, and roast all the veg for 40 mins further or until tender. Remove the thyme sprigs, squeeze the garlic cloves out of their skins and mash them in with the celeriac, then leave all the veg to cool. All the veg can be cooked the day before and kept in the fridge.\nFor the pastry, boil the kettle and use some coconut oil to grease a deep 20cm springform cake tin. Pour the flour into a bowl and add 1 tsp salt. Mix the coconut oil with 200ml boiling water, stir until melted (put it in the microwave if need be), then pour into the flour and mix with a wooden spoon to form a dough. Working as quickly as you can (it’s best to roll the pastry when it’s warm), cut off a ¼ of the dough and set aside under a tea towel. Roll out the rest to 0.5cm thick, then use it to line the cake tin, pressing the dough into the corners and leaving any excess pastry overhanging the sides. Don’t worry if the pastry breaks – it’s very forgiving, so you can patch it up as you go. Heat oven to 200C/180C fan/gas 6.\nNow build the pie. Cover the base with chard leaves, then scatter over the semolina (which will absorb the beet juices), press in the beetroot, and season. Add another layer of chard, followed by the sweet potato, and season. Add a final layer of chard leaves, then top with the celeriac and season again.\nRoll out the pastry you set aside to a thickness of 0.5cm to use as the lid. Put the lid on top of the pie and, using a fork, press together the overhanging pastry to create a crimped edge. Make a steam hole, then brush the top with a little almond milk mixed with a spoonful of oil (this will help to colour the pastry). Bake in the centre of the oven for 45 mins until the pastry is a deep golden brown. Leave to cool for 15 mins, then remove from the tin and serve in the middle of the table. Will keep for up to three days in the fridge (the pie is also delicious cold)."}
{"text": "Put the dried fruit and dessert wine in a bowl. Cover and microwave on High for 3 mins. Meanwhile, gently melt the butter in a large pan and fry the livers with the garlic, sage and plenty of black pepper for about 5 mins until browned.\nTip the mixture into a food processor, scraping in all of the buttery juices and blend until smooth. Pour in the cream and 2 tbsp of the wine from the dried fruit, season with salt, then blend again.\nGenerously oil the insides of 8 x 100ml ramekins. Spoon some wine-soaked raisins into the base of each ramekin, then top with the parfait. Cover and chill. They will keep for 2 days in the fridge or 1 month in the freezer. Thaw overnight in the fridge.\nTo serve, run a knife round the inside of the ramekins and turn the parfait out onto plates. Accompany with toasted brioche and a few salad leaves."}
{"text": "The night before, put apricots and orange juice in a bowl and set aside.\nTo make the dough, put flour, 1 tsp salt, butter, milk, yeast and egg in a bowl, and mix together to form a dough. Turn the dough out onto a lightly floured surface and knead for 6 mins.\nTransfer dough to a mixing bowl. Cover, then set aside to rise in a warm place for 1 hr.\nMeanwhile, drain the apricots. In a mixing bowl, cream the butter and muscovado sugar until fluffy. Mix in the apricots, flour, raisins, walnuts and orange zest.\nTurn the risen dough out onto a lightly floured surface. Roll it out to a rectangle, about 25 x 33cm. Evenly spread over the apricot mix, then roll out the marzipan and lay it on top. Roll up the rectangle tightly so it looks like a Swiss roll. Roll slightly, then cut lengthways along the roll, leaving 1 end joined. Twist 2 lengths together, then shape into a ring on a baking sheet lined with baking parchment. Set aside to rise for 1 hr.\nHeat oven to 200C/180C fan/gas 6. Bake the twist for 30 mins until risen and dark golden. Towards the end of the baking time, gently warm the apricot jam in a small pan. Brush the freshly baked loaf with the warm jam to glaze it, then set it aside to cool. Once cooled, drizzle the twist heavily with the runny icing."}
{"text": "Heat the oil in a pan and gently fry the onions and garlic until softened, about 5 mins. Add the spices and rice, then stir-fry for 1-2 mins. Pour in the hot stock and simmer until the stock is nearly all absorbed, about 20-25 mins. Stir in the turkey, add seasoning, then continue cooking until warmed through. Scatter over the nuts and coriander. Divide between two bowls and serve with a dollop of cranberry sauce."}
{"text": "Gently soften the leeks in butter and oil in your largest pan for 15-20 mins until almost meltingly soft. \n Stir in the stock, bring to a simmer and cook, stirring occasionally, for 5 mins. Stir in the peas and spring onions for 3-5 mins more until the peas are defrosted and cooked through, then season and serve."}
{"text": "Heat the oil in a large pan, add the celery and onion, and cook for about 5 mins until starting to soften. Tip into a bowl to cool while you remove the sausagemeat from the skins. Add the apple, sausagemeat, breadcrumbs, herbs, egg and seasoning. Mix well – the easiest way is to knead it together in the bowl with your hands. Use 1/4 to stuff the neck cavity of the turkey (see 'Goes well with')\nFor the remainder, line a 900g loaf tin with 8 rashers of streaky bacon, spoon in the stuffing, lift the bacon over and cover with the last 2 rashers. Heat oven to 180C/160C fan/gas 4 and bake the stuffing for 40-50 mins. Can be made ahead up to this point and chilled for 2-3 days. Turn out onto a baking-parchment-lined baking tray and return to the oven (once the turkey has come out) at 220C/200C fan/gas 7 for 15-20 mins more to brown the bacon. If chilled, reheat at the lower temperature for 45 mins, covered in foil, then turn out for the extra 15 mins at the higher temperature. Allow to stand, then scatter with parsley (if you like), slice and serve."}
{"text": "Heat a griddle pan and toast the bread for about 2 mins on each side until golden and marked. Rub the cut side of the garlic clove over each piece.\nHeat the butter in a large frying pan. Add the parsnips, season with sea salt and freshly ground black pepper, then cook over a medium heat, shaking regularly until golden and softened, about 20 mins. Add a splash of water if you need to. Remove from the heat and whizz to a purée in a food processor with both of the oils. Season to taste. Set aside at room temperature if serving on the day. Can be chilled up to 2 days ahead.\nTo serve, top the toasts with the truffled parsnip mix (it should be room temperature), scatter with rocket leaves and Parmesan shavings, then drizzle with a little more olive oil or truffle oil."}
{"text": "Melt the chocolate in a bowl over a pan of simmering water. Meanwhile, crush the biscuits and Maltesers in a large bowl with a rolling pin.\nAdd mini marshmallows, dried cranberries and cake crumbs, then the chocolate and golden syrup. Mix well. Tip desiccated coconut onto a plate. Drop large spoonfuls of mixture onto the plate, then roll them around, coating in coconut and shaping into balls. Place on a baking tray and chill for 30 mins before serving. Sprinkle with edible glitter if you like."}
{"text": "Mix the oats, spice and sugar. Melt the butter in a frying pan, add the oats and fry for about 5 minutes, stirring all the time, until they are lightly toasted and crisp (they become crispier still on cooling). Tip into a bowl and leave to cool.\nPeel, core and thickly slice the apples. Melt the butter in the frying pan until it is foaming, add the apples and fry quickly over a fairly high heat, flipping them over when they start to colour. Sprinkle over the sugar and cook for a further 2-3 minutes, until the apples are slightly softened. Leave to cool.\nLayer half the apples and almost half the oats in a glass serving dish, repeat, setting aside a few oats. Drizzle over the coulis, then spoon over the custard. Whip the cream until stiff, then spoon over the custard. Scatter over the remaining oats. Serve straight away or chill for up to 6 hours."}
{"text": "Heat oven to 180C/160C fan/gas 4. Line a roughly 37 x 25cm tin with baking parchment. Melt the chocolate over a pan of barely simmering water. Set aside to cool while you get everything else ready. Whisk the yolks and brown sugar until pale and thick enough to hold a trail. Whisk in the cocoa, chocolate, clementine zest and juice. Whisk whites until stiff, whisk a third into chocolate mixture, then fold in the rest. Transfer to tin, gently spread to corners and bake for 16 mins until firm to touch.\nMeanwhile, dust a large sheet of baking parchment with a little cocoa. When the cake is done, turn it out onto the parchment. Don’t remove the paper stuck to the bottom of the cake – just roll the cake up with the paper inside from one of its longer sides. Leave to cool. \nFor the frosting, melt the chocolate, cream and icing sugar together in a bowl over a pan of barely simmering water. Cool and chill until spreadable. Or chill for up to 24 hrs, then leave at room temp until spreadable again.\nFor the clementine cream, whisk the cream, crème fraîche, icing sugar, clementine zest and juice until thick. Chill for up to 24 hrs.\nTo make the decoration, melt the caster sugar with 100ml water in a small pan and gently bubble. Peel the zest from the clementine with a vegetable peeler. Thinly shred into strips, then drop into the bubbling syrup. Simmer for 2 mins, then turn off and leave for another 2 mins. Scatter a little extra sugar onto a plate. Lift out the shreds with a slotted spoon and toss in the sugar. Set aside to dry.\nTo assemble, gently unroll the sponge and peel off the paper. Squeeze over juice from final peeled clementine. Thinly spread with a tiny bit of the chocolate frosting, then spread with half to two-thirds of the clementine cream. Carefully roll back up and trim each end. Transfer to a serving plate and cover with the rest of the chocolate frosting, using a round-bladed knife to stripe the surface. Scatter with the sugared clementine peel and silver balls and/or stars, if you like. Serve with remaining clementine cream."}
{"text": " Heat oven to 160C/140C fan/gas 3. Line a 12-hole muffin tin with paper cases. Gently melt the butter, chocolate, sugar and 100ml hot water together in a large saucepan, stirring occasionally. Set aside to cool a little while you weigh the other ingredients.\n Stir the eggs and vanilla into the chocolate mixture. Put the flour in a large mixing bowl, and stir in the chocolate mixture until smooth. Spoon into the cases until just over three-quarters full. Bake on a low shelf in the oven for 20-22 mins. Leave to cool.\n To make the icing, melt the chocolate in a heatproof bowl over a pan of barely simmering water. Once melted, turn off the heat, stir in the double cream, sift in the icing sugar and mix well. When spreadable, top each cake with some icing.\n Position a milk chocolate button on top of each cake, then 2 white chocolate buttons above it. Use a little icing as glue to stick a red Smartie onto the milk chocolate button for a nose. Then use your icing pens to draw black dots on the white buttons for eyes. Stick 2 pretzel top halves into the top of each cake for antlers, and stick the bottom half of a pretzel under the Smartie for a mouth. "}
