{"text": "Put the apples in a pan with 100ml water and cook gently until almost softened. Turn up the heat. Add the cranberries, mixed spice and 3 tbsp of the caster or granulated sugar and bubble until saucy. \nTip the oats, milk, vanilla and remaining sugar into a big saucepan. Bring to the boil, stirring constantly, and simmer for 4-5 mins until creamy. Divide between 6 bowls and top with the warm or cold fruit mixture."}
{"text": "Stir together the butter, sugar, egg yolk and vanilla using a wooden spoon. Stir in the flour – you might need to get your hands in at the end. Tip onto a floured surface and bring together into a smooth dough.\nRoll out the dough – half at a time if you like – and stamp out 5-6cm stars. Keep re-rolling trimmings, and you should get about 40 biscuits. Cut out a thin triangle about 2cm long and ½cm wide at one of the indents of each star. Arrange on trays lined with baking parchment, cover with cling film and chill for 30 mins.\nHeat oven to 200C/180C fan/ gas 6. Remove cling film and bake the biscuits for 8-12 mins until golden. Cool, then dust with icing sugar. \nMix the coffee and Kahlúa in a Martini glass. Slowly pour in the double cream over the back of a teaspoon so that it gently settles on the top of the coffee. Dust with a little cocoa and serve with a star biscuit slotted onto the glass and a plateful of Mint chocolate truffles, if you like (see 'Goes well with')."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Heat oil in a roasting tin on top of the stove, then throw in the vegetables and fry for 5-8 mins until they begin to brown. Place the tray in the oven for 40-50 mins, shaking pan occasionally until golden brown and soft.\nStir the honey, pepper and a sprinkling of salt into the vegetables, then return to the oven for 5 mins to warm the honey through."}
{"text": "Roll the pastry to a 3mm-thick round on a lightly floured surface and cut a 24cm circle, using a plate as a guide. Lightly prick all over with a fork, wrap in cling film on a baking sheet and freeze while preparing the apples.\nHeat oven to 180C/160C fan/gas 4. Peel, quarter and core the apples. Put the sugar in a flameproof 20cm ceramic tatin dish or a 20cm ovenproof heavy-based frying pan and place over a medium-high heat. Cook the sugar for 5-7 mins to a dark amber caramel syrup that’s starting to smoke, then turn off the heat and stir in the 60g diced chilled butter.\nTo assemble the tarte tatin, arrange the apple quarters very tightly in a circle around the edge of the dish first, rounded-side down, then fill in the middle in a similar fashion. Gently press with your hands to ensure there are no gaps. Brush the fruit with the melted butter.\nBake in the oven for 30 mins, then remove and place the disc of frozen puff pastry on top – it will quickly defrost. Tuck the edges down the inside of the dish and, with a knife, prick a few holes in the pastry to allow steam to escape. Bake for a further 40-45 mins until the pastry is golden brown and crisp.\nAllow to cool to room temperature for 1 hr before running a knife around the edge of the dish and inverting it onto a large serving plate that is deep enough to contain the juices. Serve with crème fraîche or vanilla ice cream."}
{"text": "Butter and line a 20cm square tin with non-stick baking parchment. In a large bowl, combine the biscuits and nuts, halving any larger nuts. Melt the chocolate, butter and golden syrup in a bowl set over a pan of simmering water, stirring occasionally until smooth and glossy, then pour this over the biscuit and nut mixture.\nTip the mixture into the tin, then flatten lightly – it doesn’t need to be completely smooth. Chill for at least 2 hrs or overnight before cutting into squares."}
{"text": "Fry bacon in a hot pan without any oil for 10 mins until crisp. Add chestnuts and fry until they are beginning to colour and coated in the fat. Pour away excess fat, then tip bacon and chestnuts into a bowl to cool.\nBeat butter to soften with a spatula, then stir in the bacon and chestnuts. Season with black pepper, then store in fridge. This can be made up to 3 days ahead or frozen for 1 month. Defrost in fridge overnight.\nTo serve, place sprouts in a microwaveable bowl, pour in 100ml water, cover with cling film and pierce a few times. Microwave on High (850W) for 16-18 mins, stirring twice during cooking, or cook in a pan of boiling water for 5 mins. Drain and tip into a warm serving dish, then dot the butter over to melt. Toss through and serve."}
{"text": "Boil the potatoes in salted water for 20 mins until just cooked, drain, then cool.\nCut the potatoes into chunks, then throw into a bowl with the shallots, capers and cornichons, if using. Add enough mayonnaise to bind, then mix together the olive oil and vinegar and add just enough to give a little sharpness to the salad. Stir in the finely chopped parsley and serve."}
{"text": "Make the mincemeat by mixing all the ingredients together in a large bowl. Set aside for 30 minutes so the fruit absorbs some of the liquid. Make the pastry in a large bowl or food processor by blending the butter into the flour until the mixture resembles breadcrumbs. Stir in the sugar and orange zest and then 2 tbsp water. Bring the mixture together with your hands, adding a few more drops of water if it feels a little dry. Preheat the oven to fan 160C/ conventional 180C/gas 4.\nRoll out half the pastry (keep the other half wrapped in the fridge) on a lightly floured surface. You want the pastry to be very thin, so it is crisp when cooked. Cut out 12 circles of pastry with a plain 6cm cutter (you will need to re-roll the pastry a couple of times) and use to line a 12-hole, non-stick mini muffin tin. It is quite a soft pastry, so any little gaps that form as you are lining the holes can easily be patched up. Chill while you make the topping.\nIn a small bowl, make the crumble topping by rubbing the butter into the flour until the mixture looks like breadcrumbs. Stir in the sugar and almonds. With a teaspoon, fill each pastry case with mincemeat, gently pressing it down to leave room for the topping. Sprinkle the topping over each pie, place the tin on a baking tray and bake for 20 minutes.\nLeave the pies to cool in the tin before taking them out carefully. They are fragile when hot, so use a small knife to help lift them out. Unless you have two mini muffin tins, repeat the process with the second batch of pastry, filling and topping. Eat the mini mince pies warm or cold, lightly dusted with icing sugar."}
{"text": "In a large serving bowl, throw together the salad leaves. Push a quarter of the pomegranate seeds through a fine sieve over a bowl to catch the juice.\nStir the olive oil, vinegar and some seasoning into the juice to make a dressing, then add to the leaves with the remaining seeds and feta.\nToss and serve immediately."}
{"text": "Heat the oil in a large pan. Add the onion and garlic, and cook for 5 mins. Add the squash, sage and rice, and cook for a further 2 mins.\nPour in the stock and cook, stirring regularly, for 15 mins. Add the chestnuts and cook for a further 5 mins or until the rice is tender and the stock has been absorbed.\nStir in the butter, parsley and Parmesan. Divide risotto between bowls, scatter with extra Parmesan, season and serve."}
{"text": "Trim the top and bottom of each potato so that they lie flat on both sides. Heat the oil in a large frying pan or flameproof casserole and fry the potatoes on both sides until dark golden, 10-15 mins.\nPoke in the garlic, thyme, rosemary, bay leaves and zest, then pour in enough stock to go halfway up the side of the potatoes. Simmer for 20-30 mins, then turn the potatoes and cook the other side for a further 20-30 mins, topping up with more stock if it evaporates. Continue cooking until the potatoes are really tender and most of the stock has gone. Season well and serve."}
{"text": "Cook the green beans in boiling water for 2-3 mins until just tender, then drain well and steam-dry for a min.\nMeanwhile, gently fry the garlic in the oil until pale golden – no further. Toss with the beans, season and serve."}
{"text": "Put the chocolate, cream and vanilla in a pan and heat very gently until melted. Cool, then chill for 90 mins until firm.\nUse a mini ice cream scoop or teaspoon to make 24 truffles, then dust with cocoa or grated white chocolate. Chill until ready to eat. You can make these 4 days ahead or they will freeze for 1 month. Thaw in a cool place and, if needed, dust with a little more cocoa."}
{"text": "Heat oven to 200C/180C fan/gas 6. Cut the squash lengthways into 8 long chunky pieces and put in a large roasting tin with the shallots. Toss in a little oil, season and roast for 20 mins. Add the pecans and roast for 10 mins more, or until the squash is cooked but still firm.\nLeave the squash to cool completely, but tip the nuts and shallots into a non-stick pan. Add the maple syrup, balsamic vinegar and plenty of seasoning, and stir over the heat until the shallots start to caramelise. Leave to cool.\nRoll out the pastry on a lightly floured surface to a rectangle about 32 x 38cm. Trim 2cm from one of the long edges and set aside. Transfer the pastry to a baking tray. Place 4 of the pieces of squash down the longest length in the middle to make a rectangular block, keeping a generous border of pastry all the way round. Place another 2 pieces of squash on top. Trim the remaining 2 pieces and put crossways at the end. Scatter over the sage and blue cheese, then top with the shallots and pecans. Lightly press to compact everything together.\nBrush round the pastry edges with the egg, then draw the 2 long edges up to meet and pinch together to seal – as you would a Cornish pasty. Tuck under the pastry at both ends, then brush all over with egg. Cut leaf shapes from the pastry trimmings and use to decorate the top of the Wellington. Glaze again and make a couple of small air holes with the point of a knife.\n Open-freeze on a baking tray until solid, then wrap in cling film then foil. It will keep for 2 months. \n, heat oven to 200C/180C fan/gas 6 and put a baking tray in to heat up. Unwrap the Wellington and place on the hot tray. Bake for 30 mins. Cover lightly with foil and bake for 35-40 mins more, taking off the foil for the final 10 mins. Leave to settle for 10 mins before thickly slicing, or the cheese will be too melty and run out. (If cooking from fresh, chill the Wellington for at least 30 mins before cooking – it then needs only 30-40 mins in the oven.)"}
{"text": "Heat oven to 180C/fan 160C/gas 4. Heat the oil in a large pan or wok, add onions, then fry for 5 mins until golden. Add pumpkin, parsnips and garlic and cook for a further 3 mins. Stir in beans, tomatoes, wine, stock, thyme, sugar and plenty of seasoning. Bring to the boil, then transfer to a large casserole dish, pressing the beans and vegetables beneath the liquid.\nSprinkle the top with breadcrumbs and grated cheese. Cover, then cook for 40 mins. Uncover, stir well and cook for a further 40 mins. Serve with garlic bread and stir-fried cabbage."}
{"text": "Heat oven to 200C/180C fan/gas 6. Melt the butter in a small pan, then allow to cool slightly. Tip all the dry ingredients into a bowl, with ½ tsp salt, then pour in the butter. Add 5-6 tbsp boiling water and combine to make a firm dough.\nTurn out the dough onto a lightly floured surface, then roll out until about 0.5cm thick. Cut into small squares, then bake for 12-15 mins until golden. Leave to cool for a few mins, then transfer to a wire rack and cool completely."}
{"text": "Mix Disaronno, orange juice and sparkling wine in a jug. Add a strip orange zest to each glass, if you like."}
{"text": "Put the cauliflower and onions in a large pan, then pour in enough milk to almost cover. Bring to a simmer and cook for 15-20 mins, or until the cauliflower is completely tender.\nUsing a slotted spoon, transfer the cauliflower and onion to a blender with a ladleful of milk, and blitz until smoothly puréed. Add more milk if you like, mixing to soften to your preferred consistency. Season with salt and pepper. (Can be made to this stage a day ahead. Keep chilled and reheat before serving.) Serve with a knob of butter melting on top."}
{"text": "Heat oven to 190C/fan 170C/gas 5. Butter a large (approx 30cm x 40cm) Swiss roll tin and line the base and sides with baking parchment. Lightly butter the parchment, dust with the plain flour and tip out any excess.\nSift the self-raising flour, baking powder and cocoa into a bowl and mix in the ground almonds. Put the eggs and caster sugar in a large mixing bowl and beat, using an electric hand-whisk or tabletop mixer, for 5-10 mins until pale, thick and trebled in volume. The mixture should leave a trail when the beaters are lifted out.\nFold the dry ingredients into the egg mixture using a large metal spoon. Pour into the prepared tin, then tip the tin from side to side until it is covered in an even layer of batter and the corners are filled. Bake on the middle shelf of the oven for 12-15 mins or until firm to the touch. Meanwhile, lay a sheet of baking parchment on the work surface and sprinkle with caster sugar.\nAllow the sponge to cool for 1 min before turning out onto the sugared paper. Peel away the backing paper and, with the short side facing you, roll the sponge away from you so that the sugary parchment is rolled inside the roulade. This will help you to fill and roll it later. Set aside until completely cold.\nTo make the filling, beat the mascarpone with the orange zest. Unroll the sponge, discard the inside paper and evenly spread the mascarpone over, leaving a finger-width border around the edges. Cover with the cranberry sauce. Using the outside baking paper to help, roll the sponge away from you as tightly as possible. Transfer to a serving platter, cover loosely and chill while you prepare the frosting.\nFor the frosting, melt the chocolate in a heatproof bowl over a pan of just-simmering water, or microwave on High for 2 mins, stirring halfway through. Set aside for about 10 mins until cooled, but still soft.\nMeanwhile, beat the butter and icing sugar together until pale and smooth. Pour in the chocolate and stir thoroughly to combine. Set aside for 20 mins to firm up slightly before using a palette knife to cover the roulade in frosting. Mark with a fork to create a log effect. To decorate, arrange the cranberries and bay leaves along the length of the log. Dust with a little icing sugar just before serving. Cut into slices, removing cranberries and bay leaves to serve. The roulade can be made up to a day ahead. Take it out of the fridge at least 30 mins before you want to serve it, to allow the filling and icing to soften."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Butter and line a deep 20cm loose-bottom cake tin. Beat all the cake ingredients together until smooth, pour into the tin, then smooth the top. Bake for 40-45 mins until golden and risen. Cool completely on a rack; once cold, put into the fridge. Meanwhile, prepare the custard – whisk the cornflour and 1 tbsp icing sugar into the remaining coconut cream until smooth. Bring the custard to the boil, then whisk in the coconut mix. Keep whisking until it’s boiling and fairly thick. Tip into a bowl, cover with cling film straight away, then cool.\nMix the Malibu, lime zest and juice and 2 tbsp icing sugar. Trim off the top of the cake if it’s domed, then cut into three horizontally using a bread knife or serrated knife.\nLine the cleaned cake tin with plenty of cling film (a little oil helps it to stick), then put a circle of cake back in the bottom. Sprinkle with some of the Malibu mix. Crush 100g of the raspberries and mix well into the jam, then fold in 100g whole raspberries. Spoon onto the sponge in the tin but don’t go right to the edges.\nTop with the second piece of cake, sprinkle with more of the Malibu mix, then spoon the custard over and spread it out. Top with the final layer of cake, sprinkle with remaining Malibu, then chill for at least 4 hrs, covered with cling film, to let the layers firm up and the flavours mingle.\nOnce set, remove the cake from the tin, then slide it onto a serving plate. Softly whip the cream with the final 1 tbsp icing sugar, then spread over top of the cake. Scatter with the remaining whole raspberries and decorate with fresh shredded coconut, if you like."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the potatoes in the stuffing mix, tip into a roasting tin, drizzle over the olive oil, season and roast for 30 mins.\nCut the chicken breasts in half horizontally, carefully cutting halfway through, and open them out like a book. Spread 1 tbsp Boursin cheese and ½ tbsp cranberry inside each chicken breast. Close the breasts, then wrap each in a slice of Parma ham. Line a baking tray with foil and put the chicken breasts on top. Once the potatoes have been cooking for 10 mins, put the chicken tray in and cook for the remaining 20 mins.\nRemove the chicken and potatoes, and toss the potatoes with the lemon juice and rocket. Serve the oozing chicken breasts with the potatoes on the side."}
{"text": "Heat oven to 220C/200C fan/gas 7. You can do this while the turkey is resting. Place the carrots on a large baking tray, toss with the oil and plenty of salt, then spread out in an even layer. Cover with foil and roast for 10 mins, then remove the foil and cook for 20 mins more.\nDrizzle with the syrup and scatter over the nuts, then return to the oven for a final 10 mins until the carrots are soft and golden and the pecans toasted."}
{"text": "Wrap the base of a loose-bottomed, 20cm non-stick cake tin with cling film, twizzling it into a knot on the underside, then slot base back in the tin. Cut the salmon into pieces about 15cm long and make a neat layer of slices, presentation side down, on the base of the tin. Start at the outside and push the slices right to the edge; after going all round the edge, fill in the centre with straight pieces of salmon.\nMash the cream cheese until smooth (a rubber spatula is good for this), working in the mignonette pepper and a pinch of salt at the same time. Pour in two-thirds of the cream, a little at a time, and keep stirring and beating until a smooth, lightly whipped cream consistency is achieved. Now work in the lemon juice. If slightly too firm (it should be spreadable), work in the remaining cream and then recheck for seasoning.\nDollop about a quarter of the cream cheese in the centre of the salmon and spread to the edge with the spatula or a palette knife; slowly turn the tin to get an even thickness of about 3mm. Top this with a salmon layer, continuing until both salmon and cheese have been used, finishing with a salmon layer. Press the top down with your hands. Stretch cling film over and refrigerate for at least four hours – or preferably overnight.\nMake the dressing. Simmer the shallots, sugar and brandy in a small pan until almost dry and a deep brown colour – about 5 minutes. Tip into a bowl and leave to cool. Whisk the crème fraîche in a bowl with the mustard and lime juice, and whisk in the cold shallots.Whisk in the olive oil, trickling it slowly as if making mayonnaise. Season, cover the bowl with cling film and chill in the fridge for 2 hours or overnight.\nTo turn the salmon gateau out, dip a knife into a jug of warm water and run it carefully around the inside of the tin, between the gateau and the sides, to release the salmon from the tin. Invert a flat serving plate or board on top, then turn the gateau out upside down and lift off the tin and the cling-filmed base. You will now be left with a perfectly flat top to the salmon-layered gateau.\nThe gateau is best cut into wedges while set firm, then left to reach room temperature for 20-30 minutes before serving – it will soften slightly and have more flavour being less cold. Just before serving, chop the dill and whisk it into the dressing, which is best served straight from the fridge. Serve the gateau with watercress sprigs drizzled with olive oil and lime wedges for squeezing. Serve the dressing in a jug."}
{"text": "To make the pastry, put the flour, butter and cayenne pepper into a food processor, then whizz into fine breadcrumbs. sprinkle the egg and water mixture onto the flour and pulse again until the mixture begins to come together. Tip the mixture onto a board, then gently squeeze the pastry until it begins to come together in a ball, adding more water if it feels dry. Divide the mixture in half, roll each piece into a 12 x 30cm rectangle and slip onto a baking sheet. Do not chill.\nHeat oven to 200C/fan 180C/gas 6. Mix the filling ingredients together, except one egg yolk, which you need for glazing, in a food processor. Divide in two and roll each into a 30cm-long sausage shape. Lay a cheese sausage on one side of the pastry. Brush the sausage and pastry with egg yolk and fold the pastry over the top to encase the sausage. Seal the two edges, trim the ends, then cut into 2cm pieces. Arrange on a baking sheet and chill for 30 mins.\nBrush the rolls with a little more egg yolk, place herbs on top, if you like, then bake for 12-15 mins until golden brown."}
{"text": "Simmer the apple juice with the strips of orange peel, cinnamon stick and cloves for about 5-10 mins until all the flavours have infused. Sweeten to taste.\nServe each drink with a little orange peel and a piece of cinnamon stick, if you like."}
{"text": "Heat oven to 220C/fan 200C/gas 7. Peel the potatoes and place them in a pan of cold, salted water. Bring to the boil, simmer for 3 mins and drain. When cool enough to handle, slice a few very neatly. Coat the bottom of a round, ovenproof, non-stick pan with butter, then place a sprig of thyme in the middle. Cover with a slice of potato in the middle, then arrange the rest of the slices over the base of the pan, overlapping the slices in concentric circles. Slice the rest of the potatoes and tip into a bowl, then pour over the rest of the butter, the nutmeg and the thyme leaves and season with salt and pepper. Toss everything together, then tip the seasoned potatoes over the arranged slices and press down gently to flatten. The potato cake can be prepared up to a day ahead and kept covered in the fridge.\nCook the cake in the oven below the beef. Every now and then, remove it, press it down with a fish slice and drizzle the surface with a little olive oil. Cook for 1hr-1hr 15mins, until the sides look brown and crispy. Carefully invert the cake onto a serving dish or board, scatter with sea salt and serve cut into wedges."}
{"text": "Firstly, dry the venison with kitchen paper, then season well. Heat the oil in a frying pan and sear the meat all over for about 8 mins. Brush with mustard, leave to cool, then chill for 20 mins. Reserve any juices for the gravy.\nMelt the butter and soften the shallot and garlic. Add the mushrooms, herbs and seasoning, and cook for 10 mins until you have a paste-like mixture. Add the brandy and cook until it’s evaporated. Leave to cool.\nOverlap 2-3 sheets of cling film on a clean surface and lay the prosciutto in 2 rows, slightly overlapping each slice. Spread the cooled mushroom paste all over the prosciutto, creating a thin, even layer.\nPlace the fillet in the centre of the mushroom mixture. Using the edge of the cling film, carefully draw the layer of prosciutto and mushroom around the meat.\nRoll into a sausage shape, twisting the ends of the cling film as you do, to form a tight log. Chill for 30 mins to firm up.\nOn a lightly floured surface, roll the pastry to a rectangle a little larger than a magazine, and trim the edges to neaten.\nCarefully unwrap the prosciutto parcel and lay in the middle of the pastry.\nFold over the bottom half of the pastry. Lightly brush the rest of the sheet with beaten egg.\nRoll the whole thing around the meat to encase. Neatly fold under the shorter edges to create a parcel.\nTransfer to a baking sheet and, using your hands, smooth the pastry around the meat, pressing it firmly to avoid any air being trapped. Brush the pastry all over with beaten egg yolk.\nChill for at least 30 mins or up to 24 hrs. Then, using the back of a knife, mark the pastry, being careful not to cut all the way through. Heat oven to 220C/200C fan/gas 7.\nLightly oil a non-stick baking tray and heat until hot. Put the Wellington on the tray and bake for 30 mins (35 mins for well done). Remove from oven, brush with extra egg and rest for 20 mins.\nTo make venison gravy, melt a large knob of butter in a medium pan, add 1 finely chopped shallot, 1 crushed garlic clove and 1 thyme sprig, and cook until soft. Add 1 tbsp flour, brown for about 1 min, then pour in 250ml Port and reduce by two-thirds. Add 400ml beef stock and any reserved juices from the venison, then reduce again by two-thirds until syrupy. Season, add 1 tbsp redcurrant jelly, if you like, and strain before serving. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Peel the beetroot and cut each into 8 wedges. Cut the onions and butternut squash into roughly the same size. Spread out in a large roasting tin. Mix the vinegar and sugar until dissolved, then whisk in the oil. Pour over the vegetables, toss and roast for 40-45 mins until charred and soft, stirring halfway through cooking.\nTo make the horseradish cream, mix together the soured cream, horseradish, lemon juice and some seasoning.\nTo serve, put the roasted veg in a large bowl or on a platter, followed by the watercress, then drizzle over the horseradish cream. Serve warm or cold."}
{"text": "Mix most of the cheese with the ham or gammon, egg yolks, mustard, herbs and some seasoning. Whisk egg whites until stiff. Using a rubber spatula, gently fold the whites into the yolk mixture until evenly mixed.\nHeat a splash of olive oil in a small non-stick frying pan. Pour mixture into the pan and cook for 4 mins until the underside is set and browned. Sprinkle over the remaining cheese and grill for 2 mins until cheese is bubbling and golden."}
{"text": "First, lightly pickle the radish slices by putting them in a small bowl with the vinegar for at least 30 mins. Meanwhile, mix the horseradish with the whipped cream in a small bowl and season with salt.\nLay 100g of the long salmon slices on 4 rectangular plates in a neat rectangle shape. Put 3 discs of beetroot on top of the salmon in different places. Arrange about 6 slices of the pickled radish around the salmon too. Add a few orange segments and some of the preserved lemon.\nNext, shape the horseradish into quenelles by using 2 teaspoons to scoop and roll it. Put 3 quenelles on each plate. Finally, scatter with the pea shoots, and drizzle over a little oil before serving."}
{"text": "Trim the carrots and cook in boiling water for 4-6 mins until just tender, then drain. Melt the butter in a large frying pan, add the drained carrots, then fry over a high heat for 1 min. Pour over the orange juice and cook for a further 2-3 mins, bubbling the sauce and stirring to thoroughly coat the carrots. Finally, stir in the chopped parsley and serve."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put a baking tray on the top shelf to heat up. Grease 4 x 150ml ramekins with butter and dust the insides with caster sugar to coat.\nWhisk the egg whites in a bowl until stiff. Add 1 tbsp of the sugar and whisk for 30 secs more until thick and glossy. In a separate bowl, scoop the pulp from 1 passion fruit into the custard, then fold in the whisked egg white. Spoon the mixture into the prepared ramekins and put on the hot baking tray. Bake for 15 mins until risen and golden on top.\nWhile the soufflés are cooking, make the sauce. Scoop the remaining passion fruit pulp into a saucepan, add the remaining sugar and simmer gently for 5 mins. Finally add a knob of butter and stir until melted. Pass through a sieve and serve in a jug with the hot soufflés as soon as they come out of the oven. Let your guests break a hole in the centre of their soufflé, then pour in the sauce."}
{"text": "Put a pan of salted water on to boil and cook the chard stalks for 2 mins until tender. Remove the stalks with a slotted spoon. Add the leaves and cook for 30 secs-1 min. Drain and reserve 200ml of the cooking water. In a saucepan, bring the cream to a simmer, then add the garlic and cook for 2 mins. Whisk in the water, egg yolks and 140g Parmesan, and let them all melt together and bubble for 3 mins.\nHeat oven to 180C/160C fan/gas 4. Add the chard to the saucepan, season, mix well and tip into a greased baking dish. Top with the breadcrumbs, thyme and remaining Parmesan. Cover with foil and bake for 15 mins. Remove\u2028the foil and cook for 15 mins more\u2028 until golden and bubbling."}
{"text": "To make the custard, put the milk, cream and caster sugar in a saucepan and bring to the boil. Meanwhile, set a glass bowl over a pan of gently simmering water. Snap the white chocolate into the bowl and leave to melt. Put the egg yolks in a separate bowl.\nOnce the cream mixture is up to the boil, pour into the bowl with the yolks, \n continually. Return the mixture to the pan and cook over a gentle heat, whisking until the mixture reaches 85C on a digital thermometer, or the custard has thickened enough to coat the back of a spoon and you can draw a line through it with your fingertip. Pour the custard through a sieve into the melted chocolate and quickly whisk to combine. Pour the white custard into a bowl, cover with cling film and chill in the fridge overnight.\nThe next day, crumble the cake into the bottom of a trifle bowl or individual glasses and pour over the rum and half the passion fruit pulp. Leave to soak for 10 mins, then spoon over the white chocolate custard. Put in the fridge while you whisk the cream.\nWhisk the cream, vanilla, sugar and lime zest to soft peaks, then spoon into a piping bag with a star nozzle. Pipe on top of the custard, then top with the remaining passion fruit, coconut and a grating of white chocolate. Chill until needed. Can be made a day ahead and decorated just before serving."}
{"text": "Heat oven to 200C/180C fan/gas 6 and lightly butter and flour a 12 hole fairy cake tin. Lay a sheet of puff pastry on a floured surface and use a rolling pin to roll it out a little, so it's 5 cm bigger than your fairy cake tin. \nLay the sheet onto the tin, pushing it into the holes. Spoon 1½ tbsp of mincemeat into each hole, then use some of the beaten egg to brush around all of the holes. Lay the other sheet of pastry on top and press to seal. Lightly dust the top with flour. \nUse an 8cm cookie cutter to cut circles around each of the holes, peeling away the excess puff pastry. You will be left with 12 flat-topped pies. Place a flat baking tray over the pies and flip the fairy cake tin upside-down. The pies should slip out of the tin, leaving you with 12 puff pies on a baking tray. \nPress each one around the edges to make sure they're well sealed. Brush them with more of the beaten egg, sprinkle with demerara sugar. Bake for 20 mins, until risen and golden. Allow to cool a little, then serve warm."}
{"text": "Preheat the oven to 180C/ 160 fan/ gas mark 4 and two baking trays with baking parchment.\nPut the butter, sugar and golden syrup in a saucepan and heat gently until the butter and sugar have melted. Put the flour and ginger in a bowl and make a well in the centre. Add the lemon zest and juice and the brandy. Pour in the butter mixture and gradually beat it into the flour until the mixture is thoroughly combined.\nUse a teaspoon to dollop 3 - 4 heaps of mixture onto the prepared baking tray. A heaped tsp is enough for a cigar and two heaped teaspoons is enough for a basket. Space them well apart as they will spread. Cook in batches for 8 – 10 mins until set, golden brown and lacy in appearance. Do not allow to go too dark as they will taste bitter. Leave for a minute before shaping – the snaps should still be pliable but set enough to move without tearing.\nYou can shape the brandy snaps into cigars or baskets. To make cigars, oil the handle of a wooden spoon and wrap the brandy snap around. If you have a long handle or more than one spoon, you can do a few at a time. The base of the biscuits should be the bit that touches the spoon so that the top ‘presentation’ side of the biscuit is seen. Transfer to a cooling rack. To make baskets, oil the base of small ramekins or narrow tumblers and drape the biscuits over them. The top of the biscuit should touch the base this time as this is the bit you’ll see.\nPipe whipped cream into the cigars or use the baskets or cones for ice cream and berries. If not using straightway, store in an airtight container for up to 5 days."}
{"text": "Blanch the carrot in boiling water for 2 mins, then drain and cool. Whisk together the honey, lemon and oil and season to taste. To serve, toss the carrots in a bowl with the chicory and rocket. Pour the dressing over, toss well. Pile in a serving bowl, scatter with pinenuts."}
{"text": "To make the rhubarb syrup, put the caster sugar in a saucepan with 75ml water. Heat very gently, so the sugar disappears but the water doesn’t bubble. Tip in the chopped rhubarb, cover with a tight-fitting lid and increase the heat a little so it begins to boil. Simmer, covered, for about 5 mins until the rhubarb is very tender but not disintegrating.\nTurn off the heat, and tip the pan’s contents into a fine sieve over a bowl. Use a wooden spoon to gently squeeze the rhubarb so that you get all the juices, but no pulp. Tip back into the pan and boil rapidly for a few mins until just syrupy. Pour into a jug – you should have about 125ml. Leave to cool completely. \nChill 4 cocktail glasses with ice or in your freezer. Shake the vodka and 100ml of the rhubarb syrup together with ice until mixed and chilled down. Make small shreds of rhubarb using a vegetable peeler and place into iced water – this will make them curl up.\nIn a separate jug, whisk together the advocaat and lemonade with more ice to lighten. Divide the vodka and rhubarb mixture between the glasses, straining through a small sieve to catch the ice.\nCarefully pour 25ml of your advocaat mixture into each glass over an upsidedown spoon (the mixture should float on the surface of the vodka syrup mixture). Drain the rhubarb shreds well and use to garnish your cocktails."}
{"text": "Heat oven to 180C/160C fan/gas 4. Sit the ham in a large roasting tin and scatter all the veg, herbs and spices around it. Pour over 750ml boiling water, then cover with a couple of layers of extra-wide foil, sealing around the edges of the tin to make a tent that will trap the steam. Roast for 4 hrs, reducing the temperature to 160C/140C fan/ gas 3 halfway through. Remove the foil, then leave the ham to rest in the tin for at least 30 mins or until it is cool enough to handle. \nMeanwhile, tip all the glaze ingredients into a small pan and bring to a simmer, stirring until everything is mixed. Set aside.\nReheat oven to 180C/160C fan/gas 4. Lift the ham into a clean roasting tin – reserve the stock for soup. Cut off the skin, leaving a layer of fat all over, then use a knife to score the fat with a diamond criss-cross pattern. Roast for 10 mins to allow some of the fat to render, then use a pastry brush to paint the ham evenly with the glaze. Roast the ham for 15 mins more, then add a second layer of glaze and roast for another 15 mins until sticky and caramelised. Rest the ham for another 30 mins before serving in thick slices. You should have leftovers to enjoy cold over the next few days."}
{"text": "Heat a griddle pan. Rub the steak with the olive oil, season, then cook for 2-4 mins on each side or until done to your liking. Put the steak on a plate to rest.\nPut the roll halves cut-side down in the pan for 2 mins to soak up the meat juices and toast until golden brown. Spread the toasted side with the mustard and pile the watercress on top.\nCut the steak in half, sit on top of the watercress, then crumble over the stilton. Drizzle with a splash of balsamic vinegar, tip over any steak resting juices and serve."}
{"text": "Boil the leeks in salted water for 6 mins until tender, but still holding their shape. Drain, leaving a little water in the pan, then return the leeks to the pan. Place over a low heat and stir in the peas and butter, cooking until the butter has melted and the peas are hot. Add the lemon juice, season with salt and pepper and serve straight away."}
{"text": "Remove any giblets from the turkey and save for stock, if you are making your own (see 'Tip'). Remove the bird from the fridge 1 hr before cooking to allow it to come to room temperature. Wipe the turkey inside and out with kitchen paper.\nHeat oven to 220C/200C fan/gas 7. Starting at the neck-end of the bird, carefully push your fingers between the skin and flesh on the breast, loosening the skin. Mix the butter, lemon zest, herbs and garlic together and season. Push the flavoured butter under the skin and spread over the flesh. Smooth the skin back over the breast.\nYou can now stuff the neck-end of the bird with the stuffing, if you like, and secure the skin underneath with a skewer. Weigh the turkey and calculate the cooking time – it will need 40 mins for every 1kg.\nTransfer the bird to a roasting tin, cover loosely with foil and place in the middle of the oven. Cook for 20 mins, then reduce the temperature to 180C/160C fan/gas 4 for the rest of the cooking time. Remove the foil for the last 30 mins. Check if the turkey is cooked by piercing the thickest part of the thigh with a skewer. If the juices run clear, it’s cooked. If they are pink, return it to the oven for another 15 mins, then test again. If using a meat thermometer, it should read 80C for the thighs, and the breast should be 75C.\nRemove the cooked turkey from the tin, and place on a serving platter (use the tin to make the gravy – see 'Goes well with'). Cover with foil and leave to rest for 30-45 mins before carving."}
{"text": "Heat oven to 200C/180C fan/gas 6. For the glaze, mix the honey with the spices and lots of cracked pepper, then set aside. Remove all the fat from inside the bird and, using the point of a small \n or skewer, prick the skin all over, paying particular attention to the areas under the wings and around the legs. Sit the goose in an empty sink and slowly pour over a kettleful of boiling water. Repeat the process a few more times (the more the better) until the skin is tight and glossy. Leave the goose to cool, then pat dry with kitchen paper. \nSeason the inside of the goose and stuff with the onions, halved garlic bulb, rosemary and orange. Rub the goose all over with the oil and season generously with salt. Sit the goose on a \n in a large \n and tightly cover with a large piece of foil. Cook in the oven for 1 hr 30 mins.\nRemove from the oven, discard the foil and use oven gloves to lift the rack (and the goose) out of the roasting tin. Pour all the fat from the tin into a bowl and set aside. Scatter the potato slices in the roasting tin, season with salt and mix with a small drizzle of the fat. Sit the goose back in the tin – on top of the potatoes – and cover with foil, then roast for 1 hr. Remove the foil, then brush the goose all over with the honey glaze and return to the oven for 15 mins. Transfer the goose to a large board or platter to rest, uncovered, in a warmish place for 30 mins.\nCarefully pour away most of the fat from the potatoes. If your roasting tin is flameproof, finish browning the potatoes on top of the stove; if not, place the potatoes back in the oven until crisp and golden brown. Stir the parsley and the chopped garlic through the potatoes just before serving. Carve the goose at the table and serve with the potatoes. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Peel the shallots, cut in half lengthways and place in a single layer on a baking tray, cut-side up. Drizzle with the oil, season well and bake for 20-25 mins. Take the tray out of the oven and drizzle with the balsamic vinegar. Sprinkle with the sugar and return to the oven for 10 mins more or until golden brown and softened. Leave to stand for 10 mins.\nUnroll the pastry onto a work surface lightly dusted with flour and cut out 4 x 13cm discs (or 6 x 11cm discs if making for starters), using a bowl or saucer as a guide, if you like. Divide the shallots between 4 x 12cm non-stick, preferably loose-based mini cake tins (or 6 holes of 2 x 4-hole non-stick Yorkshire pudding tins), arranging cut-side down, nice and snugly. Scatter the chestnuts on top and press down lightly. Sprinkle with the thyme leaves and season. Place a disc of puff pastry over the shallots and chestnuts in each tin and ease down the sides using a round-bladed knife. Prick with a fork all over. Can be frozen at this point (see tip, below left) or covered with cling film and kept in the fridge for up to 8 hrs before baking.\nTo make the mushroom sauce, put the dried mushrooms in a measuring jug and cover with 200ml just-boiled water. Leave to stand for 20 mins. Drain in a sieve and reserve the soaking liquor. Put the mushrooms on a board and roughly chop. Heat the oil in a medium frying pan and fry the chestnut mushrooms over a high heat for 2-3 mins until lightly browned. Reduce the heat, stir in the butter and, as soon as it has melted, add the flour and the soaked mushrooms and cook for a few secs, stirring.\nSlowly add the mushroom liquor, taking care to avoid adding any gritty bits from the bottom of the jug, then add the madeira, stirring well between each addition. Bring the sauce to a simmer and cook for 2 mins, stirring. Adjust the seasoning to taste.\nHeat oven to 220C/200C fan/gas 7. Place the cake tins on a baking tray and bake the tatins for 20-25 mins or until the pastry is golden brown and risen. Leave to cool for 5 mins, then turn out onto warmed plates. If the shallots stick to the tin, gently ease them out with a round-bladed knife and rearrange them on the pastry. While the tatins are resting, gently warm the sauce. Spoon the mushrooms on top of each tatin and allow the sauce to drizzle onto the plates. Garnish with more thyme and serve with the vegetables."}
{"text": "Lightly grease and line a 20cm springform cake tin. To make the base, put the biscuits and butter in a food processor, pulse into fine crumbs, then tip into the tin. Spread evenly over the base and press down firmly with the back of a spoon. Put the tin in the freezer and leave to set for 30 mins.\nPut a large piece of foil (extra-wide foil if possible) on the work surface, or criss-cross two pieces of small foil. Place the cake tin in the centre of the foil and bring up the sides to create a foil bowl around the cheesecake. Place in a medium-sized roasting tin.\nHeat oven to 180C/160C fan/gas 4. To make the filling, put the eggs and egg yolks in a food processor and blitz until well combined. Add the cheese, cream, sugar, orange zest and orange liqueur to the food processor and pulse until only just combined. Pour the cheesecake filling gently onto the chilled base.\nAdd enough just-boiled water to the roasting tin to rise roughly 2cm up the sides. Carefully place the roasting tin in the centre of the oven and bake for about 1 hr 15 mins. The cheesecake is ready when it is very lightly browned and only just set.\nTake out of the oven and sprinkle with the grated chocolate. Leave to cool in the water bath for 15 mins. Lift the cake tin from the water and leave to cool for a further 1 hr. Cover with cling film and chill the cheesecake overnight before serving.\nTo serve, run a round-bladed knife around the cheesecake and carefully release it from the tin. Using a palette knife, slide the cheesecake onto a flat serving plate or cake stand and cut into wedges to serve."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Cut the pork into thick slices, about 3cm thick. Coarsely crush the peppercorns and sprinkle over the pork along with the thyme and some salt and pepper.\nHeat 2 tbsp oil in a large flameproof casserole, then add the onions and fry until lightly browned. Add the cabbage and stir well, then add the apples and wine and cook until the cabbage starts to soften. Finally, add the chestnuts, 1 tbsp of the jelly, salt and pepper, and bring to the boil. Cover and simmer for 5 mins.\nMeanwhile, heat 1 tbsp of the oil in a frying pan, add the pork and fry on both sides until browned, then stir in the remaining tbsp of the jelly. Cook for a few mins until the pork is deeply browned and glistening. Arrange the pork over the cabbage. Pour a little boiling water into the frying pan, stir well to lift up all the pan juices, then pour over the pork.\nCover the pan tightly, then cook in the oven for 1¼-1½ hrs until the pork is very tender."}
{"text": "Tip the cabbage and red onion into a bowl and season with 2 tsp sea salt, then toss together. Set aside for to cure for 20 mins.\nMeanwhile, pour 200ml water into a saucepan and add the chilli, juniper, allspice, vinegar and sugar, then bring to the boil. Tip the cured cabbage into a colander and rinse once under cold water to remove any excess salt. Pack into a large, clean container and pour over the warmed spiced pickling liquid. Put on the lid and leave in the fridge until needed. Can be made up to a week ahead.\nWhen you are ready to serve, drain the pickling liquid from the cabbage and discard the dried chilli. Bring up to room temperature, then stir through the nuts, dill and sliced apple. Spoon the salad into a large salad bowl to serve."}
{"text": "Heat the oil in a large pan, add the onion and cook for a few mins until starting to soften. Add the remaining ingredients, increase the heat and stir to dissolve the sugar. Reduce the heat and simmer, uncovered, until most of the liquid has evaporated and the peaches have softened – this will take about 45 mins. Meanwhile, sterilise your jars (see tip, below).\nTransfer the chutney to the jars, seal and leave to cool before eating. The chutney can be stored in a cool dry place for up to 1 year. "}
{"text": "Drain the chillies and discard the seeds and stalks. Roughly chop and put in the small bowl of a food processor with the garlic, 2 tbsp of the oil, the red wine vinegar, cumin and oregano. Whizz to a paste.\nPut the meat in a bowl or resealable food bag, pour on the paste and rub all over the meat. Leave to marinate overnight (or for at least 4 hrs).\nHeat oven to 160C/140C fan/gas 3. Heat the remaining oil in a large, lidded flameproof casserole dish and cook the onions for a few mins until beginning to soften. Add the meat and all the paste to the dish and cook for about 5 mins, turning the meat until browned all over. Pour in the tomatoes and add the cinnamon. Stir everything together, then add 100ml water and bring to the boil. Put on the lid, transfer to the oven and cook for 1 hr 45 mins.\nRemove the lid and stir in the red peppers, chocolate, sugar and all the beans. Return to the oven for another 20 mins. To serve, stir in the lime zest and juice, season to taste, and scatter over the coriander."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the cabbage wedges and sprouts with the oil, garlic and thyme in a large gratin dish. Season well, then roast for 25 mins.\nMeanwhile, melt the butter in a saucepan. Stir in the flour and cook for a couple of mins until it begins to turn golden. Remove from the heat then, whisking constantly, gradually pour in the sherry, followed by the milk and cream. Put the sauce back on the heat and cook for 3-4 mins, \n constantly, until you have a thick sauce. Grate in a generous amount of nutmeg, season well and set aside. Mix the breadcrumbs with the cheese.\nTake the sprouts and cabbage out of the oven, pour over the sauce and top with the cheesy breadcrumbs. Can be made a day ahead, and then reheated. Heat grill to 200C and grill the gratin for 15 mins until the top is golden and crisp. Leave to stand for 5 mins before serving."}
{"text": "Heat oven to 200C/180C fan/gas 6. Brush a 20 x 30cm roasting tin with melted butter. Combine the polenta, flour, baking powder, sugar and 2 tsp salt in a large mixing bowl. Mix the melted butter, buttermilk and eggs in a jug, then make a well in the centre of the dry ingredients and pour in the buttermilk mixture. Stir well until smooth.\nFry the bacon in a large frying pan until it starts to crisp, then add the onion and celery and cook for 5 mins. Add the rest of the stuffing ingredients and the cornbread mix, season well and stir together.\nScrape it all into the prepared tin and bake for 1 hr or until cooked through. Cut into squares to serve."}
{"text": "Heat oven to 200C/180C fan/gas 6. \n the pastry to just larger than a 30cm diameter ovenproof frying pan and use the pan as a template to cut out a round of pastry. Leave in the fridge, or a cool place while you prepare everything else.\nBring a \n of water to the boil, add the carrots and parsnips and cook for 5 mins. Drain and set aside to dry off slightly. Heat the oil and 1 tbsp of the butter in your pan and cook the sliced shallots and grated parsnips for 1-2 mins over a medium-high heat until just starting to brown, then add a good splash of water to the pan, stir to scrape up any brown bits, turn the heat down slightly, cover and cook for 4-5 mins, stirring every so often. The parsnips should be tender. Add the herbs and garlic and cook for another minute, then tip into a bowl, scraping out as well as you can. Season a little and set aside.\nAdd the sugar and vinegar to the pan and bring to the boil. Cook for a few minutes until syrupy, then stir in the remaining butter. Set aside to cool slightly, then arrange the vegetables in the pan, fanning them out. Top with the herby shallot and parsnip mixture, pushing it into any spaces there may be. Lay the pastry over the top of the vegetables and push in the edges a little. Place in the oven and bake for 30-35 mins until puffed and deep golden brown. \nWhile the tart bakes, put the nuts, sugar and butter in a small frying pan with a pinch of salt. Cook over a medium-high heat for about 5 mins, stirring, until the sugar has dissolved and coated the nuts. Add the rosemary for the last minute. Tip out onto a piece of baking parchment and leave to cool for a few minutes.\nOnce the tart is baked, remove from the oven and carefully turn out onto a serving board. Scrape out any bits that are left in the tin and add back to the tart. Bash the nuts to break them up and scatter over, along with the crumbled cheese."}
{"text": "Heat oven to 200C/180C fan/gas 6. Put the potatoes on a \n, toss with 1 tbsp of the oil, season and roast for 25 mins.\nWhile the potatoes roast, heat another 1 tbsp oil in a frying pan and cook the onion over a medium heat for about 7-10 mins to soften. Stir in the garlic, chilli flakes and sage and cook for another minute or 2. Remove from the heat and add the chestnuts, cranberry sauce and the sweet potato cubes. Season a little. \nLine a 20cm square tin with a rectangle of baking parchment that comes up two sides of the tin (this is to help you remove it later). Put 1 sheet of filo in the tin, brushing the bottom and sides with a little of the remaining oil, then add another piece of filo going in the other direction (like a cross). Brush with more oil on the bottom and sides, and repeat with another 2 sheets of filo.\nSpoon the sweet potato mixture into the tin and fold over the filo to cover, brushing with a little more of the oil. Brush the last piece of filo with the remaining oil, then scrunch on top of the parcel. Put in the oven and bake for 30 mins. 5 To serve, use the baking parchment to lift the parcel out\nof the tin and cut into four."}
{"text": "First, make the jelly. Soak the gelatine leaves in cold water until floppy, then drain. Strain off the juice from the cherries into a jug – you should have around 350-400ml. Put the juice and the redcurrant jelly in a pan, stirring until it boils and the redcurrant jelly has melted. Take off the heat, cool for a few mins, then stir in the gelatine until it dissolves. Pour into a shallow pan or dish to cool, then chill until set.\nFor the custard, scrape the vanilla seeds from the pod into a large bowl. Add the egg yolks, 40g sugar and the flour, then whisk until pale and creamy. Pour the cream into a medium-size pan and bring just to the boil. Gradually whisk the cream into the yolk mix. Wipe out the pan, then return the mixture to it. Cook slowly over a low heat, stirring with a wooden spoon until thickened – take extra care to stir well at the edges of the pan. Cool, stirring every so often.\nTo assemble the trifle, slice the Swiss roll into 8 pieces and arrange on the base and around the inside of a large glass serving bowl. Sprinkle with the sherry, if using.\nTurn the jelly out onto a board and chop with a sharp knife. Scatter the drained cherries and chopped jelly on top of the Swiss roll, then sprinkle over the crushed amaretti.\nPour the cooled custard over the biscuits, then return to the fridge until cold (about 2 hrs). For the topping, whip the cream to soft peaks with 1 tbsp sugar, then spoon or pipe it over the custard. The trifle can be covered and chilled for up to 2 days at this point.\nTo serve, sprinkle over the pistachios and remaining amaretti. Push back the leaves of the physalis and poke the fruit into the cream."}
{"text": "Put the skinned sausages in a bowl and squish together with your hands, then divide into two balls. Place one ball of sausagemeat onto a long piece of cling film. Roll into a cylinder approx 30cm long. Wrap tightly in the cling film and place on a plate or tray in the fridge. Repeat with the other ball of sausagemeat.\nHeat oven to 200C/180C fan/gas 6. Lay the pastry out on your work surface and cut it into four equal strips lengthways. Roll two of the strips out a little more with a rolling pin so that they are 40cm long and 10cm wide. Unwrap the sausagemeat, place each one in the middle of a rolled-out pastry length and sprinkle each with half the fennel seeds. On either side of the meat, cut regular slits from the edge up to the meat – do this all the way round to create 2cm tabs. Fold over the ends. Starting at one end, bring up one tab from one side and drape it over the meat, then do the same with one from the opposite side. Repeat with the other strip of sausagemeat. Brush both with egg, then lift onto baking trays.\nCut each of the remaining strips of pastry into three strips lengthways and plait together. Lay the plait on top of the sausage pastries and brush with more egg.\nBake in the oven for 40 mins or until risen and golden brown. Remove from the oven, transfer to a large board and slice – or allow your guests to serve themselves. Can be served hot or cold."}
{"text": "The day before, put the butter, sugar and 500ml water in a deep frying pan. Heat until the butter is melted, then bring the liquid to the boil and simmer until lightly syrupy. Drop in the parsnips and cook, covered, for 6-8 mins until just tender then, using tongs, transfer to a roasting tin. Repeat with the carrots then tip them, with the liquid, into the roasting tin with the parsnips. Leave to cool, then put in the fridge overnight.\nWhen you are ready to eat, take the roots out the fridge, and lift out of the syrup. Discard the syrup. Heat a \n or frying pan until searing hot then, in batches, put the roots cut-side down in the pan and cook for a min on each side until visibly charred. Sprinkle over the smoked salt, lemon juice and some parsley to serve."}
{"text": "Whisk the dressing ingredients together and set aside. Cook the rice following pack instructions, divide between two bowls and drizzle over half the dressing. Reheat the canapés.\nArrange all the remaining ingredients on top of the rice, making sections of carrot, cucumber, edamame, and canapés. Top with the coriander, sesame seeds and pickled ginger. Drizzle over the remaining dressing and serve."}
{"text": "To make the clementine jelly, put the sugar, vanilla pod, cinnamon stick, clementine juice and 100ml water in a large pan and bring to a gentle simmer. Meanwhile, peel the clementines and remove all the pith and outside membranes. Put the broken-up segments into a bowl and pour over the spiced sugar syrup. Cover with cling film and allow to macerate for at least 30 mins.\nMeanwhile, cut the madeira cake into 2cm-thick slices, trimming off and discarding the dark edges. Divide the slices between 12 glasses and push down in an even layer. Soak the gelatine leaves in cold water.\nDrain the clementines, pouring the liquid into a small saucepan. Discard the vanilla and cinnamon stick. Divide the clementines between the glasses in an even layer. Gently warm the liquid. Once it is warm, squeeze the gelatine to remove the excess water and stir into the warm liquid until completely melted.\nPour a layer of the jelly over the clementines. Transfer the pots to the fridge and allow to set for at least 3 hrs.\nTo make the chocolate layer, heat the cream to just below boiling. Remove from the heat, add the chocolate and stir until melted and smooth. Add the liqueur and butter and mix until fully combined. Pour into a jug and allow to cool for 15-20 mins. Pour on top of the jelly and put back in the fridge for a few hours to set."}
{"text": "To make the pastry, put all the ingredients in a food processor and pulse until it comes together, then tip onto a surface and knead into a ball. Wrap in cling film and chill in the fridge for 30 mins.\nRoll out the pastry on a lightly floured surface and use to line a 23cm tart tin, leaving any excess pastry overhanging. Chill for a further 30 mins.\nHeat oven to 190C/170C fan/gas 5 with a baking sheet on the middle shelf. Prick the pastry base with a fork and line the tin with baking parchment and baking beans or some dry rice. Place on the baking sheet and bake for 20 mins until golden around the edges. Remove the parchment and beans, and return to the oven for 10 mins more until the base is biscuit-brown.\nWhile the pie case is baking, make the filling. Finely chop half the pecans by hand or by pulsing in a food processor, then tip into a bowl. Mix in the eggs, golden syrup and melted butter until completely combined, then stir in the mincemeat.\nWhen the pie case is cooked, spoon over the mincemeat pecan filling and top with the reserved whole pecans. Bake for 20-25 mins until the top is just set, then remove from the oven to cool slightly.\nTo make the brandy cream, whisk together the cream and the icing sugar until holding soft peaks, then gently whisk in the brandy, vanilla and cinnamon. Serve the pie warm in slices with a dollop of the cream."}
{"text": "In a small saucepan, bring the cream to the boil. Remove from the heat and pour over the chopped chocolate. Gently stir the mixture until smooth, then add the alcohol or vanilla extract and hazelnuts. Cover and put in the fridge for 30 mins or until the mixture is thick but not solid.\nScoop out teaspoons of the mixture and roll into small balls with your hands. Put each of your sprinkles or glitters onto separate small plates or bowls. Roll each truffle into the sprinkles or glitter to coat, then chill again to firm up. Will keep chilled for 1 week, or freeze for up to 1 month without the decoration."}
{"text": "Pulse all the ingredients along with a handful of ice in a blender until smooth. Pour into a tall glass and garnish as you like."}
{"text": "To make the filling, mix all the ingredients in a small bowl until thoroughly combined. Cut each sheet of filo pastry into 4 evenly sized rectangles. Make a pile of 12 rectangles and cover with a damp tea towel to stop them drying out.\nBrush 1 of the rectangles lightly with oil. With one of the shortest sides facing you, spoon 1 level tbsp of the filling across the pastry 2cm up from the bottom of the rectangle and around 1cm in from both sides. Form into a sausage shape. Fold in the bottom over the filling, then fold in the 2 long sides all the way up the rectangle. Roll up from the short side close to you, fully enclosing the filling.\nPlace on a baking tray lined with baking parchment. Repeat as above to make a further 11 filo rolls. Brush with more oil and sprinkle with sesame seeds, if using. Can be covered with cling film at this stage and kept in the fridge for up to 8 hrs before baking.\nHeat oven to 200C/180C fan/gas 6. Bake the dippers for 10-15 mins or until the pastry is light golden brown and the filling is cooked thoroughly. Serve with Thai sweet chilli dipping sauce."}
{"text": "Heat oven to 150C/fan 130C/gas 2. Line the base and sides of a 1.5-litre loaf tin (a long thin one is best) with baking parchment. Mix the nuts and dried fruit thoroughly in a large bowl using your hands. Sift in the flour, spice and baking powder, then add the sugar and mix everything well. Beat the eggs with the vanilla, then add to the dry mix, turning everything together well until there is no dry mix visible.\nTurn into the prepared tin and smooth the top. Bake for 1½-1¾ hrs, then cool in the tin for 15 mins. Turn out, peel off the paper and cool on a wire rack. Dust the top thickly with icing sugar, to serve."}
{"text": "Heat oven to 230C/fan 210C/gas 8. Tip the potatoes into a roasting tin and toss in oil. Place in the oven on the shelf below thepoussin and roast undisturbed for 30 mins.\nToss through the sausages and chestnuts, then cook 15 mins more until the sausages are brown. Scatter over the parsley to serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. To make the stuffing, mix together all the ingredients, except the butter, in a large bowl with some seasoning. Scrunch with your hands until well combined.\nSeason the chicken all over and put in a roasting tin. Smear with the butter and put on the middle shelf of the oven for 50 mins.\nMeanwhile, grease a 20 x 30cm roasting tin. Press in the stuffing, then sprinkle with the reserved breadcrumbs and dot with the butter.\nBrush the chicken with the mustard, transfer it to a lower shelf and roast for 40 mins more until cooked through and the juices run clear. Put the stuffing on the top shelf at the same time and cook for 40-50 mins until golden and crisp.\nLeave the chicken to rest for 10 mins, then serve with the stuffing, along with roast potatoes and veg, if you like."}
{"text": "Heat oven to 200C/180C fan/gas 6. Melt all the butter in a saucepan. Brush a 20cm soufflé dish with a little of it, then dust with flour. In the saucepan, stir the flour into the rest of the melted butter, then sizzle everything for 1 min. Gradually pour in the milk to make a white sauce, then add two-thirds of the cheese and carry on cooking to melt. Leave to cool slightly, then mix in the remaining cheese, the cream or crème fraîche and the egg yolks. Season, then add the nutmeg and cayenne pepper.\nIn a clean bowl, whisk the egg whites until stiff. Fold into the cheese sauce, then carefully tip into the soufflé dish. Bake the soufflé for 25 mins until puffed up and golden.\nWhile the soufflé is cooking, toss the salad ingredients together. Once the soufflé is cooked, dress the salad and serve alongside."}
{"text": "Boil the potatoes for 10 mins until tender, then drain and leave to steamdry. While the pork is resting (see left), lower the oven to 200C/180C fan/gas 6.\nDrizzle half the oil over a flat, sturdy baking tray and tip in the potatoes. Add the fennel seeds, and season with the flaky sea salt and some black pepper, tossing everything to coat. Gently squash the potatoes with a potato masher to just break the skins. Drizzle with the extra oil and bake for 45 mins until crispy and golden."}
{"text": "Heat oven to 160C/140C fan/gas 3. Line an 18cm square baking tin with greaseproof paper. Melt butter, golden syrup and sugar in a large pan. Mix in rolled oats, carrots, orange zest, apricots, cinnamon and pumpkin seeds. Stir everything well, then pack into the prepared tin, pushing down firmly. Bake for 40-45 mins, then cool in the tin before slicing into 16 squares."}
{"text": "Whisk the lemon juice with the mustard, then mix into the mayonnaise with the dill. Prepare up to a day ahead and chill.\nLay out the seafood on a platter with lemon wedges and a bowl of the mayonnaise in the middle so everyone can help themselves. Serve with plenty of fresh brown bread."}
{"text": "Put the onions, sugar and vinegar into a large pan on a low heat. Cook for about 25 mins, stirring now and again, until gloopy and sticky. Cool. Mix together the cheeses, crème fraîche, eggs and mustard with some seasoning, then chill.\nTo serve, heat the grill, lightly toast the bread and cut each slice into chunks. Put onto a baking sheet, spread a tsp of chutney on each chunk, then pile on the rarebit mixture – as much as the little squares can hold. Grill for 3-5 mins until golden brown and bubbling."}
{"text": "In a large bowl, combine the curry paste, mango chutney and 2 tbsp yogurt, and mix well. Fold in the potatoes, turkey, peas and coriander, then season well.\nHeat oven to 200C/180C fan/gas 6. Cut the sheets of filo in half lengthways so you have 12 strips – keep the pastry covered with a tea towel while you work so it doesn’t dry out. Layer up 3 sheets of filo, brushing a little oil between each sheet. Pile a quarter of the filling in the top corner of the pastry in a triangle shape. Fold the pastry over to encase the filling, then keep folding until the parcel is sealed and the filo is used up. Brush the final edge with a little beaten egg to help stick the pastry together. Repeat to make all 4 jumbo samosas.\nLay your samosas on a baking sheet and brush each one with more beaten egg, then sprinkle with sesame seeds. Bake for 35 mins or until the samosas are golden brown and the filling is piping hot. Serve with the remaining yogurt, some mango chutney and coriander leaves."}
{"text": "Melt 2 tbsp butter in a large frying pan, chop the remaining butter into small chunks and put in the fridge. Add the leeks, carrots, parsnips and celeriac to the pan with a splash of water, season, cover with a lid and cook for 10-15 mins, stirring now and then, until the veg is beginning to soften.\nStir in 2 tbsp plain flour, then add the stock bit by bit, stirring as you go, until all incorporated and smooth. Cover with a lid and simmer for 20 mins until the vegetables are tender.\nHeat oven to 220C/200C fan/gas 6. Add the ham, all but 2 tbsp of the crème fraîche, and the mustard, season with plenty of black pepper and transfer to an ovenproof baking dish. Put the remaining butter and flour in a bowl and season. Rub together with your fingers to a fine crumbly texture. Add the remaining crème fraîche and mix with a cutlery knife until the crumble clumps together in places. Sprinkle the crumble mixture over the filling, then bake for 35-40 mins until crispy and golden on top."}
{"text": "Cover the shallots with boiling water and set aside until cool enough to handle, then peel and discard the skins.\nHeat the oil in a large pan, and add the shallots. Cover with a lid and cook over a low heat for 8-10 mins until starting to caramelise. Add the vinegar, honey and allspice to the pan along with some seasoning. Give everything a good shake in the pan, then bubble for 10 mins until the shallots are tender and sticky, adding a splash of water if the honey looks like it might burn.\nMeanwhile, bring a large pan of water to the boil, add the greens and cook for 2 mins until they are just tender but still have a nice bite. Add to the shallots and toss through the sticky dressing."}
{"text": "Sift the buckwheat and spelt flours into a bowl with 1 tsp salt and scatter over the yeast. Heat the milk and yogurt very gently until tepid, then \n in the egg yolks. Whisk this mixture into the flour mix and leave for 1 hr to ferment.\nWhisk the egg whites to stiff peaks. Stir the beetroot and horseradish purée through the batter, then lightly fold in the egg whites. Leave for a further hour.\nHeat the clarified butter in a non-stick frying pan, then add in dessertspoonfuls of blini mix. Fry for about 40 secs, or until they naturally come away from the pan when you shake it. They should puff up, and you’ll need to be careful when turning over as the middle might try and escape a bit – use a palette knife for this. Turn over and fry for another 20-30 secs, then transfer to kitchen paper. Continue with the rest of the mix. Leave to cool, then freeze the blinis for up to one month.\nWhen your blinis are done, top with the soured cream, smoked trout, dill and salmon roe, if using, then serve."}
{"text": "Heat oven to 200C/180C/gas 6. Put the chicken wings in a large bowl with plain flour and season well. Toss together to coat, then spread out over a large baking tray, drizzle with oil and cook for 40-45 mins, turning halfway through.\nWhen the chicken wings are nearly done, put the \n in a saucepan with the orange juice and honey. Warm gently, then pour over the chicken wings, toss together, and return to the oven for a further 10 mins or until sticky. Sprinkle with salt to serve. "}
{"text": "Put the pomegranate juice, sugar, blackberries and apple juice in a saucepan. Add the cinnamon, star anise, cloves, peppercorns and orange. Heat gently until simmering. Taste for sweetness, then strain into heatproof glasses."}
{"text": "To make a mock rum syrup, put the dark brown muscovado sugar and 200ml water in a \n, stir well and heat gently until the sugar has dissolved. Add a few strips of skin from the pineapple, add the black peppercorns, cloves and a cinnamon stick, then bring to the boil. Turn off the heat and leave to infuse until cold. Strain into a jug and set aside in the fridge until needed. \nPour the pineapple juice into a tall glass, and add the coconut milk and lime juice. Stir gently. Fill up the glass with a handful ice then slowly add 25ml of the syrup so it sinks to the bottom. Garnish with pineapple leaves and a tinned cherry."}
{"text": "To make the base syrup, put the sliced pear, dried apricots, golden caster sugar, honey, sprig of rosemary and a strip of lemon zest in a saucepan with 100ml water. Heat for 10 mins or until the sugar has dissolved and the pear is very soft, then leave to cool completely.\nStrain the syrup into a jug, add the apple cider vinegar and chill in the fridge for at least 30 mins. Pour about 25ml of the syrup into a champagne flute and top with cold sparkling water. Garnish with a rosemary sprig, if you like."}
{"text": "Heat oven to 160C/140C fan/gas 3. Heat the butter in a casserole dish until sizzled to a nutty brown. Add the onion and fry for 15 mins over a medium heat until soft and starting to colour.\nTip the remaining ingredients into a large pan and cover with a tight-fitting lid. Put in the oven for 1 hr, then stir, cover and cook for a further 1 hr until the cabbage is tender. If it looks dry, add a splash of water; if there’s still liquid in the pan once cooked, turn the heat up until it evaporates. Season with a little salt and serve. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Oil and line the base of a 200ml ovenproof ramekin with a circle of baking parchment. Put the cranberries in a small pan with the wine and cook for a couple of mins over a medium heat until the cranberries are plump and the wine syrupy. Pour into the base of the ramekin and set aside.\nPut the lentils in a bowl and roughly mash about half of them with a fork. Heat the oil in a small pan and cook the onion for 6-8 mins over a medium heat until softened. Stir in the garlic, herbs, paprika and cloves and cook for another minute. Turn off the heat and add the lentils, tomato purée, soy and cornflour, stir everything together well, then spoon into the ramekin, pressing down gently with the back of a spoon. \n \nPut the ramekin on a \n and bake for 15 mins. Leave to cool for 1 min, then turn out onto a plate."}
{"text": "Heat oven to 180C/160C fan/gas 4 and put a \n in the oven to heat up. On a lightly floured surface, \n two-thirds of the pastry to a circle about 0.5cm thick. If you’re adding a spiced flavour to your pastry, sprinkle with the cinnamon or nutmeg, fold in half and repeat, then roll it out again to a circle about 0.5cm thick.\nPress the pastry into a 23cm metal pie tin or tart tin and trim off any excess pastry hanging over the edge. If you’re using a deep tin, roll the edges down a little to make a lip (you only want to make a shallow tart). Spread the jam over the pastry base.\nOn a lightly floured surface, roll out the remaining pastry to a thickness of 0.5cm and use small cookie cutters to stamp out shapes. Re-roll the trimmings and cut out more shapes if needed. Arrange the pastry decorations over the jam layer.\nPut the tin on the hot baking tray and cook for 40 mins, then leave to cool for 15 mins. Dust the pastry toppings with icing sugar. Serve warm or cold with custard, cream or ice cream."}
{"text": " the pastry to a 35 x 30cm rectangle on a surface lightly dusted with flour. Trim the edges neatly, then cut in half lengthways to form two long strips. Spread with a thin layer of the apple sauce, pickle or chutney, leaving a border along the edges.\nTip the sausagemeat into a \n, add 3 tbsp cold water and squash together. Divide the mixture in two and mould each half into a cylindrical shape. Put each portion of meat into the middle of a pastry strip, leaving a border at either side. Brush the pastry border and the top of the sausage mix with the beaten egg. Fold one edge of the pastry over the meat and roll to encase, then use a fork to press the pastry edges together. Cut the sausage rolls into 5cm lengths and arrange on a lined baking tray. Chill for 20 mins. Can be made a day ahead or frozen for up to one month; to bake from frozen, add an extra 10 mins to the cooking time.\nHeat oven to 200C/180C fan/gas 6. Brush the sausage rolls with the rest of the beaten egg and sprinkle with the sesame seeds or nigella seeds (if using). Bake for 30-35 mins until the pastry is deep golden. Transfer the sausage rolls to a wire rack and leave to cool for 10 mins."}
{"text": "Heat oven to 180C/160C fan/gas 4. Slice into each croissant lengthways, but don’t go all the way through – they should open like books. Sprinkle or spread the bottom half of each with marzipan, followed by 1 tsp almonds and 1 tbsp chocolate.\nClose up, put on a baking sheet and sprinkle the remaining chocolate and almonds on top. Bake for 5 mins or until the chocolate has melted. Serve warm."}
{"text": "Put the sugar, vinegar, orange zest and juice, ginger, bay leaves and peppercorns in a large pan. Bring slowly to the boil, stirring constantly to dissolve the sugar, then boil for 5 mins.\nMeanwhile, peel, core and halve or quarter the pears, depending on size. Add the pears to the pan and poach gently for 10-15 mins until they are just tender. Remove with a slotted spoon and pack into warm sterilised Kilner jars with rubber seals (see tip below).\nBoil the vinegar mixture hard to reduce by a third, then pour over the pears, including the spices. The pears need to be completely covered with the liquid. Fit the rubber seal and clamp the jar tightly closed. Reserve any leftover syrup for topping up the jars later, as the pears will absorb the syrup over time. "}
{"text": "First, make the stuffing crust, as this will keep. Heat oven to 140C/120C fan/gas 1. Place the slices of bread on a baking sheet, drizzle with the rapeseed oil and dust with the cayenne pepper. Bake in the oven until the bread is completely dry and browned just a little – this will take about 20 mins. Remove from the oven and rub with the garlic cloves while still warm. Use a whole clove on each slice, or half if you have small slices. Leave the toasted slices to cool, then put them in a food processor and blitz to rough but not too big breadcrumbs. Empty the crumbs into a mixing bowl and add the dried sage and onion, the parsley and a good pinch of sea salt. Mix together, then set aside in an airtight container. Can be made up to 2 days ahead without the parsley (see tip, below left).\nTurn down the oven to 120C/100C fan/ gas ½. Score the layer of fat on the pork with a sharp knife, working diagonally along the length, then score again in the opposite direction. Tie the loin with butcher’s string to help keep its shape and cook evenly. Heat the rapeseed oil in an ovenproof frying pan and add the pork, fat-side down. Sear and brown the top layer of fat, then turn the pork over and throw in the butter, garlic, rosemary, thyme, pepper and 2 tsp table salt. Once the butter has melted, add the lemon zest and juice to create a fragrant cooking liquor. Roll the pork around in the buttery juices and baste so that it is well coated.\nPlace the pan with the pork in the oven and set your timer for 1 hr 15 mins. Baste the meat with the buttery juices every 15 mins. At the end of the cooking time, test the thickest part of the pork with a digital thermometer – it should read 70C when ready. If the meat hasn’t reached the temperature, return it to the oven for 5 mins, then check again. Once the pork is cooked, remove from the oven and leave to rest for 10 mins. If you don’t have a digital thermometer, cook the pork for 1 hr 20 mins.\nWhile the pork is resting, pour the milk for the polenta into a saucepan and bring to the boil. Whisk in the polenta and cook over a medium heat until thickened, following pack instructions – it needs to be the texture of creamy mash. If your polenta is too thick, add a little more milk to loosen it. When it is ready, remove from the heat and whisk in the butter, Parmesan, lemon zest, truffle oil, fresh truffle (if using), salt and the cayenne to taste. Pour into a serving bowl and sprinkle over the chives.\nUntie the rested pork loin and give it a final baste with the cooking liquor. Tip the crust into a roasting tin, then roll the pork loin in it, making sure it gets a good covering. Thickly slice the pork and serve with the soft polenta, Romanesco or broccoli sprinkled with toasted hazelnuts, and the buttery juices."}
{"text": "Heat oven to 200C/180C fan/gas 6. Toss the carrots, oil and some seasoning on a large baking tray. Cook for 25-30 mins until tender. While the carrots cook, fill 2 large pans with salted water and bring to the boil. Add the rice to one pan and the lentils to the other. Cook following pack instructions, or until just cooked, then drain and set aside to cool.\nZest the oranges over a large bowl. Cut away the peel and pith, then cut along each piece of membrane to remove the segments, catching any juices in the bowl. Set the segments aside. Add the ingredients for the dressing to the orange zest and juice, season and whisk.\nWhen the carrots have cooled a little, add to the dressing with the remaining salad ingredients, including the cooked rice, lentils and orange segments. Toss together and serve on a big platter."}
{"text": "Heat the butter in a saucepan. Add the leeks, rosemary and bay leaf, then cover and cook very gently over a medium-low heat for 15-20 mins until the leeks are soft. Pour over the milk and almost all of the cream, then season and bring to the boil. Remove from the heat and leave to cool a little, then scoop out the bay leaf.\nPour a little of the leek mixture into an ovenproof gratin dish. Arrange a layer of celeriac in the dish, then season. Spoon over some more of the leek mixture and scatter with a little cheese. Repeat the process, alternating between layers of the leek mixture, cheese and celeriac slices, then finish with a drizzle of cream and the last of the cheese.\nHeat oven to 180C/160C fan/gas 4. Bake the gratin for 1 hr-1 hr 15 mins until the top is golden and the celeriac is tender when poked with a knife. If the gratin is browning a little too much, cover the dish in foil. "}
{"text": "Heat a griddle pan over a high heat until nearly smoking. Rub the chicory and radicchio quarters with the olive oil and season. In batches, griddle on all sides until tender and the leaves have slightly blackened. Drizzle over the saba or balsamic vinegar to serve."}
{"text": "Heat oven to 190C/170C fan/gas 5. Cook the macaroni following pack instructions, then drain in a colander. Meanwhile, melt the butter in a large saucepan over a medium heat. Once melted, add the shallots and cook very gently for 10-15 mins until soft. Add the flour, mix well, then slowly add the milk, a splash at a time, mixing well after each addition to make a smooth sauce. Once all the milk has been added, keep cooking and stirring until the sauce thickens. Stir in the mustard, cream cheese, cheddar and egg. Season well.\nTip the cooked macaroni into a deep baking dish (ours was 28 x 18cm) and pour over the cheese sauce, making sure the macaroni is well coated. Bake for 20 mins until starting to turn lightly golden. Remove from the oven, leave to cool completely, then chill overnight.\nThe following day, heat oven to 190C/170C fan/gas 5 and slice the macaroni cheese into 36 blocks. Transfer to 2 baking trays so the blocks have space around them. Gently press a piece of mozzarella into the middle of each. Bake for 10-15 mins or until starting to crisp at the edges and the cheese has melted. Put the blocks into the mini rolls with a few watercress sprigs and a squeeze of BBQ sauce, if you like. Serve immediately."}
{"text": "Rub the flour and butter together with your fingertips until the mixture looks like breadcrumbs. Add the sugar, egg yolks and 1-2 tbsp cold water, then mix until the dough starts to form clumps. Tip onto your work surface and knead a few times to bring any crumbs into the dough. Shape into a puck, wrap in cling film and chill for at least 30 mins.\nHeat oven to 180C/160C fan/gas 4 and put a baking sheet on the middle shelf to warm up. Roll out the dough on a flour-dusted surface to line the base and sides of a 23cm round fluted tart tin. Drape it over a rolling pin and lift into the tin, keeping an overhang of about 1cm. Press into the corners, leaving no gaps. Save the pastry scraps.\nLine the tart case with parchment and tip in baking beans or rice. Bake for 20-25 mins on the sheet, then remove the beans and parchment. Check for holes and patch them with the scraps. Put back in the oven for 5-10 mins to give it a nutty brown colour. Brush with the beaten egg and return to the oven for 2 more mins. While still warm, use a serrated knife to trim the pastry to the height of the tin. Leave to cool. Reduce oven to 140C/120C fan/gas 1.\nPut the cream and coconut cream in a pan and heat until steaming. Meanwhile, whisk the whole eggs, yolks and sugar until pale. Pour the hot cream over the eggs, whisking until the sugar has dissolved. Pour through a sieve into a jug.\nPut the tart case on the baking sheet in the oven, with the shelf pulled out. Pour in the custard, using up as much as you can. Sprinkle nutmeg over the top generously and bake for 50-55 mins until the custard is set with a little wobble when gently shaken. Leave to cool. \nWhen ready to cook the pineapple, heat oven to 240C/220C fan/gas 8. Peel it using a knife to carve away the skin, then cut into four wedges and remove the core. Slice lengthways into long slivers. Arrange over a baking tray lined with parchment. Mix the sugar, rum (or lime juice) and a grating of nutmeg, then paint this over the pineapple. Bake for 10 mins, or until caramelised. Serve warm with the cold tart. We served ours on top with coconut shavings.\n "}
{"text": "Heat oven to 160C/140C fan/gas 3. Put the cream into a saucepan with the vanilla seeds, then bring just to the boil. Take off the heat and stir in the chocolate until it has completely melted.\nBoil the kettle. Meanwhile, whisk together egg yolks and 50g sugar for 20-30 seconds until thick and pale, then stir in the creamy chocolate. Divide the brownie pieces and cherries between six 200ml ramekins or dishes, drizzle with a little of the kirsch from the jar, then pour over the chocolate mix.\nLine a roasting tin with a clean tea towel and stand the ramekins in the tin. Pour hot water halfway up the sides of the ramekins, cover the whole thing with foil, then cook for 40 mins until just set. Chill for at least 3 hrs. These can be baked and chilled up to 2 days in advance.\nOne hour before serving, make the sugary crust. Put the 6 tbsp sugar into a non-stick pan and melt evenly over a gentle heat. Once the sugar has turned a rich caramel colour, spoon it over the puddings and leave to set hard."}
{"text": "Heat oven to 220C/200C fan/gas 7. Stack two of the filo sheets. With a widest edge facing you, brush with some melted butter. Put three brie fingers at even intervals across the bottom of the filo. Top each finger with 1 tsp cranberry sauce, then sprinkle over a few chopped walnuts.\nRoll up the filo from the bottom. Cut into three parcels, and twist the ends to seal. Brush with more butter and sprinkle with poppy seeds. Repeat with the remaining ingredients. Bake for 10 mins. "}
{"text": "Heat oven to 200C/180C fan/gas 6. Halve or quarter the artichokes, if whole, and put them in a bowl with the chilli flakes, mint, zest and oil. Season lightly with salt and set aside.\nPut the bread on a baking sheet and scatter over the garlic. Drizzle with olive oil and season with sea salt. Bake for 10 mins, or until golden and crisp. Set aside to cool.\nFold the pecorino through the marinated artichokes and spoon over the garlic bruschetta just before eating."}
{"text": "Put the kippers in a bowl and pour over boiling water so that they are completely covered. Leave for 8 mins, then drain. Meanwhile, put the remaining ingredients, except the sourdough and lemon wedges, into a food processor. Add a good grind of black pepper and whizz until everything is chopped and combined.\nCut the heads off the kippers and remove the skin, then fillet and discard the bones. Add the kipper flesh to the processor and whizz again until you have a smooth pâté. Pack in a suitable container and chill. Serve with sourdough toast and lemon wedges."}
{"text": "Heat oven to 140C/120C fan/gas 1 and line 2 baking trays with baking parchment. Mix the dry ingredients in a large bowl. Beat the egg with 250ml water in a jug, then pour into the dry mixture. Combine with a wooden spoon, then transfer to a lightly floured work surface and knead until you have a smooth, firm dough.\nRoll the dough out as thinly as possible and cut into squares, about 7cm. Transfer the squares to your baking trays. Bake for 45 mins, then remove the trays from the oven. Flip each cracker over on the tray and return to the oven, swapping over the shelves, for a further 45 mins. Once cooked, remove from the oven and transfer to a wire rack to cool. "}
{"text": "Before you start, read the tips at the bottom of the recipe.\nTip the flour and butter into a bowl. Use your fingers to squash the lumps of butter into the flour, then rub together until the mixture resembles wet sand. Add the sugar and egg yolk and 1-2 tbsp cold water. Mix together with a blunt cutlery knife, then your hands, until it becomes a soft dough. (Or, get an adult to help you to do this in a food processor.) Wrap the dough in cling film and pop in the fridge for 20 mins to chill.\nHeat oven to 200C/180C fan/gas 6. Line 2 baking trays with baking parchment. Put the candy canes in a resealable plastic bag, then wrap in a tea towel. Use a rolling pin to bash them to a chunky rubble. Set to one side.\nDust your work surface with a little flour, then use a rolling pin to roll out the dough. Cut out heart shapes with your big cookie cutter. Put them on the baking trays, spaced a little apart. Use your small cutter to cut out a little heart in the centre of each big heart. Re-roll your cuttings to make about 20 hearts in total.\nBake for 8 mins. Carefully remove the trays from the oven, then fill each small heart with a little of the crushed candy cane. Return to the oven for 4 mins more, until the biscuits are just starting to turn golden and the candy cane has melted.\nOnce out of the oven, quickly sprinkle the gooey centre of each heart with a little extra crushed candy cane. Leave to set and cool completely on the trays. Once cool, the biscuits will peel straight off the trays. Wrap them in pretty boxes to give as a gift."}
{"text": "Tear the pitta into pieces and fry in the olive oil until crisp. Tip into a bowl, then fry the aubergine for 10 mins until soft. Add to the pitta with the harissa, tomatoes, turkey and rocket. Toss well. Scatter over pomegranate seeds and mint leaves."}
{"text": "Mix icing sugar with peppermint extract and enough water to make a thick icing. Spread the icing over cookies and create a border around the edges using sweets and sprinkles. Leave for 10 mins for the icing to set. Then, using an icing pen, write a guest’s name in the centre of each cookie. When the icing is dry, wrap in cellophane and tie up with a pretty ribbon."}
{"text": "Toast the cumin and coriander seeds in a dry frying pan until aromatic. Tip into a mortar and coarsely grind with the pestle. Toast the mustard seeds in the same pan until they start to pop, then add to the other spices. Tip the spices into a large pan with the chillies, onions, ginger and vinegar. Bring to the boil, then simmer for 10 mins until the onions are softened.\nAdd the chopped apples, grapes, sugar and 1 tsp salt, and bring to the boil, stirring. Boil hard, stirring from time to time, for about 15-25 mins until the mixture is thick and pulpy.\nPot into warm sterilised jars (see tip, below), seal and label. "}
{"text": "Heat oven to 160C/140C fan/gas 3. Line 2 baking sheets with baking parchment and brush with butter. Mix the butter, egg whites, sugar and flour until smooth, then add the almonds. With wet fingers or the back of a spoon, flatten tbsps of mixture into 16 biscuits on the sheets. Bake for 15-18 mins until golden. Cool. "}
