{"text": "Whizz the ricotta, spring onions, lemon zest, juice, soured cream and some seasoning in a food processor. Scatter with more sliced spring onions to serve, and eat with cucumber sticks or toast."}
{"text": "Break the garlic bulb into cloves and place in a pan with the potatoes in their skins, then cover with cold salted water. Bring the potatoes to the boil, then simmer for 15 mins until you can put a knife through, but they still hold their shape. Drain in a colander and leave to cool.\nHeat oven to 180C/160C fan/gas 4. When the potatoes are cool enough to handle, peel off the skins. Cut into quarters and mix in a large bowl with 2 tbsp of the olive oil and some seasoning. Toss with the semolina flour until well coated.\nPour the remaining 3 tbsp olive oil into a shallow roasting tin and add the potatoes, garlic and thyme. Bake for 45 mins-1 hr until the potatoes are crisp and golden.\u2028"}
{"text": "Preheat the oven to 150C/130C fan/gas 2. Thinly slice the potatoes and turnips to about 2mm thick – you can use a Japanese mandolin if you have one – then toss together in a large bowl. Pour the cream in a pan, then add the garlic, plenty of salt and some white pepper – be generous when seasoning the cream as the potatoes and turnips aren’t seasoned separately. Bring the cream to the boil, then remove from the heat and put to one side. Grease a large gratin dish and layer a third of the potatoes and turnips in the dish, slightly overlapping each other as if you are building a wall. Pour over a third of the warm cream, then continue in this way with the remaining potatoes, turnips and cream.\nPut the gratin in the oven and cook for 20 mins. Remove the dish from the oven and push the potatoes and turnips down with a fish slice. This will help to release the starches and the cream will eventually reduce and thicken. Put the gratin back in the oven and repeat the process every 10 mins until the potatoes and turnips feel tight and firm. Return to the oven for another 20 mins and cook until golden brown and tender – test by inserting a sharp knife through the potatoes and turnips. Remove from the oven and leave to cool slightly."}
{"text": "Heat a toastie maker or a small griddle pan. Butter each slice of bread on one side, then spread the other side of one slice with fig jam, and one with mustard. Top the fig jam with brie and ham, sandwich with the remaining bread, butter-side up, then place in the toastie maker or the griddle pan. If cooking in a pan, squash down a little with the back of a fish slice while cooking, flip over after 2-3 mins when golden, then cook on the other side. Serve with a handful of salad leaves on the side, if you like."}
{"text": "Simmer the plums, covered, with 200ml water and sugar until softened. Tip into a baking dish and scatter over the madeira cake.\nDrizzle with double cream, scatter with the nuts and dust with icing sugar. Bake at 180C/160C fan/gas 4, just until browning."}
{"text": "Put the zests, sugar, vanilla pod, cinnamon sticks and 400ml water in a large pan. Bring to the boil, then reduce the heat and simmer gently for 20 mins. Leave to cool, then add the Cognac.\nPack the chestnuts into sterilised jars (see tip, below), then pour over the syrup to cover. Seal and label. Keep in a cool, dry place for at least 1 week before eating. Store in a cool, dry place for up to 6 months."}
{"text": "Melt the chocolate and half dunk the baked trimmings from cutting out the sides of your gingerbread house. Leave to set, then serve with tea, coffee or hot chocolate after dinner."}
{"text": "Heat oven to 220C/200C fan/gas 7. To slice, place a potato in a wooden spoon and carefully cut at 3mm intervals, slicing through the potato until your knife hits the spoon. In a bowl, mix the dill and breadcrumbs together.\nToss the potatoes with the oil and some seasoning, and arrange a large baking tray – cut-side up. Bake for 20 mins. Sprinkle with the dill breadcrumbs, then bake for a further 15 mins."}
{"text": "Bring a pan of salted water to the boil and have a bowl of iced water ready. Add the cauliflower to the pan, return to the boil and cook for 30 seconds. Drain the cauliflower, then plunge into the ice water. Once cold, drain well. \nKeep 3 tbsp of the onion vinegar aside, then mix the cauliflower with the onions and the rest of the vinegar from the jar in a large bowl. Cover and steep in the fridge for at least 2 hrs, or overnight if possible.\nTo make the dressing, heat 1 tbsp oil in a \n, then add the garlic and ginger and cook for 1 min, stirring well. Stir in the turmeric and cook for 30 seconds, then remove from the heat. Add the mustard, 1 tbsp oil and the 3 tbsp pickling juice you reserved earlier. Cool for a few mins, then stir in the yogurt and season to taste.\nHeat the oven to 180C/160C fan/ gas 4. Tip the kale onto a large \n. Season and rub 1 tbsp oil all over the leaves. Bake for about 6-8 mins till turning crisp at the edges. Once cooled, the kale will crisp up all over. Just before serving, drain the cauliflower and onion from the pickling juices and toss into the dressing, then fold the kale gently into it. Serve alongside our chicken terrine with leeks & apricots."}
{"text": "If you have time, rub salt in the pork skin 2 hours before cooking and leave it uncovered in the fridge. Heat the oven to 230C/210C fan/gas 8. Turn the pork rind-side down and with a small knife make about 6 deep incisions along the meat. Poke a sliver of garlic, a piece of rosemary and bay in each incision and turn the pork the right way up. If you didn’t salt the pork earlier salt the skin now.\nMix the carrot, onion and apple and scatter along the middle of a shallow roasting tray to make a bed for the pork to sit on. Sit the pork on the vegetables and rub the skin with the oil. Place the pork in the oven and leave for 15 mins then turn the heat down to 180C/160C fan/gas 4 and continue to roast for 1hr 30 mins. If after this time you don’t have brilliant crackling turn the heat up again and check every 5 mins until the skin has crackled.\nRemove the pork from the roasting tray to a board to rest and pour off all but about 2 tbsp of fat from the tray. If your tray is robust enough to go on the heat then do so, if not scrape the contents into a shallow saucepan and place on the heat. Stir the flour in with the veg and cook until you have a mushy, dark amber paste then splash in the cider and bubble down to a thick paste again. Pour in the stock and simmer everything for 8-10 mins until you have thickened gravy. Strain the sauce into another saucepan pushing as much puréed apple as you can through the sieve. Simmer again and season to taste.\nCarve the pork loin with crackling attached into slices using a serrated knife and serve with your favourite vegetables and the apple and cider gravy."}
{"text": "Butter the bread. Put a wedge of camembert or brie on the unbuttered side of one slice of bread. Top with a spoonful of cranberry sauce. Drizzle with a few drops of balsamic vinegar, if you have some.\nPut the second slice of bread on top, buttered side out. Fry in a hot \n, pressing down with a fish slice, for a minute or two on each side, until golden brown and melting. Cut in half and eat straightaway."}
{"text": "Heat a large saucepan and fry the curry paste for 1 min, until fragrant. Tip in the stock and bring to the boil, then throw in the turkey and cook for 5 mins. Add the rice noodles and cook for 3 mins more.\nAdd the pepper and beansprouts and cook for 2 mins more. Add the coconut milk, bring to a simmer, season with the lime juice and sugar, then spoon into bowls, sprinkle with the coriander leaves and serve."}
{"text": "Heat oven to 180C/160C fan/ gas 6. Put the ham into a large roasting tin, then tip in 500ml water. Cover the whole thing loosely with greaseproof paper, then cover with a large sheet of foil, scrunching and sealing it around the edge of the tin. Make sure you leave some room around the ham. Put it in the oven, then turn the heat down to 160C/140C fan/ gas 3 and leave to cook for 5 hrs. Meanwhile, mix the marmalade with the sugar and 50ml water in a small pan, bring to the boil, then set aside and leave to cool.\nTake the ham from the oven. Be careful when you lift the foil as there will be a good amount of steam, which can burn. Once the ham has cooled just a little, remove the rind by gently prising the skin from the fat and lifting it away. Try to keep as much fat on the leg as you can as this will keep the ham moist as it roasts. Drain off most of the liquid (this is very good ham stock – keep it and use it for soup), leaving a little in the tin. Turn the oven up to 200C/180C fan/gas 6.\nScore lines into the fat with a knife to make large diamond shapes, with the lines about 4cm apart. Brush a third of the marmalade glaze over the joint, really pushing it into the creases and cuts. Now stud the ham with the cloves by poking a clove into the corner of each diamond.\nPut a trivet into the roasting tin (if you don’t have one, a few halved carrots will do), then sit the ham on top. Roast the ham, uncovered, for 45-50 mins, brushing with the remaining glaze a few times during cooking, until caramelised and delicious. Carve hot or cold."}
{"text": "Gently cook the leeks in the butter and olive oil until soft but not coloured. Add the celeriac and stock, bring to the boil and simmer until the celeriac is soft. Add the bags of watercress and blend until smooth, then season. Cool. \nTo serve, defrost the soup in the fridge overnight, then tip into a saucepan and reheat. Top each toasted baguette slice with some goat’s cheese, then add a slice to each bowl with a sprig of watercress."}
{"text": "Heat the oven to 200C/fan 180C/gas 6. Peel and trim the roots of the onions but leave them whole. Cook in a large pan of boiling water for 25 mins until tender, then drain, reserving a little cooking water.\nSeason the cream and mix in 2 tbsp of the onion water. When the onions are cool enough to handle, slice each in half through the root. Lay the onion halves, cut side down, in a large baking dish with the bay leaves. Pour over the cream, scatter with the Parmesan, and bake for 25 mins until the cream is bubbling and the onions are just beginning to brown."}
{"text": "Measure the milk and treacle into a saucepan (grease the measuring spoon with a little oil first and the treacle will easily slide off). Bring to a gentle simmer and stir until combined, then set aside to cool. Meanwhile, grease 3 x 20cm loose-bottomed cake tins with a little oil and line the bases with baking parchment (if you don’t have enough cake tins, see tip). If the tins are any shallower than 4cm, line the sides with a deep collar too. Heat oven to 180C/160C fan/gas 4.\nMeasure the flour, baking powder, bicarbonate of soda, sugar and spices into a large bowl, then add 1/2 tsp fine salt. Mix the dry ingredients together with a large whisk; if there are any large lumps of sugar, squeeze these through your fingers until you have an even, sandy-textured mixture.\nIn a jug, whisk the oil, buttermilk, eggs, rum and vanilla. Add the milk and treacle mixture, and mix well. Pour the wet ingredients into the dry, and whisk into a smooth batter. Divide between the tins and bake for 25-30 mins until a skewer inserted into the centre of the cakes comes out clean. You may have to swap the cakes over to cook evenly, but don’t do this until they’ve had at least 20 mins cooking. Cool the cakes in their tins for 10 mins, then transfer to a wire rack, peel off the parchment and leave to cool completely. Once cooled, you can wrap the sponges in cling film and store in a cool place for 4 days, or freeze for up to 2 months – the texture and flavour will be all the better for it.\nTo make the icing, put the butter and half the icing sugar in a large bowl. Mash together roughly with a spatula, then whizz with an electric hand whisk until smooth. Add the remaining icing sugar, the cream cheese, vanilla bean extract and biscuit spread. Mix again until smooth and evenly mixed. Transfer half the icing to another bowl and set aside. Use the remaining icing to stack the cakes and cover the entire outside in a thin layer – don’t worry about making the cake look too neat at this stage, as any crumbs trapped in the icing will be covered in the final coat. Chill the cake for 30 mins and the remaining icing for 20 mins (remove the icing from the fridge 10 mins before the cake to soften a little).\nWhen the icing on the cake is firm, remove it from the fridge and use the remaining icing to cover the cake. Smooth the sides using a palette knife, but leave peaks and dips on top for your snow scene. Top the cake generously with desiccated coconut, a dusting of sieved icing sugar and some edible glitter, if you like, then decorate the top and sides with gingerbread shapes (see tip). If you’re not eating the cake within a few hours, store it in the fridge, but bring back to room temperature before serving. Wlll keep for 2 days."}
{"text": "To make the cake, place the clementines in a small pan, cover with water and bring to the boil. Reduce the heat to a simmer and cook for 1 hr or until tender. Drain and cool.\nHeat oven to 180C/fan 160C/gas 4. Butter a 20cm springform cake tin and line the base with a disc of buttered baking parchment. Cut the cooked clementines in half and remove any pips. Place in the bowl of a food processor and pulse until finely chopped but not puréed.\nCombine the raisins, sultanas, currants, cherries and brandy in a bowl. Add the clementine pulp and mix well. Cream the butter and sugar together until pale. Add the beaten eggs, a little at a time, mixing well between each addition. In another bowl, combine the spices, ground almonds, polenta and baking powder. Fold into the creamed mixture along with the dried fruit and clementine pulp.\nSpoon into the prepared tin and smooth the top. Bake on the middle shelf of the oven for 30 mins. Reduce the oven temperature to 160C/fan 140C/gas 3 and continue to cook for a further 40 mins. You may need to loosely cover the top of the cake with a sheet of baking parchment for the final 20 mins to prevent it browning too quickly. Cool in the tin for 30 mins before turning out onto a cooling rack.\nTo make the topping, slice the clementines to a 5mm thickness. Tip the sugar into a saucepan with 140ml water and cook over a low heat, stirring often, until the sugar has dissolved. Put the clementine slices in the pan and stir through. To keep the clementines submerged in the syrup, cut out a circle of greaseproof paper to fit into the pan and place over the fruit. Cook over a low heat for 1 hr until glossy and translucent. Remove and spread out over greaseproof paper to cool.\nTo serve, dust the whole cake with icing sugar, then arrange the clementine slices, overlapping, over the top of the cake."}
{"text": "Heat the 50g of butter in a large saucepan until foaming, then lower the heat a little. Sweat the onion and leek with the clove of garlic, a few sprigs of thyme and 2 bay leaves. Add the celeriac and the 2 potatoes and cook for 10 mins more, stirring frequently so the vegetables don’t stick to the pan. Pour over the litre of stock to just about cover, bring to the boil, then simmer gently for 20 mins.\nMeanwhile, in a deep frying pan bring the 500ml of milk and remaining bay leaves to the boil. Lower to a very gentle simmer, slide in the 2 haddock fillets and cover with baking paper. Cook for 3-4 mins until the fish flakes easily. Remove the fish from the milk and flake into a bowl; cover to keep warm.\nWhen the celeriac is tender, pour in the 500ml of cream, bring back to the boil and remove from the heat. Remove the garlic and herb stalks, then blitz until silky smooth using a stick blender. If you want to freeze the soup, stir through the fish at this point. Serve scattered with the flaked haddock and thyme leaves."}
{"text": "Whizz together the flour, icing sugar and butter until they form fine crumbs. With the blades running, add the zest, then the egg and process for a few secs until the mixture forms clumps. If you need to, work in a few trickles of ice cold water, but try and avoid it if you can for the shortest pastry.\nTip onto a very lightly floured surface, knead briefly until smooth, then chill in the fridge for 30 mins or until firm. Can be made up to 3 days ahead or frozen for up to a month.\nLightly dust the work surface with flour, then roll pastry out to approx £1 thickness. Cut out 12 x 8cm rounds with a fluted cutter and press into a 12-hole non-stick bun tin. Re-roll the trimmings to the same thickness and stamp out 12 x 5cm rounds for the tops. If you like, use a star cutter to cut out star shapes in the top of the pies, or simply cut crosses in the middle.\nSpoon about 1 dessertspoon mincemeat into each base, sprinkle with cranberries, then press on the tops. Chill for 20 mins while you heat oven to 190C/fan 170C/gas 5. Can be frozen for up to 1 month at this point.\nBrush the tops with the egg, then bake for 15-20 mins until golden and crisp. Cool for a few mins, then lever out of the tins with a table knife and cool on a wire rack. Store in an airtight container for up to 1 week. Warm gently to serve, dusted with sifted icing sugar."}
{"text": "Fold the custard, clotted cream and ginger syrup together in a bowl until completely combined. Pour this into an ice-cream machine and churn according to machine instructions. (If you don't have an ice-cream machine, put the bowl in the freezer for about 11⁄2 hrs, or until the mixture starts to freeze around the edges. Give it a good stir to break it all up, then repeat.)\nWhen the ice cream is completely churned, mix in the chopped ginger so it speckles the ice cream, then serve in scoops with the Roasted rhubarb."}
{"text": "Heat the oil in a large pan. Add the onions and fry, stirring every now and then, for about 10 mins, until they start to caramelise. Stir in the cloves, then add the cabbage and continue cooking, stirring more frequently this time, until the cabbage starts to soften.\nPour in the stock, add the vinegar and sugar, then cover and cook for 10 mins.\nStir in the cranberries and cook for 10 mins more. Cool and keep in the fridge for up to 4 days, or freeze for 1 month. Thaw in the fridge overnight. Reheat until very hot before serving."}
{"text": "Heat oven to 200C/fan 180C/gas 6. Pour 3 tbsp of the oil into a roasting tin, scatter and roll the vegetables in the oil and season with salt and pepper. Drizzle with the remaining oil. Can be prepared to this stage up to an hour ahead.\nRoast the vegetables for 45-55 mins until tender and golden brown. Brush with butter before serving."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Score the duck breast skin with a sharp knife. This helps release excess fat from the skin as the bird roasts. Season the duck with the sea salt and pepper, then sit it on a rack set in a roasting tray and roast for 1½ hrs. Remove the bird from the oven and pour off the excess fat collected in the tray.\nReturn the duck to the roasting tray, then spoon 3 tbsp of the honey over to cover the breasts and legs. Roast the duck for a further hr, basting with the honey every 10-15 mins. Sprinkle the sesame seeds on top during the final 10 mins of roasting.\nOnce cooked, remove duck from the roasting tray, and allow it to rest for 10-15 mins. Spoon the remaining tbsp of honey over the duck as it rests.\nMeanwhile, make the sauce. Pour off any excess fat from the roasting tin, leaving behind a couple of tbsp of the honey and duck juices. Heat the roasting tray on top of the stove. Once the contents sizzle and become well caramelised, pour in the red wine, then boil for a few mins to reduce by about a third. Pour in the chicken stock (or water and stock cube), then simmer for several mins, also allowing it to slightly reduce to strengthen the flavour. Finish off the sauce (which is quite loose) with the knob of butter (for thicker gravy see 'Try' below). Season with salt and pepper and strain through a fine sieve, if you like.\nNow finsih it in style: Gary say's: I prefer to serve just the half duck on the plate. To do this, remove the duck breasts and legs from the breast bone by cutting either side of the breast bone, following its natural line. Drizzle any excess honey juices over and offer all accompaniments separately."}
{"text": "Put the shallots or button onions in a bowl, cover with boiling water and set aside for 5 mins. Cook the potatoes in a pan of boiling water for 7 mins until tender. Drain and pat dry. Put tomato purée, soy sauce, oil, honey, mustard and seasoning in a bowl, then mix well. Toss the tofu in the marinade. Set aside for at least 10 mins.\nHeat the grill. Drain and peel shallots or onions, then cook in boiling water for 3 mins. Drain well. Thread the tofu, shallots, potatoes, courgette and pepper on to 8 x 20cm skewers. Grill for 10 mins, turning frequently and brushing with remaining marinade before serving."}
{"text": "Cut away and discard any large sinews from the livers, then set the livers aside. Heat about a third of the butter in a large frying pan, then gently fry the shallots and garlic for 3-4 mins unti l soft. Turn up the heat, add the livers, then fry until just browned on all sides. Add the brandy and port, boil down as quickly as possible – if the sauce catches light for an instant, then all the better. Remove the pan from the heat and leave to cool completely.\nSeason the livers generously, then tip the contents of the pan into a food processor with the tomato purée and remaining butter, and blitz until smooth. Push the mixture through a fine sieve into a bowl, taste for seasoning, then tip into a serving dish, banging the dish down on the tabletop to smooth out the surface. Place in the fridge to set.\nOnce the mixture has set, make the topping. Gently melt the butter in a small pan or in a bowl in the microwave, then leave for a min to settle and separate. Pour the yellow butter that has risen to the top into another bowl and discard the milky liquid. Leave the yellow butter to cool slightly, then mix in the thyme and peppercorns. Pour the mixture over the parfait and leave to set in the fridge. Serve with plenty of toast, sliced gherkins and chutney. Will keep for 2 days in the fridge."}
{"text": "To make the cinnamon butter, mix all the ingredients together, wrap in cling film, shape into a log and chill. You can make this up to 3 days ahead.\nMix the flour, bicarb and a pinch of salt in a bowl. Make a well in the centre, then gradually whisk in the eggs, followed by the buttermilk, milk and melted butter. Once the mixture is smooth, stir in the grated apples and cranberries.\nMelt a little more butter in a non-stick pan or wipe with sunflower oil. When hot, add 1-3 small ladles of batter to the pan to make 1-3 small pancakes (depending on the size of your pan). Cook for 2-3 mins until bubbles appear and the underneaths are set and golden. Flip and cook for a few mins more. Transfer pancakes to a plate, cover with baking parchment and keep warm in a low oven. Cook the remaining pancakes.\nTo serve, stack pancakes on plates, top with a good knob of cinnamon butter and drizzle with maple syrup."}
{"text": "Heat oven to 220C/200C fan/gas 7. Mix the rock salt, peppercorns, garlic, rosemary, parsley and olive oil. Rub this mixture all over the beef rib then place in a roasting tin. Put in the oven and cook for 30 mins, then turn the oven down to 160C/140C fan/gas 3 and cook for a further 1 hr 20 mins. Remove from the oven, transfer the beef to a board, cover with tin foil and rest for 30 mins before carving.\nWhile the beef rests, make the gravy. Pour off all but 2 tbsp of fat from the roasting tin and reserve any juices. Fry the onions in the roasting tin over a medium heat for about 10 mins, then add the wine, stock and reserved juices. Keep cooking for a further 10 mins to reduce to a thick sauce, season well and serve alongside the roast beef."}
{"text": "Preheat oven to fan 200C/conventional 220C/gas 7. Lay pastry on a floured work surface. Using a round 7.5cm round pastry cutter, cut out as many circles as possible.\nSit them on oiled baking sheets and score a circle about 2.5cm in from the edge of each disc by pressing gently with a 5cm cutter. Pierce the middle of each with a fork, brush with egg and top with a little cranberry sauce or chutney.\nSlice the cheese 5mm thick so you have a slice per disc (discard end rinds). Lay a slice on each tartlet, then top with thyme leaves, a drizzle of oil and a twist of black pepper.\nBake for 10-15 minutes until the cheese is golden and the pastry crispy. Cool for 5 minutes and serve warm, garnished with rocket leaves."}
{"text": "Mix the mincemeat, nuts, cinnamon and maple syrup together; set aside. Lightly flour a work surface, then roll pastry out to a rectangle measuring 40 x 30cm. Trim the edges with a sharp knife.\nCarefully position the pastry with one of the long edges facing you. Spread two-thirds of the mincemeat mix over the pastry, then fold the two shorter edges over to meet in the middle. Spread the rest of the mincemeat over the folded pastry and bring the outside ends over again to join in the centre. Turn the pastry over, lift onto a non-stick baking sheet, then gently squeeze down the length to make an even-shaped log, with tight folds. Chill in the freezer for 10 mins. Heat oven to 220C/fan 200C/gas 7.\nRemove the baking sheet from the freezer. Cut the pastry into 1cm slices and arrange on baking sheets, spaced apart. Cook on the top shelf for 15 mins until risen and golden brown. Cool on a wire rack and serve dusted with icing sugar."}
{"text": "Make the marzipan: mix the almonds and sugars until well combined. Add the egg and almond essence and mix to a stiff paste, using your hands to press the mixture together. Knead the marzipan briefly on a surface dusted with icing sugar, then roll out to a thickness of about 1cm.\nLine a baking sheet with baking parchment, then carefully set marzipan on top. Leave to set for 1 hr. Beat royal icing and lemon juice together, then spread evenly over the marzipan. Leave to dry overnight.\nCut the iced marzipan with small cutters and press a piece of crystallised fruit into the centre of each. Pack into boxes interleaved with baking parchment."}
{"text": "To make the filling, preheat the oven to 220C/gas 7/fan 200C. Slice your potato leftovers as best you can, then blanch the leek in boiling water for 3 minutes and drain. If you don’t have any leftovers, peel, halve and thickly slice a baking potato, then boil for 8 minutes, adding the sliced leek for the last 3 minutes. Drain. In a large bowl, mix the potato, leek, horseradish sauce, crème fraîche, ham and thyme, mushing up the potato slightly, then season well.\nTo make the pie, unroll the pastry rectangle onto a baking sheet. Pile the filling along the length of one half of the pastry, leaving a small gap on the outside edge. Brush milk round the edges of the pastry. Fold the uncovered side over the filling, then press the pastry edges together well, using the prongs of a fork, to seal. Make a few 6cm diagonal slashes in the top. (The pie can now be frozen for up to a month.)\nTo bake the pie, brush the pie with the remaining milk and bake for 30 minutes until golden brown. Leave to relax for a couple of minutes then cut into slices and serve with a green salad."}
{"text": "Preheat the oven to 160C/Gas 4/fan oven 140C. Rub the butter all over the surface of a gratin dish, about 18x28cm/7x11in. Peel and slice the potatoes to a width of 3mm/1⁄8in. Lay the slices on a clean tea towel and pat dry. Keep them covered with the tea towel while you prepare the rest of the ingredients.\nPour the milk and cream into a saucepan. Add the garlic, thyme and shallot (if using). Slowly heat the milk and, just as it is about to reach boiling point and you see bubbles appearing around the edge of the pan, remove it from the heat. Strain the liquid into a large jug, sprinkle in the nutmeg and keep warm.\nLayer half the potato slices in the dish, slightly overlapping the slices and sprinkling with a little salt and freshly ground pepper between each layer. You don’t have to be too neat with the lower layers, but keep some of your best slices for later, so the top looks good.\nPour half the hot milk and cream over the potatoes, then finish off layering the rest of the potatoes (arranging them a bit more carefully this time). Pour over the rest of the hot milk and cream. Scatter the cheese over the top and bake for about one hour, until golden and tender. Leave the dish to stand for about 5 minutes, then serve sprinkled with a few fresh thyme leaves."}
{"text": "Melt the chocolate in a bowl over a pan of simmering water. Once melted, add the remaining ingredients.\nRoll into walnut-size balls with your hands and pop into the fridge on a plate to chill and set. Once set, roll in cocoa or icing sugar. Will keep in the fridge for 1 week."}
{"text": "Peel and coarsely grate the potatoes and parsnips – if you’re using a food processor, attach the medium grater. Squeeze out as much liquid as possible with your hands and put them in a bowl.\nStir in the onion, garlic, egg and season if you like. Divide the mixture into six and roughly shape into flat cakes. Heat 2 tbsp of the oil in a large non-stick frying pan and fry three of the cakes on a low heat for 4-5 mins on each side until golden and tender. Transfer to kitchen paper with a slotted spoon and leave to cool while frying the remainder, adding remaining oil as necessary. Meanwhile grill the bacon and tomatoes, poach the eggs and serve alongside."}
{"text": "Place all the ingredients except for the apples in a large saucepan and season. Place over a medium heat, bring to the boil, then turn down the heat and simmer for 30 mins. Add the apples, then continue cooking for 15 mins until tender."}
{"text": "Lightly beat the egg white in a shallow bowl and spread out the caster sugar on a baking sheet or tray. Dip the grapes and the holly or bay leaves into the egg white, or use a paintbrush. Shake off the excess, then coat in the sugar. Set aside to dry for at least 10 mins, ideally about 30 mins.\nWhen you’re ready to decorate, make the frosting. Put a large bowl over a pan of simmering water, making sure the bottom of the bowl does not touch the water. Put the egg whites and icing sugar into the bowl and whisk for 5-7 mins until you have a thick, very glossy frosting. Use a spatula to clean around the edges of the bowl every so often as you whisk. Scoop the frosting onto the top of the cake and spread it around with a flat-edged knife, swirling as you go to create a snowy effect (see Knowhow, below).\nHalve the clementines, figs and kumquats, then arrange on top of the frosted cake with the physalis, frosted grapes and leaves. Fix a ribbon around the base and leave the cake somewhere cool – but not the fridge – until your guests arrive."}
{"text": "Put the almonds into a small bowl and pour over boiling water to just cover. Leave for 5 mins then drain in a sieve and leave to dry.\nPreheat the oven to 180C/160 C fan/Gas Mark 4. Line a deep loose-based 20cm cake tin with baking parchment.\nPut the butter in a large bowl and beat well until soft. Add the sugar and beat until light and fluffy. Stir in the orange zest and apricot jam.\nSieve together the flour and baking powder. Add the eggs to the creamed butter and sugar, a little at a time, beating well between each addition. If the mixture starts to curdle, stir in a little flour.\nAdd the remaining flour and ground almonds and mix well. Mix in the milk and then add the dried fruit and cherries and mix gently together.\nSpoon the mixture into the prepared tin and spread level using the back of a spoon. Arrange the whole almonds close together in neat circles on the top of the cake. Bake in the oven for 45 mins.\nLower the oven temperature to 160C/140 C fan/Gas Mark 3 and cook for a further 60–80 minutes. Check the cake after 50 minutes by inserting a wooden or metal skewer into the cake. When it’s done it should have just a few crumbs attached. Check every 10 minutes - it’s important not to overcook this cake so the centre will be a little soft.\nWhen cooked, remove the cake briefly from the oven, put the milk and sugar into a small pan and heat gently until the sugar has dissolved. Brush over the top of the cake and return the cake to the oven for 2-3 mins. Remove and allow the cake to cool in the tin. When quite cold remove from the tin and wrap in foil and keep for at least 2 days before cutting."}
{"text": "Heat a saucepan and add a little vegetable oil. Fry the onion and garlic until both are lightly browned. Chuck in all the spices and let them sizzle for 1 min, then add the coconut milk and the stock. Allow this to reduce until you have a thick, rich, creamy, spicy onion mixture in the pan. Pour into a bowl, leave to cool, then stir through the mayonnaise. Can be kept in the fridge for up to a week.\nTo make the chapattis, put the flour and 1 tsp salt into a large bowl. Pour in the oil and rub into the flour with your fingertips. Pour in 250ml lukewarm water, mix to form a firm dough, then knead for about 10 mins until springy. Place back in the bowl and leave to rest for 30 mins. Cut into 8 walnut-size pieces and roll out into thin discs on a lightly floured surface. Pan-fry the discs in a dry heavy-based pan for about 1 min on each side. They should colour and blister – use a clean cloth to press flat in the pan while cooking.\nTo serve, mix the curried mayonnaise with the turkey. Toast the desiccated coconut in a dry pan until golden. Sprinkle over the turkey along with some coriander, then serve alongside the chapattis with some tomato, sliced onion and lettuce, if you like."}
{"text": "First, make the sauce. Heat the butter in a saucepan, add the leeks and thyme and cook very gently for 10-15 mins until soft but not coloured. Stir in the flour and cook to a sandy paste, then splash in the vinegar and bubble for a moment. Pour in the stock and bring to the boil, then add the cream and simmer until you have a thick sauce. Stir through the mustard, tarragon and chopped turkey, turn off the heat and leave to cool. Set aside. \nTo make the pastry, tip the flour into a \n with the sage and 1 tsp salt. Add the butter and suet, and whizz to fine crumbs. With the motor running, slowly pour in 150ml cold water until the pastry just comes together. Tip onto a lightly floured surface and bring together into a dough. Cut just over a third of the pastry and cover while you roll out the rest to line an oiled 20cm springform tin, leaving an overhang.\nLayer some sliced ham or turkey on the bottom, then spoon and spread over a thin layer of sauce and repeat the layers until you get to the top of the tin, finishing with a final layer of meat, then press down gently. Cut away another small ball of pastry from the remaining third. \n the larger piece until big enough to cover the pie with an overhang. Brush the edge of the pie with egg yolk, then lift on the pastry lid and press the edges to seal before trimming. Crimp all the way round. Cut a little hole in the middle of the pastry to let steam escape. Brush all over with more yolk and use the last bit of pastry to decorate the top. \nWhen you're ready to bake, heat oven to 200C/180C fan/gas 6 with a baking sheet in it. Sit the pie on the hot sheet and bake for 45-50 mins. Leave until warm, remove from the tin and cut into thick wedges or cool and eat cold."}
{"text": "Expose and cut out the wishbone. This makes the duck easier to carve once cooked. A butcher can do this for you.\nHeat oven to 240C/220C fan/gas 9. Lightly score the skin on the duck all over, and make a deep cut from inside the body into each leg.\nSeason the duck well. Heat an ovenproof frying pan over a low heat. Place the duck on its side with the thigh touching the pan for 15 mins. Turn and cook on the other side for 15 mins more.\nTurn the duck breast-side down, then transfer the pan to the oven and cook for 5 mins. Drain the fat from the pan, turn the duck onto its back and continue to cook for 15 minutes.\nRemove the orange wedges from the pan and set aside. Squeeze the juice from the remaining orange halves into the hot pan and reduce by half. Add the marmalade, take off the heat, add 1 tbsp water and stir together.\nAfter 15 mins of roasting, brush the marmalade glaze over and continue to roast for a final 10 mins. Rest for 20 mins.\nCarve by cutting the leg and thigh away, then separating the leg from the thigh. Carve slices of breast and serve with the orange wedges to squeeze over."}
{"text": "1 Mix the sugar with 1 tsp salt and plenty of black pepper. In a large, heavy-bottomed pan, layer up a handful of the cabbage, onions, apples and beetroot with the spices and sprinkle with some of the sugar, repeating with the layers until all the ingredients are used up.\nMix the wine, vinegar and stock cube, pour over the cabbage and dot the butter on top. Tightly cover the pan and bring to the boil over a medium heat. When you can hear it boiling, turn down the heat to low and simmer for 30 mins. Stir well – the mixture will have reduced and softened – then cover and simmer for 15-30 mins more depending on how soft you like it."}
{"text": "Fold the crème fraîche with the horseradish and vodka, if using, with a little seasoning. Chill.\nIn a bowl, mix the vinegar, olive oil and honey. Toss half the dressing through the beetroot and chill until ready to serve.\nBefore serving, divide the slices of salmon between 8 plates, then top with a spoonful of the crème fraîche and bring up the sides of the salmon to make a ‘flower’. Arrange the salad and beetroot round the salmon, scatter with the dill. Grind over some black pepper, drizzle with the remaining dressing and serve with toast, if you like."}
{"text": "Heat oven to 190C/170C fan/gas 5. Heat the oil in a large frying pan, then fry the onions and two-thirds of the bacon, covered, for 10 mins until the onions are very soft. Once cool enough to handle, mix with the chopped chestnuts, sausagemeat, breadcrumbs, thyme leaves and egg, and season really well. Take out 250g for stuffing the turkey.\nButter a 23cm round tin, scoop in the remaining stuffing, press down a little, then top with the remaining bacon. Put onto a baking sheet, cover with foil and bake for 15 mins.\nUncover, grind over some fresh black pepper, then cook for 35 mins more until the bacon is turning golden. With 5 mins to go, top with the chestnut halves, if you like, brushing them with a little butter. Cut into wedges to serve."}
{"text": "Roll out the pastry and use it to line a 23cm tart ring, then chill for at least 20 mins. Heat oven to 180C/fan160C/gas 4. Line the tart with baking parchment and baking beans, then bake for 15 mins. Remove the parchment, bake for a further 5-10 mins until golden, then remove from the oven and reduce the temperature to 140C/fan 120C/gas 1.\nWhile the case is cooking, cut the passion fruits in half, scoop out the flesh into a bowl, then blitz with a hand blender. Push the pulp through sieve and mix the juice with the lime zest and juice. Beat the sugar and yolks together until pale, then beat in the cream and fruit juice. Carefully pour the custard into the tart case, then bake for 40 mins, until set with a very slight wobble. Remove the tart from the oven, then leave to cool completely.\nYou can now either serve the tart as it is, or try a chef’s tip and dust it with icing sugar, then caramelise the top with a blowtorch."}
{"text": "Heat oven to 180C/160C fan/gas 4. Par-boil the potato slices for 2-3 mins. Drain and set aside in a large bowl.\nGently fry the onion in the oil for 10 mins until lightly golden. Cool slightly, then stir in the cream, crème fraîche, herbs, zest and plenty of seasoning. Pour over the potatoes and mix very gently.\nRoll out one pack of pastry on a lightly floured surface to a 35 x 35cm, then lay on a large baking sheet. Pack ¼ of the potato mixture down one side of the pastry, leaving a 5cm border. Arrange ½ of the salmon on top to cover the potato. Cover the salmon with ¼ of the potato. Brush the pastry all the way round with beaten egg and fold over the pastry. Trim the edges and crimp with your fingers, or seal with a fork. Make decorative fish for the top, if you like.\nRoll out the remaining pastry and repeat the process, using up the rest of the potato and salmon. Chill for 30 mins.\nBrush the pastries all over with beaten egg. Bake for 40 mins. Leave to rest for 10 mins if serving hot, or serve cold."}
{"text": "Preheat the oven to 180C/gas 4/fan 160C and butter a shallow ovenproof dish. Layer the potatoes, then the parsnip in the bottom of the dish with two of the sliced garlic cloves and sprinkle over a little salt and half the rosemary. It’s best to keep the potatoes buried under the other vegetables because they go black if they are on top of the gratin.\nPour the cream and milk into a large saucepan, add the rest of the rosemary and garlic, the carrots and a little seasoning. Bring to the boil, then turn the heat to the lowest it will go and simmer for 3 minutes.\nPour the carrots and cream over the other vegetables, and spread the carrots out. Sprinkle over the parmesan, cover with foil and bake for 40 minutes. Remove the foil and bake a further 20 minutes until golden and bubbly."}
{"text": "Heat oven to 200C/180C fan/gas 6. Bring a large pan of salted water to the boil, add potatoes and bay leaves, bring back to the boil and simmer for 10-12 mins until just tender.\nDrain the potatoes and leave to steam in a colander. Return the pan to the heat, add butter and melt gently until it turns a nutty brown colour. Remove from the heat, stir through the potatoes (don’t worry if a few break up) and bay leaves, and leave to absorb for a few mins.\nMeanwhile, heat a roasting tin in the oven, tip the potatoes in and season well. Roast for 30-35 mins until golden and crisp, turning and basting halfway through. Transfer to a dish and pour over any buttery juices from the tin."}
{"text": "Up to 2 hrs ahead, separate the chicory into boat-shaped leaves and trim the ends so that they are all roughly the same size. You will probably get about eight or nine decent-sized leaves from each head of chicory. As the leaves get closer to the heart of the chicory, they will be too small to use for canapés, so save them to add to wintry salads.\nPeel the carrot, then keep peeling off strips until you have as many as the number of chicory leaves.\nDrop spoonfuls of hummus onto the chicory, then add a carrot curl and an olive to each. They’ll keep in the fridge for about 2 hours."}
{"text": "Using a swivel vegetable peeler, remove the skin from a large, straight cucumber. Then cut long, thin strips of flesh using the same peeler, like flat noodles. Mix in a bowl with seasoning and a light sprinkling of rice wine vinegar."}
{"text": "Combine all the spices and ½ tbsp salt together in a pestle and mortar. Give everything a good grind, keeping a little of its coarseness. Rub the oil and then the ground spices all over the beef and massage in well. Cover and chill overnight to marinate.\nNext day, heat oven to 190C/170C fan/gas 5. Weigh your joint and roast for 10 mins per 450g for rare meat and 15 mins per 450g for medium, plus an extra 20 mins. Cover and rest for 20 mins while you finish the salads, then slice and serve. Alternatively, roast the beef in the morning and serve at room temperature for dinner."}
{"text": "Tip the sprouts and carrots into a pan and cover with boiling water. Sprinkle in the stock cube, add the butter and bring to the boil.\nSimmer for 8-10 mins until the veg are tender. Add peas and cook a few mins more.\nRest the veg in the stock until you want to make the gravy, then drain over the roasting tin."}
{"text": "Bring a large pan of water to the boil, add spring greens and cook for about 5 mins until tender, then drain well.\nMeanwhile, heat a non-stick frying pan, add bacon and cook until crisp. Tip in the greens, toss and warm through. Grate over nutmeg, season, and serve."}
{"text": "To make the pastry, put the flour, butter and cayenne pepper into a food processor, then whizz into fine breadcrumbs. sprinkle the egg and water mixture onto the flour, then pulse again until the mixture begins to come together. tip the mixture onto a board and gently squeeze the pastry until it begins to come together in a ball, adding more water if it feels dry.\nHeat oven to 190C/fan 170C/gas 5. roll the pastry into a large a4-sized rectangle, roughly 20 x 30cm. Brush the sheet with the beaten egg and cut in half widthways. Sprinkle one half with the Parmesan and the second half with poppy and caraway seeds. lightly run the rolling pin across the top to press the cheese and the seeds into the pastry. Cut each half into 12-15 sticks. arrange on a baking sheet and chill for 10 mins.\nBake for 8-10 mins until golden brown, then cool for 5 mins before lifting onto a wire rack."}
{"text": "Heat half the oil in a wok or frying pan. Add the eggs, swirl to coat the base of the pan and allow to set to an omelette, flip and cook for 1-2 mins. Once cooked, remove, shred and set aside. Add the remaining oil to the pan, then stir-fry the chilli, if using, and spring onions for 1 min.\nAdd the remaining ingredients and the egg, and heat through, stirring, until piping hot. Serve immediately with some extra soy and sweet chilli sauce, if you like."}
{"text": "Heat the oil in a large pan over a medium heat and add the celeriac, shallots and garlic. Gently fry for a few mins, until they soften without colouring. Add the white wine, bring everything to the boil and reduce the liquid by half. Add the chicken stock and nutmeg, bring to the boil again, then reduce the heat and simmer for 10-15 mins or until celeriac is tender. Remove from the heat and cool for 5 mins.\nTransfer the soup to a food processor and blend until smooth. Pour the soup back into the pan, add the cream and generously season with salt and freshly ground pepper. Reheat gently while you finish everything else.\nIn a large frying pan, fry the black pudding until crisp. Set aside on kitchen paper to soak up any fat. Wipe out the pan.\nSeason the scallops. Heat the frying pan again until hot and add the butter. When it is foaming, add the scallops and sear for 1 min on each side, or until just cooked through, then place on a warm plate. To serve, pour the soup into 8 bowls, top each with 3 scallops and sprinkle with black pudding."}
{"text": "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.\nBlitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.\nTip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds."}
{"text": "Heat the oil in a large saucepan and add the onion. Cook over a gentle heat for 8-10 mins until the onion softens. Add the cauliflower, milk and stock. Bring to a simmer, cooking for 10-12 mins until the cauliflower is tender.\nAdd the cream, season well and bring back to the boil. Take off the heat, throw in the chestnuts and blend with a hand blender until smooth. Taste and add more seasoning, if you like. To serve, top with shaved Parmesan, black pepper and a drizzle of olive oil."}
{"text": "Heat oven to 180C/160C fan/gas 4 and grease a shallow baking dish with butter (I used a 20 x 30cm dish). Pour the milk and cream into a large saucepan, add the garlic, tip in the potatoes and bring to the boil. Remove from the heat to let the garlic infuse and the potatoes cool a little while you cook the bacon.\nHeat the oil in a frying pan and add the lardons. Cook on a low-medium heat for 10 mins until they are turning crispy.\nUsing a slotted spoon, start layering the potatoes onto the base of the dish until completely covered (remove the garlic cloves when you spot them). Spoon over some of the cream mixture, a little cheddar, Parmesan and Gruyère, and scatter on some of the bacon. Season well and repeat until you have used up all the potato. Pour over any remaining cream and scatter with the remaining cheese. Reserve some of the bacon for topping later.\nCover with foil and cook in the oven for 1 hr. Remove the foil and cook for a further 30 mins until the potatoes are cooked through (insert a skewer or knife and check there is no resistance) and the topping is golden. Scatter with the remaining bacon for the final 5 mins of cooking."}
{"text": "Heat oven to 200C/180C fan/gas 6. Butter 6 individual puddings basins or dariole moulds and line the bottom of each with a small circle of baking parchment. Sit them in a deep roasting tin and boil the kettle.\nPlace the butter, flour, sugar and zests and eggs into a bowl with a pinch of salt. Whisk with an electric hand whisk until just combined. Stir in the dried fruit, then divide between the moulds. Carefully pour hot water from the kettle into the tin until it comes about one-third to halfway up the sides of the moulds. Bake for 25-30 mins until a skewer pushed in comes out clean. Serve straight away. If making ahead, leave the puds to cool, cover for up to a day, then turn out of the moulds into a microwave-proof dish and microwave, three at a time, for 1-2 mins on High until hot. Turn out the puddings, pour over some of the Nutmeg custard (see recipe, below) and add a grating of nutmeg, if you like."}
{"text": "Heat oil in a large frying pan. When the pan is really hot, tip in the beef and pepper, then cook for a few mins until lightly browned and the beef is cooked through. Tip in the garlic, ginger and sesame seeds, then cook for 1-2 mins more, stirring often until they start to turn golden.\nPour over the soy sauce and 2 tbsp water, let it bubble down a bit until it starts to look syrupy, then drizzle with the sesame oil. Separate the leaves from the lettuces and arrange on a plate. Spoon a little of the beef mixture into each leaf, drizzle with pan juices and serve warm."}
{"text": "Melt the butter in a large saucepan and throw in the potatoes and some seasoning. Colour gently all over for 10 mins or so.\nWhen the potatoes are nicely golden, add the bay leaves and milk, making sure potatoes are covered. Gently simmer for 20 mins until the potatoes are cooked through. Turn off the heat and leave to infuse in the milk until ready to serve. Drain and serve."}
{"text": "Heat a large non-stick pan over a medium heat and toast the coriander and cumin seeds for 1-2 mins until fragrant. Add the cinnamon, olive oil, aubergine and shallots. Coat the veg in the spices and cook on a medium-low heat for about 10 mins until the aubergine has softened slightly.\nAdd the harissa and peppers. Give everything a good stir, then add the tomatoes and crumble over the stock cube. Simmer, uncovered, for 20 mins until the veg is tender and the mixture is nice and thick.\nStir through the turkey meat and season well. Set aside to cool.\nHeat oven to 200C/180C fan/gas 6 and grease a 23cm springform tin with a little butter. Lay two sheets of filo over the base of the tin and brush with the melted butter. Cross over another two layers of filo and brush again with butter. Repeat once more, then put the cooled filling in the centre. Using the remaining four pastry sheets, cover the filling and brush with more melted butter. Scrunch the top of the pie together and bake for 30-35 mins.\nRemove from the oven and scatter the pie with the flaked almonds. Cook for a final 10 mins until the pie is golden and piping hot. Serve straight away."}
{"text": "Butter a 1lb pudding basin, then line the base with a circle of greaseproof paper. To prepare the steamer, place an upturned saucer into a large saucepan big enough to fit the pudding basin. This will act as a trivet to stop the base of the pudding coming into direct contact with the heat. Put the kettle on.\nIn a bowl, beat the butter and sugar until light and creamy. Slowly add the beaten eggs, mixing well between each addition. Add the vanilla and melted chocolate and mix everything well. Sieve the cocoa, flour and baking powder into the mixture, then fold in the ground almonds, milk and chocolate buttons.\nFill the pudding basin with the mixture. Cut out large circles of greaseproof paper and tin foil, big enough to fit over the basin with a 2-in overhang. Lightly butter the greaseproof and lay this on top of the foil, buttered side up. Make a pleat down the centre of the two, then place, paper side down, over the pudding. Turn the foil under to cover the paper. Secure well with string and lower the pudding into the steamer. Add enough boiling water from the kettle to come halfway up the basin but not touch the paper. Cover with a lid and turn the heat down to a gentle simmer.\nAfter 1 hr 15 mins, remove the lid and check the pudding is cooked by inserting a metal skewer. There should be no raw cake mixture on the skewer.\nMeanwhile, bubble the orange juice, jam, star anise and dried fruit together until syrupy. Stir in the maraschino and canned cherries.\nCarefully turn the pudding out on to a serving plate. Pile some fruit from the sauce on top plus the star anise to decorate, then spoon over some warm syrup. Pour the remaining syrup into a jug and serve alongside."}
{"text": "Heat oven to 180C/160C fan/gas 4. Put a large baking tray on the middle shelf to heat up. On a floured surface, roll out the pastry to a 30cm square. Trim the edges, lightly score a 1cm border around the edge of the tart, and prick the centre all over with a fork. Transfer the pastry base to a sheet of baking parchment.\nMix the chutney and harissa, and spread over the middle of the pastry. Arrange the squash in one layer over the top, then season. Put the tart on the hot baking tray and bake for 30 mins.\nRemove the tart, scatter over the feta and pine nuts, and bake for 20 mins more. Scatter over the mint and rocket to serve."}
{"text": "Heat oven to 180C/160C fan/gas 4. Melt half the butter with the oil in a sauté pan. Add the onion and cook for 10 mins until softened. Remove to a bowl.\nAdd a few handfuls of spinach to the pan and cook for a few mins until it has wilted down. Remove from the heat and drain in a colander. Repeat until all the spinach is cooked. Press with the back of a spoon to remove any excess liquid. Now roughly chop and tip into the bowl with the onion. Stir in the nutmeg, ricotta, egg yolks, Parmesan and some seasoning and mix well.\nRoll out one pack of pastry on a lightly floured surface to a 25 x 30cm rectangle, then lay on a large baking sheet. With the longest side facing you, pack the spinach mixture down the middle of the pastry, leaving a 5cm border all the way around. Brush the pastry all the way round with some beaten egg.\nRoll out the second pack of pastry to a rectangle slightly larger than the first. Drape over the top and gently press down the edges to seal both pastry layers together. Trim the edges to neaten and crimp with your fingers, or seal down with a fork.\nBrush all over with beaten egg and, if you like, lightly score the pastry with the back of a knife in a criss-cross fashion, making sure you don’t cut all the way through. Bake for 40 mins. Leave to rest for 10 mins before serving."}
{"text": "Heat the oil in a frying pan with high sides, scatter in the cumin seeds and toast a little, then add the onion and fry until softened, around 5 mins. Add the garlic and chilli and fry for 1 min. Tip the sprouts into the pan and cook for 5 mins until softened, then add the spinach – you may have to do this in batches. Cook until the spinach has wilted down, then squeeze in the lemon juice to taste. Season well.\nUse a spoon to create six holes in the greens to crack the eggs into. Break the eggs into the holes, cover the pan with a lid and cook for 5-7 mins until the eggs have set, but the yolk remains runny. Sprinkle over the coriander and serve immediately, drizzled with natural yogurt and sriracha, and with sourdough on the side."}
{"text": "Cook peas in boiling water for 1 min. Drain and rinse under cold water. Toss with ham, leaves, spring onions, potatoes and two-thirds of mint. Mix remaining mint with yogurt and sugar. Drizzle over salad."}
{"text": "To make the brine, heat 200ml of the water, salt, honey or sugar and a couple of thyme sprigs in a small pan. When the salt has dissolved, stir together with the remaining water. Place the turkey in a bowl and pour over the brine. Cover and chill for 4-8 hrs.\nFor the stuffing, heat a knob of the butter in a frying pan. When melted, add the shallot and fry for a couple of mins until softened. Add the mushrooms and fry for 5 mins until they start to turn golden. Pour over the madeira, add the chestnuts and the leaves from 1 thyme sprig. Cook for 10 mins more until all the liquid has evaporated. Drizzle with the truffle oil and leave to cool, then mix together with the remaining butter.\nRemove the turkey from the brine and discard the liquid. Use kitchen paper to gently pat the meat until it’s dry all over, then use your fingers or a spoon to gently ease under the skin of the bird, making a pocket between its flesh and skin. Smear the truffle butter all over the flesh, following the contours of the breast. Brush a little more butter over the skin, then place in a roasting tin. Can chill at this stage up to 1 day ahead.\nHeat oven to 200C/fan 180C/gas 6. Roast for 1 hr (about 40 mins per kg). Halfway through cooking, baste with the juices and loosely cover with foil if the skin is browning. Check that the turkey is done by piercing the thickest part with a skewer – the juices should run clear. Remove from the tin and leave to rest, covered loosely with foil, for 10 mins.\nWhile the turkey is resting, make the gravy. Pour away any excess fat from the roasting tin, then place the tin over a medium heat on the hob. Tip in the shallot, then cook for a couple of mins, stirring often. When the shallot has softened, sprinkle over the flour and mix through. Slowly pour in the madeira, scraping up any caramelised cooking juices. If the gravy starts to turn lumpy, quickly whisk out any lumps. Bring to the boil and simmer until reduced by half, then pour in the chicken stock. Simmer for 5-10 mins until lightly thickened. Strain before serving, if you like."}
{"text": "Cover the cake and set aside. Knead the 500g icing for the stars and roll out to 5mm thick on a surface dusted with icing sugar. Dust with edible lustre, then rub it in with your fingertips. Stamp 20 stars out of the icing using one 6cm cutter, or use two different-size cutters if you have them. Leave to dry overnight.\nIf you’re putting a ribbon around the cake, do this now. Start building up the hardened stars – start with three in a triangle shape, pushing the points into the icing on the cake for stability. Build on this basic frame, letting the stars support each other. Lay a few stars around the base of the stack. Cake can be iced up to a week ahead.\nTO COVER THE CAKE: To cover a cake with marzipan, first brush the cake all over with a thin layer of warmed apricot jam. Dust the work surface with icing sugar, then roll out the marzipan evenly until you have a 5mm-1cm thick round, about 40cm across for a 20cm cake. Lift over the cake, using a rolling pin to help, then smooth with your hands and trim off the excess. Leave to dry overnight or for a few hours. Lightly brush the marzipan all over with cooled, boiled water. Roll the icing out as you did the marzipan, then smooth with your hands, trim off the excess and leave to dry."}
{"text": "Heat oven to 160C/fan 140C/gas 3. Grease and double-line the base and sides of a deep, 15cm cake tin. Wrap a double layer of greaseproof or brown paper around the outside of the tin, too, then secure with string.\nUsing an electric whisk or a tabletop mixer, cream the butter and sugar together until fluffy and light. Beat in the eggs gradually. In a small bowl, mix the orange flower water with the zest and juice of the orange and lemon. Fold the flour, then dried fruit, pistachioes and ginger into the creamed mix, followed by the juice and zest mix.\nSpoon the mix into the prepared tin and bake for 30 mins, then turn oven down to 150C/ fan 130C/gas 2 and bake for another 1 hr 45 mins until risen, golden and an inserted skewer comes out clean. Leave to cool for 15 mins before transferring to a wire rack to cool completely.\nThe cake will keep well wrapped in a cool place for up to 1 month."}
{"text": "Put the veg in a large pan, cover with water and bring to the boil, then put a lid on the pan and cook for 15 mins until really tender. Drain and leave to steam-dry for a few mins. Once completely dry, return to the pan and mash with the cream, nutmeg, cinnamon and plenty of seasoning. Transfer the mash to an ovenproof gratin dish, sprinkle with the breadcrumbs and drizzle with a little olive oil. \n.\nBake at 220C/200C fan/gas 7 for 35 mins until the top is golden and crunchy, and the mash is piping hot."}
{"text": "Mix the feta, artichoke, lemon and mint together.\nTake a piece of the filo pastry, brush all over with melted butter and cut into 7cm-wide strips. Cover the remaining pastry with a damp tea towel to keep fresh. Put 1 tbsp of the mixture at the bottom of the sheet of pastry and fold this edge up to meet one side to start the shape of a triangle. Fold the bottom point of the pastry up, sealing in the filling, then complete the triangle by folding again in the opposite direction. Keep folding until you reach the top and lightly brush with more melted butter. Repeat until you have finished the filling. Chill the triangles until you are ready to cook.\nHeat the oven to 200C/fan 180C/gas 6 and put a baking sheet in the oven.\nPut the triangles on the hot baking tray and cook for 15 minutes or until golden brown."}
{"text": "Put the butter, hazelnuts, vanilla extract and 85g of the icing sugar in a food processor and whizz to a paste. Add 1 tsp of the ground cloves and the flour, and pulse together until a dough forms.\nHeat oven to 200C/180C fan/gas 6. Line a couple of baking sheets with baking parchment. Roll the dough into walnut- sized balls and arrange on the baking sheets. Use the back of a fork to lightly squash each ball, then bake for 12-15 mins until they turn a pale biscuit colour – if they get too brown, they will become dry.\nMix the remaining icing sugar and ground cloves, then sieve thickly over the hot biscuits. Leave to cool slightly before eating just warm, or cool."}
{"text": "Cover the cauliflower in cold water, add the stock cube, then bring up to the boil. Add the broccoli and cook for 1 min, then drain (reserving some of the stock) and allow to steam-dry for 1-2 mins. (The veg shouldn’t be tender.)\nHeat oven to 200C/180C fan/gas 6. Mix together the crème fraîche, mustard, wine (if using), nutmeg and some seasoning. Add the veg and mix well. Tip into an ovenproof dish, scatter with the breadcrumbs and bake for 30 mins until golden and crisp on the top."}
{"text": "Mix sugar with ginger, allspice and cinnamon. Spoon into a jar and pack down tightly. Add a layer of crystallised ginger. Mix flour with baking powder and bicarbonate of soda and spoon on top of the ginger. Put on the lid, decorate with ribbons and a cookie cutter.\nLabel with cooking instructions: Mix 150g melted butter with 1 tbsp golden syrup and 1 egg yolk. Add to the dry ingredients, mix well, then knead to a dough. Chill for 15 mins then roll out. Cut into biscuits and bake at 200C/180C fan/gas 6 for 8-10 mins. Cool on a wire rack."}
{"text": "Sterilise a 500g jar (see tip). Oil your hands well, then break the goat’s cheese into 4 pieces and roll into balls. Place the cheese in the jar, then pack the lemon zest, thyme and chilli around the cheese. Scatter over the fennel seeds and pour over the oil. Chill and leave to marinate for 2 days. Store in the fridge, and eat within 2 weeks."}
{"text": "Boil potatoes until tender. Melt the butter in a shallow pan (ovenproof if you have it), then fry Festive red salad for a few mins to soften. Stir in the well-drained spuds with some seasoning, press down and carry on cooking to crisp the bottom and heat through.\nIf you like, dot the top with a bit more butter and grill to crisp it up. Eat with fried eggs and slices of leftover ham, if you like."}
{"text": "Heat oven to 200C/fan 180C/gas 6 and line a muffin tray with 12 paper cases. Drain the pineapple, reserving the juice, then crush the flesh with a fork. Mix the dry ingredients in a large bowl. Beat the eggs, melted butter and yogurt together and pour into the bowl, along with the carrot and pineapple. Stir quickly, then spoon into muffin cases and bake for 18 mins or until risen and golden. Can be frozen at this stage for up to a month.\nTo decorate, mix the creamed coconut with 5 tbsp pineapple juice and stir in the icing sugar. Put the desiccated coconut onto a plate or tray. Peel the muffins from their cases and put on a rack. Spread the icing over until completely covered (this can get a bit messy), then roll in the coconut. Leave to dry for a few mins. Pipe a carrot on the top of each muffin using the writing icing, with strips of angelica as stalks."}
{"text": "Heat oven to 180C/fan 160C/gas 4. Lightly butter and flour a 23-25cm fluted flan dish or tin (not loose-bottomed). Crush half the digestive biscuits with a rolling pin. Cream the butter and sugar in a food processor until light and fluffy, 2-3 mins, scraping down the sides halfway through. Add the flour, baking powder, ground almonds and crushed digestive biscuits, along with the eggs, then process again just until smooth. Transfer the mix to a bowl.\nBreak the remaining digestive biscuits into chunky crumbs, (see step 1, left). Stir them into the mix (step 2) along with the chopped dates and almonds. Spoon the mix into the flan dish. Bake for 25-30 mins until golden and the tart is just beginning to come away from the sides.\nRemove the tart from the oven and leave it to cool a little, before dusting over icing sugar. Serve warm with cream."}
{"text": "Heat the oven to 200C/fan 180C/gas 6. Tip the garlic, parsley and butter together in a bowl, season generously with black pepper and a pinch of salt, then beat with a wooden spoon or squish through your fingers until everything is combined. The butter can be prepared up to a day ahead and chilled or made two weeks ahead and frozen. Soften before using.\nPlace the turkey crown on a board with the thick part of the breast facing away from you. Use your hands to make two pockets between the skin and the meat, then smear the flavoured butter beneath the skin and all over the breast and work it down so that the breast is completely covered. 3 Tip the new potatoes into a large roasting tray. Sit the turkey on top, skin side up, then roast for 30 mins. Remove from the oven, sit the turkey on a board and give the potatoes a good shake. Then place the turkey back in the tin, spoon over some of the buttery juices and continue to cook for another 40-50 mins until the turkey is dark golden. Transfer the turkey to a board to rest, loosely covered in foil, then continue to cook the potatoes for 20 mins to brown. Use a slotted spoon to scoop the potatoes into a serving dish, reserving the buttery juices in the pan. Put the potatoes to one side and keep warm.\nTo make the cranberry gravy, place the roasting pan on a lowish heat and stir in the flour. Let everything sizzle and brown, then add the cranberry sauce and a splash of port. Sizzle everything for a few mins until really sticky, then stir in the stock, bring to the boil and cook until thick or to your liking, seasoning to taste. If the gravy is on the pale side or a bit too sweet, stir in a splash of soy sauce."}
{"text": "Heat oven to 200C/180C fan/gas 6. Place the bread slices on a large baking tray in a single layer and drizzle over 1 tbsp extra virgin olive oil. Bake for 10-12 mins or until dry, taking care not to let them burn or become too hard.\nHeat the remaining oil in a medium non-stick frying pan and cook the anchovies, garlic and onion for 3-4 mins over a low heat until well softened, stirring until the anchovies break up. Add the tomatoes, purée, capers and chilli flakes, and cook over a low heat for 10-15 mins, stirring regularly, until the sauce is thick. Leave to cool for 15 mins.\nOnce cool, spread a little tomato sauce on each piece of bread and top with half an olive. Sprinkle with the Parmesan, then cover and chill for up to 24 hrs until ready to reheat.\nHeat oven to 200C/180C fan/gas 6. Put the toasts on a parchment-lined baking tray (or two) and bake for 8 mins or until hot throughout. To serve, garnish with basil and a drizzle of extra virgin olive oil."}
{"text": "Heat the butter and oil in a frying pan. Add the onion and fry until soft. Stir in the garlic and mushrooms, season and cook for 5 mins until the mushrooms are soft. Stir in the parsley and cream. Remove from the heat and allow to cool.\nHeat oven to 200C/180C fan/gas 6. Grease a 6-hole muffin tin with butter, then line each hole with a long thin strip of baking parchment. Roll out the pastry on a lightly floured surface and stamp out 6 x 10 cm circles. Press a circle into each hole to line. Roll out the remaining pastry (you may need to re-roll trimmings) and stamp out 6 x 8cm circles.\nDivide the mushroom mix between the pies. Brush the pastry edges with a little egg, top each with a pastry lid and carefully press the pastry edges together to seal.\nBrush with the remaining egg and sprinkle with caraway seeds. Bake for 25-30 mins until golden. Allow to cool in the tin slightly before serving, or cool on a wire rack and keep in airtight containers for up to 1 day. Reheat before serving."}
{"text": "Put the carrots in a large pan and cover with water. Bring to the boil and cook for 6-8 mins until just tender, then drain. Can be done the day before; just chill the carrots until needed.\nMelt the butter in the same pan, add the pine nuts and sultanas, and cook for 2 mins until the pine nuts start to lightly brown. Return the carrots to the pan with the sugar, parsley and plenty of seasoning. Toss everything to coat."}
{"text": "Heat oven to 200C/180C fan/gas 6. Cut the potatoes into chunky chips, place in a pan of salted water and bring to the boil. Simmer for 5 mins until softened slightly, then drain and leave to steam-dry for a few mins.\nPour 3 tbsp of the oil into a shallow baking tray and place in the oven to heat for 5 mins. Meanwhile, toss the chips with the paprika, cayenne pepper and some salt. Carefully tip the chips into the hot oil and return the tray to the oven to cook for 40 mins, tossing them halfway through cooking.\nTen mins before the chips are ready, heat a large griddle pan. Cook the ham slices for 3 mins each side until they are hot and have griddle lines on both sides. Transfer to a plate to keep warm. In a small frying pan, heat the remaining oil and fry the eggs to your liking. Top each slice of ham with an egg and serve with the oven chips, and ketchup if you like."}
{"text": "Heat oven to 190C/170C fan/gas 5. Grease 2 x 20cm loose-based sandwich tins and line the bases with discs of baking parchment. Put the butter, sugar, eggs, flour, coconut, orange zest and baking powder in a food processor or food mixer and blend or beat until well combined, thick and creamy. Do not over-blend or the cake will be tough rather than light. If you don’t have a food mixer, put all the ingredients in a bowl and beat hard with a wooden spoon until soft and creamy.\nSpoon the mixture evenly into the prepared tins and smooth the surface. Bake on the same shelf in the centre of the oven for 25 mins or until well risen and just beginning to shrink back from the sides of the tin. Remove the tins from the oven and leave to cool for 5 mins before running a knife around the edge of the cakes and turning out onto a wire rack. Peel off the parchment and leave to cool completely.\nWhen the cakes are completely cold, very carefully cut horizontally through each one with a serrated knife to make 4 thin sponges. To make the frosting, cut the passion fruits in half and scoop into a sieve. Press through the sieve to strain the juice – you should have 4 tbsp. Set aside and reserve the seeds. Put the butter, icing sugar and cheese in a food processor or mixer and blend until smooth. Do not overbeat or it will become runny. Slowly add the passion fruit juice and blend until just combined.\nPlace one of the sponges, cut-side down, on the metal base of the sandwich tin and put on an upturned bowl on a tray. This will help make frosting the cake easier. Spread with roughly a fifth of the frosting – just enough to cover the sponge. Use a paddling motion with a palette knife or soft spatula for the best result, trying to keep contact with the cake to prevent the sponge from lifting.\nCover with a second cake, spread with frosting and repeat the layers once more, ending with the last sponge, cut-side down. By this stage, you should have layered 4 cakes with passion fruit frosting between 3 of them. Use the remaining frosting to spread over the top and sides of the cakes to cover completely. Don’t worry if the sides are a little messy, as the grated chocolate should cover any imperfections.\nPut the cake in the fridge for 30-60 mins to allow the icing to set a little. Coarsely grate the chocolate. Working your way slowly around the cake, scoop grated chocolate onto a palette knife and sweep up the sides of the cake, pressing into the soft icing.\nTake the cake off the bowl, slide the palette knife between the cake and the metal base, and gently transfer to a plate or cake stand. (If the icing is too soft to do this, pop the cake in the freezer for 30 mins and then try again.) Chill until ready to serve. Before serving, drizzle over 1 tsp of the reserved passion fruit seeds over the top of the cake. If making a day ahead, cover with a cake tin or a bowl large enough to cover the cake without touching it, so the cake doesn’t get damaged in the fridge."}
{"text": "Slice each chicken breast in half horizontally to give 4 thin breasts, then rub with half the oil and season. Heat a non-stick frying pan and fry the chicken for 3 mins on each side until cooked through. Set aside on a plate.\nHeat the remaining oil in the pan and fry the onions for 5 mins. Slice the chicken, collecting any juices, and layer up with the onions, leaves, cucumber and dried cranberries. Mix the cranberry sauce, lime juice, 2 tbsp water and any chicken resting juices, and drizzle over the salad."}
{"text": "Cook the noodles following pack instructions, then drain and set aside. meanwhile, heat a large wok or frying pan and add the kale along with a good splash of water and cook for 1-2 mins until wilted, with a little bite remaining, then cool under running water to keep the colour.\nAdd half the oil and cook the chicken strips until browned, then remove and set aside. Heat the remaining oil and fry the ginger, pepper and sprouts until softened a little. return the chicken and kale and add the noodles.\nTip in the soy, rice wine and lime zest and juice along with enough water to create a sauce that clings to the ingredients. Serve immediately."}
{"text": "In a wok or large frying pan, heat the oil. Fry the ginger and Brussels sprouts, tossing to coat them in the oil for 5-6 mins, until slightly browned. Add a few tbsp water during cooking to stop them sticking if needed.\nThrow in the beansprouts, spring onions, honey and soy sauce, then stir-fry for 1 min. Sprinkle on the sesame seeds and serve immediately with extra soy sauce, if you like."}
{"text": "Put the butter, sugar, flour and almonds into a food processor and whizz until the mixture just comes together and forms a ball. If making by hand, first beat together the butter and sugar, then add the flour and ground almonds. Wrap in cling film and leave in the fridge for at least 1 hr.\nRemove the dough from the fridge and knead until it is soft enough to shape and roll. Divide into two even-size balls. Sprinkle a little plain flour over your work surface and roll out one ball of pastry. I find it best to start the rolling myself so that it’s even, then let the kids finish it off. The dough should be approximately 5mm thick. Using a star cutter (about 6cm wide) dipped in a little flour to stop it from sticking, cut out as many star shapes as you can. Then lightly knead the dough trimmings together and roll out again. Keep going until you have about 24 stars. Carefully place the stars on a baking sheet, making sure you keep them slightly apart.\nRoll out the second ball of dough the same way. Cut out the same-size stars and place them on a baking sheet. Now cut out a small circle in the centre of each biscuit using a small cookie cutter or the end of a large piping nozzle.\nHeat oven to 140C/fan 120C/gas 1 and cook the biscuits for 20-30 mins until just golden. Remove from the oven and place on a cooling rack to cool completely. Place a blob of jam onto the centre of the biscuits without the cut-out circle. Be generous – you want the jam to show at the edges as well as the centre. Place the top halves of the biscuits on and push down gently. These will keep in an airtight container for up to 3 days."}
{"text": "Quarter the cabbage, cut away the tough stem and thinly shred each quarter. Put on a pair of clean rubber gloves, and peel and grate the beetroot.\nPut all the ingredients in a large pan. Bring to the boil, then cover and cook over a low heat, stirring occasionally, for 45 mins-1 hr until tender. Cool to room temperature, then serve."}
{"text": "Put the quinces and lemon zest and juice in a large heavy-based pan. Add enough water to cover the fruit. Bring to the boil, then reduce the heat and simmer for about 1 hr until the quinces are very tender. Strain through a jelly bag or muslin-lined colander. Do not press out the juice – just leave it for at least 4 hrs, or ideally overnight, until the juice has dripped through.\nPut 3 saucers in the freezer. Measure the juice and return it to the pan (reserve the leftover fruit for the paste). For each 1 litre juice, add 750g sugar (or for each 100ml juice, add 75g sugar). Bring to the boil, stirring to dissolve the sugar, then boil hard until set. This could take between 5 and 20 mins. To test for set, spoon a little onto a chilled saucer, leave for 1 min, then push your finger through the juice. If it wrinkles, the jelly is set. If not, return to the heat and boil again for a few mins, then test again.\nRemove from the heat and skim off any surface scum with a slotted spoon. Stir in the butter to dissolve any leftover sediment, then stir in the rose water. Pot into sterilised jars, seal and label. \nLine a 16 x 24cm shallow oblong tin or tray with baking parchment. Tip the reserved fruit into a food processor and whizz to make a smooth-ish paste. Weigh the paste and for each 1kg paste, add 750g sugar (or for each 100g paste, add 75g sugar).\nTip the paste and sugar into a large heavy-based pan and heat gently, stirring to dissolve the sugar. Increase the heat and cook, stirring regularly, for 30-45 mins until the paste is thick and golden, and leaves a gap when you run a wooden spoon across the base of the pan. Be careful as the mixture will spit at you and can burn. Spoon into the tin or tray and smooth the top. Leave to cool, then chill overnight until it is very firm.\nWrap the paste in fresh baking parchment, then over-wrap in foil and store in the fridge for up to 6 weeks."}
{"text": "To cook the pasta, bring a large pan of water to the boil, add a generous measure of salt and tip in the pasta. Stir once and return to the boil, then boil rapidly for 12 minutes. Preheat the oven to 190C/gas 5/fan 170C.\nTo make the sauce, pour the milk into a pan and add the butter, flour and plenty of seasoning. Grate in the half nutmeg (or sprinkle in the ready ground). Bring to the boil over a medium heat, whisking all the time until it makes a smooth, creamy sauce.\nDrain the pasta and tip it into the sauce. Taste and add extra seasoning if necessary. Stir in the ham and grate in the cheddar, then tip into a shallow ovenproof dish. Dice the remaining cheeses and swirl into the pasta to make cheesy pockets.\nMix the nuts and parsley together, then scatter over the pasta. Bake in the oven for 30 minutes until the nuts are golden and crunchy and everything is piping hot."}
{"text": "Pour the Tia Maria into small cocktail or liqueur glasses. Carefully pour the cream into the glasses over the back of a teaspoon so it floats on the surface of the Tia Maria and makes a separate layer. Dust the cream with cocoa by shaking it through a tea strainer, and serve."}
{"text": "Roll out the pastry with a little flour and use to line a loose-bottom 23cm round tin (it needs to be about 5cm high). Leave the excess pastry overhanging the sides, then chill for 30 mins.\nIn a large saucepan, melt the sugar with 800ml water and the zest of 1 lemon. Increase the heat until just simmering, drop in the pears, then cover and poach for 12-15 mins until almost tender. Lift out the pears, then set aside on some kitchen paper.\nHeat oven to 200C/fan 180C/gas 6. Line the pastry case with baking paper, fill with baking beans, then bake blind for 15-20 mins until a pale biscuit colour. Remove the paper and beans, then bake for a further 5 mins. Meanwhile, put the golden syrup in a small pan with remaining zest, juice of 1 lemon and the chopped ginger and syrup, then warm until runny. Tip the breadcrumbs into a large bowl, then stir in the warm syrup and eggs.\nReduce oven temperature to 180C/fan 160C/gas 4. Slice a little off the bottom of each pear so they stand upright, then space them out in the tin. Carefully spoon in the filling and bake for 50 mins-1hr until golden and set. Cool to room temperature, slice off the excess pastry to neaten the edges, then serve with cold cream or hot custard."}
{"text": "Put the fennel in a large bowl of ice-cold water with a squeeze of lemon juice. Leave for at least 30 mins to crisp up. Drizzle more lemon juice on the avocados to stop them browning. Whisk together all the ingredients for the Marie Rose sauce in a bowl with seasoning. Set aside to chill in the fridge.\nJust before serving, drain the fennel and toss with the remaining lemon juice, dill and some seasoning. Layer the lettuce, avocado, fennel and crab in 4 x half-pint glasses – or tumblers or jam jars. Add a spoonful of sauce to each, then repeat the layers until the glasses are full, finishing with the Marie Rose sauce. Sprinkle a pinch of cayenne pepper over each cocktail and serve with lemon wedges and toast, if you like."}
{"text": "Heat oven to 200C/180C fan/gas 6. In a non-stick frying pan, cook the onions in the olive oil with some seasoning for 12-15 mins until golden and soft.\nLay the pastry on a parchment-lined baking sheet. Spread over the cranberry sauce, leaving a small border. Scatter over the onions. Bake for 20-25 mins, sprinkling with cheese halfway through.\nToss the lettuce leaves and pear with the dressing and serve alongside the tart."}
{"text": "Divide the guacamole between the crostini. Top each one with a spoonful of crabmeat. Toast the sesame seeds in a pan, then sprinkle over each crostini. Serve with lime wedges."}
{"text": "Prick each cranberry a couple of times with a fork and layer up in a large sterilised Kilner jar with the sugar. Pour over the vodka and leave for 2 weeks, shaking the jar each day.\nStrain and decant into decorative bottles. Seal and label."}
{"text": "Simmer the onions in the stock for 30 mins, adding a little water if needed to keep them covered. Meanwhile, in a small pan, melt the butter, then add the flour and cook for 1-2 mins. Stirring constantly, gradually pour in the milk, then the cream, and bring to the boil. When you have a smooth white sauce, remove from the heat. Allow to cool a little before stirring in the egg yolks, spices and seasoning.\nHeat grill to high. Drain the onions and lay them in a single layer in an ovenproof dish. Spoon over the cream sauce to cover. Grill for 5 mins until lightly browned, then scatter over the basil before serving."}
{"text": "Butter 12 holes in a muffin tin. Make up the stuffing mix with 520ml boiling water. Add the butter and stir well. Set aside to absorb the water and cool.\nMeanwhile, criss-cross two bacon rashers, with a bay leaf if using, in each space in the muffin tin, allowing the excess to overhang the tin (see step-by-step guide). Spoon the cool stuffing mixture into the tin and fold the overhanging bacon over the top to make a parcel. Secure in place with cocktail sticks. Chill until ready to bake.\nBake at 200C/180C fan/gas 6 for 30 mins, until piping hot and the bacon is cooked. (Remove cocktail sticks before serving.)"}
